{"https://securityintelligence.com/posts/egregor-ransomware-negotiations-uncovered/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-21", "source": "securityintelligence.com"}, "text": "Ransomware attacks are topping the charts as the most common attack type to target organizations with a constant drumbeat of attacks impacting industries across the board. In fact, IBM Security X-Force has seen a more than 10% increase in ransomware incident response requests compared to this time last year. Ransomware is well on its way toward becoming a global billion-dollar enterprise – one that victims are funding. Attackers are operating like a well-oiled business industry, yielding high profits in a year that most businesses struggled. Why? The new ransomware business model is relentless, extortive and paying off. IBM Security X-Force Threat Intelligence analysts, together with Cylera , an IoT and medical device security intelligence company that works with IBM Security to deliver IoMT solutions, have obtained and analyzed hours of chat correspondence and negotiations that occurred in December 2020 between the notorious Egregor ransomware actors, responsible for upwards of $80 million dollars in losses globally. The chat correspondence had negotiations with approximately 40 victim organizations they chatted with. The activity uncovered in these chat transcripts provides valuable insight into how some ransomware actors operate – from how they conduct ransom payment negotiations, to the strategies and operational structure they used. Although law enforcement took action against Egregor operations in February 2021, this discovery provides the following insightful takeaways: Defining the Ransom Demand – Initial ransom amounts ranged from $100,000 to $35 million. The average initial ransom demanded was $5 million. During one negotiation, the threat actors indicated that their initial ransom demand is 5-10% of the potential estimated loss associated with a data leak. Ransom Negotiations – Several factors played a role in determining the final negotiated ransom amount or data leak outcome, including the operators’ perception of the victim’s ability and willingness to pay as well as the victim’s negotiation strategies such as attempting to buy time and delay the payment. Operational Structure – The chats reveal a highly sophisticated organized crime group was behind Egregor operations. Numerous roles or teams were mentioned including the financial department, data manager, attackers/IT specialists, PR manager, publications manager and decryption tool master-maker. Compassion with a Catch – X-Force researchers maintain the operators of ransomware like Egregor are nefarious actors. However, the chat logs revealed a few glimpses of what could be perceived as empathy or practical consideration. During one negotiation, Egregor offered to provide the decryption key, in exchange for the organization publicly announcing that the group does not intentionally target hospitals or charities. In a chat with another victim, the threat actors discuss the hardships of COVID-19, even wishing the victim happy holidays. What is ‘Egregor’? The Egregor ransomware was first reported publicly in mid-2020, making it a relatively new entry into the criminal economy. Egregor operators work through an affiliate model, meaning a small group of actors run and maintain the Egregor code base and other actors purchase access to Egregor and use the malware on systems they infect. This model is best known as Ransomware as A Service (RaaS). Many security analysts speculated that Egregor was the follow-up to the Maze ransomware, pointing to significant technical overlap between the two ransomware families after Maze’s threat actors declared retirement in November 2020. Egregor gained significant recognition in 2021 as affiliates shifted from Maze to using this new ransomware family and leaked stolen information from impacted organizations, extorting them in efforts to collect a ransom. The impact of Egregor ransomware has been felt worldwide with an estimated $80 million dollars in profit through their operations against at least 150 organizations. Regarding victims, the highest number of reported cases was in the United States with infections clustered primarily within the manufacturing and retail industries.  Some of the larger targets have included Barnes and Noble, Randstad, French logistics firm Gefco and video game companies Ubisoft and Crytek. In February 2021, a joint French and Ukrainian law enforcement operation disrupted Egregor’s infrastructure and arrested multiple Egregor associates.  As of the time of this publication, X-Force researchers are not aware of active Egregor intrusions. What’s in a Ransom? After reviewing elaborate chat logs between Egregor actors and representatives from victimized organizations, we obtained interesting insights about how the ransom amount was fixed and the overall negotiation process. In a common flow of events, upon initial contact with victims, X-Force and Cylera analysts observed Egregor ransomware actors making an initial demand for a ransom payment that depended on the victim and their perceived ability to pay. Analysis of approximately 50 ransom negotiations in Egregor chat logs from December 2020 shows that ransom demands varied wildly. Average initial ransom demand $5,024,000 Average ransom payment $387,700 Highest initial ransom demand $35,000,000 Lowest initial ransom demand $100,000 Sum of all ransom demands $226,080,000 Figure 1: Egregor ransom demands and average ransom payment, in U.S. dollars, December 2020 (Source: IBM X-Force/Cylera) How each ransom amount was determined was likely a judgment call based on a combination of publicly available information about the victim along with what the operators perceived the victim could afford to pay. Ultimately, researchers observed that the threat actors appeared to strike a balance between a victim’s ability and willingness to pay while considering multiple additional factors. In one negotiation, Egregor actors gave the victim organization an initial ransom demand of $1.7 million. Through some negotiating by the victim, explaining they were a small company, Egregor operators decreased the ransom to $1 million. In another example, Egregor operators alluded to using an analyst associated with Egregor operations to estimate a victim’s total loss if they were to forego paying the ransom and instead suffer a data leak. The attacker’s comments indicate that the initial ransom demand is 5-10% of that estimated loss. In another example, a victim pleads with the attackers for a lower ransom price due to the inability to pay as a result of COVID-19 pandemic-related hardships. The Egregor actors demanded proof from the victim that they were experiencing financial hardships, even going as far as requesting information from the IRS. Buying Time: A Victim’s Strategy Deciding whether to pay and negotiating with the attackers is a hotly contested endeavor in the security community. Both paying a ransom or deciding not to pay carry consequences. We encourage organizations to review X-Force’s Definitive Guide to Ransomware , which lists the main topics companies should consider when the question arises as to whether they should pay a ransom. Our review of the Egregor chat logs provides some insight into what mitigation or ransom reduction techniques could be effective if one is ever faced with a ransomware incident: Using company size to discount the ransom: In some cases, victims explained the size of their business with Egregor actors, which resulted in lower ransom demands. Getting money and cryptocurrency takes time: In other instances, analysts observed victims explaining the process for acquiring money to pay the ransom, which extended the time before the actors leaked information about the compromised organization. Well-Organized Cybercrime While parsing through multiple conversations, X-Force and Cylera analysts noticed a variety of roles the threat actors alluded to during the negotiation process. Egregor negotiators referred to themselves as “members of the support team” who only get a fixed salary and fear being fired. During discussions, they referred to other teams, including the financial department, data manager, attackers/IT specialists, PR manager, publications manager, and decryption tool master-maker. Operators with a Heart? Despite the intention of stealing millions of dollars from victims, the attackers have backed off from their demands in some circumstances if they believed they could receive positive press for doing so. In one instance, X-Force and Cylera analysts observed negotiations between Egregor and a charity.  After a long conversation between the victim organization and Egregor operators, Egregor offered to provide the decryption key, asking that the organization publicly announce that the group does not intentionally target hospitals or charities. In another ransom negotiation, the victim, a small U.S. dental practice, and Egregor support are discussing the hardships of 2020, specifically COVID-19. Key Takeaways Despite the holiday wishes and reduced ransom in some instances, the December 2020 chat logs obtained by X-Force and Cylera demonstrate that many Egregor attacks were a successful, ruthless criminal operation. Although the threat actors have ceased from using the Egregor ransomware family specifically, and only since the law enforcement activity in February 2021, X-Force analysts believe that a new infrastructure can be mounted and the same code can be used again in its original form or as modified code. Moreover, with these attacks yielding extremely high profits for those residing in less prosperous parts of the world, new ransomware families and gangs will continue to emerge and may take Egregor’s place in the near future. Ransomware attacks continue to be the top threat to organizations globally as this threat grows and expands its reach year over year. Yet, even in the face of sophisticated threats, there are actions companies can take that can help mitigate risks and minimize damage: Establish and drill an incident response team. Whether in-house or as a retained service, the formation of an incident response team and drilling the most relevant attack scenarios to your organization can make a big difference in attack outcomes and costs . Establish and maintain offline backups. Ensure you have files safely stored from attacker accessibility with read-only access. Also consider the use of offsite/cold storage solutions. The availability of backup files is a significant differentiator for organizations that can help recover from a ransomware attack. Implement a strategy to prevent unauthorized data theft, especially as it applies to uploading large amounts of data to legitimate cloud storage platforms that attackers can abuse. Consider blocking outbound traffic to unapproved cloud hosting services. Employ user and entity behavior analytics to identify potential security incidents. When triggered, assume a breach has taken place. Audit, monitor and quickly act on suspected abuse related to privileged accounts and groups. Deploy multifactor authentication on all remote access points into an enterprise network — with particular care given to secure or disable remote desktop protocol (RDP) access. Multiple ransomware attacks have been known to exploit weak RDP access to gain initial entry into a targeted network. Use penetration testing to identify weak points in enterprise networks and vulnerabilities that should be prioritized for patching. In particular, we recommend implementing mitigations for CVE-2019-19781 , which multiple threat actors have used to gain initial entry into enterprises in 2020 and 2021 — including for ransomware attacks. Consider prioritizing the immediate remediation, as applicable, of the following frequently exploited software vulnerabilities: CVE-2019-2725 CVE-2020-2021 CVE-2020-5902 CVE-2018-8453 VPN-related CVEs CVE-2019-11510 CVE-2019-11539 CVE-2018-13379 CVE-2019-18935 CVE-2021-22893 RDP Restrict port access on TCP port 3389 Apply multifactor authentication to remote access logins Remediate RDP vulnerabilities such as Windows RDP CVE-2019-0708 (BlueKeep) CVE-2020-3427 CVE-2020-0610 CVE-2020-0609 Segment networks according to the data they host. Encrypt the data most likely to be stolen in an attack. Consider adopting a Zero Trust approach and framework to better control what users can access and potentially halt an attack in its tracks. If you are experiencing cybersecurity issues or an incident, contact X-Force to help: U.S. Hotline: 1-888-241-9812 | Global Hotline: +(001) 312-212-8034. Learn more about X-Force’s threat intelligence and incident response services ."}}
{"https://securityintelligence.com/articles/ransomware-ddos-attacks-beyond-threats-today/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-21", "source": "securityintelligence.com"}, "text": "The recent DarkSide attack makes it clear: no system is safe from ransomware. And while the attackers say they weren’t out to hurt anyone, only to make money, the impact is the same. It could lead to potential disruptions of critical services across the country. At the same time, it stokes fears that similar attacks could happen more often in the future. The long-term outcome of these attacks, however, is a hyper-focus on ransomware as the top threat to governments and enterprises. For example, the federal government recently pledged billions of dollars to fight ransomware. There’s no doubt that ransomware remains a major (and evolving) risk. However, this IT tunnel vision makes it easy to miss the forest for the trees. You don’t want to let distributed-denial-of-service (DDoS) attacks and other problems slip behind network defenses unnoticed. Here’s a look at four threats just as frightening as ransomware, and what enterprises can do about them. Third-Party Software Problems Third-party software solutions are key to keeping business running smoothly, but come with the risk of undetected or zero-day threats. Left unchecked, at-risk third-party programs could provide lateral access points for threat actors to compromise key systems. Consider the SolarWinds attack in February. Threat actors managed to infiltrate a software update package with malicious code. They then pushed it out to more than 18,000 businesses, along with government agencies such as the U.S. Department of Homeland Security and the Department of the Treasury. The most frightening part of this third-party problem? Trust. Companies remain vigilant for ransomware attacks on their networks. Meanwhile, trusted third-party providers often get a free pass into corporate systems because they’ve never been the source of problems in the past. The result is an infosec complacency that can lead to serious security risk. On average, it now takes 280 days for companies to detect security risks, even when they’re actively looking. The solution starts with zero trust security . By setting up protective frameworks that use authentication rather than assumption, enterprises can reduce the risk of third-party compromise. It’s worth taking the time to look at all third-party interactions, even those deemed safe in the past. This increases the chances of detection and identification of security risks outside the network perimeter. MITM Attacks The rising use of remote connections has created a perfect storm for man-in-the-middle (MITM) malware attacks. This type of attack listens in on digital connections and could exfiltrate key data. Often designed for minimal impact, these attacks can go unnoticed for weeks or months. In the past, the fear around MITM attacks has been the risk of data eavesdropping. People feared threat actors could capture unencrypted data, such as plaintext emails, and then use it to compromise systems at scale. As noted by Ars Technica , however, MITM attacks are now evolving to target supposedly secure HTTPS protected websites. Known as cross-protocol attacks, these efforts leverage the function of transport layer security protocols. With them, they can protect the integrity of TCP connections rather than the server itself. This makes it possible for attackers to redirect HTTPS traffic to a substitute file transfer protocol server. From there, that could empower cross-site scripting or cookie-stealing attacks. Standard MITM attacks can often be prevented with robust VPN solutions. However, security experts recommend stricter enforcement of two current protections, application layer protocol negotiation and server name indication. This will help deal with new MITM efforts. DDoS Attacks Internet of things (IoT) devices are now commonplace across enterprises in all industries. So, DDoS attacks have increased in a big way. Threat actors can ramp up attack volumes rapidly, giving companies almost no time to respond before critical systems come crashing down. For cyber criminals, DDoS offers a low-cost, high-return attack type. IoT devices are cheap, plentiful and many are easy to compromise thanks to minimal or non-existent factory security settings. Companies are often willing to pay once they realize online services won’t be coming back up anytime soon unless the attackers turn down the traffic. The result is a frightening scenario for enterprises. Sudden, high-volume attacks from disparate sources could knock critical services offline for days or weeks. That, in turn, leads to major revenue and reputation loss. When it comes to defending against DDoS attacks, two components are critical. First is preparation. These attacks are a matter of when, not if. Companies need incident response plans in place that find potential weak points, critical control mechanisms and simple ways of reducing their impact — such as blocking traffic from specific locations. It’s also a good idea to outsource DDoS protection where possible. Using a trusted provider with cloud experience and a reputation for reliable work and real-time detection can give you more lead time to mitigate DDoS impacts and other problems. Social Engineering Efforts Despite how simple it is, social engineering efforts, such as phishing, remain popular. Why? Because they continue to see success. By collecting both publicly available and private corporate data, attackers can build social profiles that appear real, compromise corporate accounts and gain access to high-level systems and services. Consider the Colonial Pipeline attack. While the initial effort was ransomware, cyber criminals have leveraged the desire for improved enterprise defenses to craft a targeted phishing campaign. Companies have been receiving emails that discuss how severe this attack was and then encourage them to download ‘ransomware system updates’ — which are really links to malware. Similar campaigns have been carried out around COVID-19 vaccines, natural disaster relief and nearly every other news-worthy event in the last five years. For enterprises, the prevalence of phishing attacks is the most frightening thing about them. While on their own they represent minimal risk, increasing volume and velocity means that one of these efforts is bound to break through. Even worse? Staff who fall for these attacks may not be aware they’ve done it. Or, they may be worried about the consequences if they come clean about their mistake. Mitigating the risk of social engineering efforts relies on education. That’s because this is an inherently human problem. Social attacks are designed to take advantage of our natural, social tendencies. By educating staff about common phishing techniques, appropriate threat responses and making it clear that risk reporting — either of a potential phish or already clicked links — will be met with immediate action, companies can create a culture that prioritizes safety over speed. Watching for Threats Beyond Ransomware While ransomware remains a substantive risk, other threats are similarly frightening. But at the same time, compromised third-party software, MITM attacks, DDoS attacks and social engineering can be mitigated with robust security management."}}
{"https://securityintelligence.com/articles/fragattacks-everything-you-need-to-know/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-19", "source": "securityintelligence.com"}, "text": "A cybersecurity researcher discovered a new category of Wi-Fi vulnerabilities recently. But the surprising news is that this new category is actually very old. Called FragAttacks, these 12 Wi-Fi vulnerabilities have existed since the late 90s. But they’re new to the cybersecurity world because people only recently discovered and described them. Researchers unveiled the details on May 12, some nine months after discovery. The researchers will present their work at the USENIX Security conference at Black Hat USA in late July and early August. How Does This Vulnerability Work? Discovered and described by Belgian security researcher, Mathy Vanhoef, these FragAttacks (short for fragmentation and aggregation attacks) affect most Wi-Fi devices shipped since the late 1990s. Vanhoef is well known in wireless security circles because he found the KRACK Wi-Fi vulnerability about four years ago. He believes that every Wi-Fi product features at least one of the vulnerabilities described. The flaws affect all recent Wi-Fi security protocols, from the oldest wired equivalent privacy (WEP) specification to the newest Wi-Fi Protected Access 3 (WPA3) specification. What they all have in common is they exploit Wi-Fi’s fragmentation feature. One of the mundane functions of how Wi-Fi works is that it’s constantly breaking data into smaller units, fragments, and then taking those smaller pieces and reassembling them into larger pieces. This shuffling of data chunks, which happens constantly and on the fly, could enable threat actors within radio range to insert malicious frames into networks that would otherwise be protected by WPA encryption. Three of these vulnerabilities exist in the form of flaws in the Wi-Fi standard itself. The rest result from programming errors made by Wi-Fi makers. These enable attackers to compromise devices on the network and steal data. What Can FragAttacks Do? When attackers exploit FragAttacks, they could run malicious code, take control of devices, capture data and use the devices to launch other attacks. The good news is these attacks aren’t easy, or even possible at scale. In order to exploit FragAttacks, the attackers must be in radio range of the network. They also require users to take action or unusual network settings. As such, FragAttacks aren’t practical as large-scale attacks. Researchers have never found FragAttacks being exploited in the wild. However, cyber attackers now know they exist. And the clock is ticking. A Closer Look Attackers can exploit FragAttacks to steal data via a Wi-Fi network, bypassing Wi-Fi encryption that should be protecting the data. (One notable exception: you cannot bypass HTTPS encryption by exploiting FragAttacks.) Worse, threat actors can use FragAttacks to mount attacks against devices connected to the Wi-Fi network, including Internet of Things (IoT) devices. Those vulnerabilities open up the same access to poorly secured devices attackers would have if they logged on to the network. Some of these vulnerabilities can be used to inject malicious, unencrypted Wi-Fi frames that look like handshake messages. Threat actors could also intercept a device owner’s information by tricking the client into using a malicious DNS server. Or, they could bypass the NAT firewall, giving the attacker potential access to devices connected to the Wi-Fi network. Multiple Types of Attack The flaws enable three different types of attack: An aggregation attack exploits the frame aggregation feature of Wi-Fi. In this attack, the threat actor tricks a victim into changing the setting on specific packets. This allows the attacker to intercept traffic by making it use a malicious DNS server. A mixed key attack exploits the fact that the fragmentation feature of Wi-Fi assumes broken-up packets are encrypted using the same key as the larger original packet. By mixing fragments encrypted with different keys, attackers can exfiltrate data from the network. And the third enables a fragment cache attack. This exploits non-reassembled fragments left in memory and involves injecting a malicious fragment in the fragment cache of the targeted access point. When a victim connects and sends a fragmented frame, it can be reassembled with the malicious fragments. Vanhoef showed these with three examples. In one, he exploited the aggregation design flaw to steal a username and password. In another, he was able to remote-control a home smart power socket, turning it on and off. And in the third, he took control of an old Windows 7 PC. How to Protect Against FragAttacks You can protect your business or agency’s Wi-Fi networks from FragAttacks by following well-known practices for general Wi-Fi safety. Always use HTTPS to encrypt all web traffic. Some browsers, such as Firefox, can alert users when visited websites don’t use HTTPS, but they have to be actively configured to do so. Use an application that encrypts files transfer locally over the network. Urge or require employees to use the HTTPS Everywhere browser plugin. Update your WiFi and broadband firmware often. Some of these vulnerabilities have been fixed by some vendors; some fixes are coming soon. Find out if there are any devices on the network that do not receive updates and replace them with devices that do. Users should always use a virtual private network (VPN) when connecting via any public WiFi network. Update all your devices, including IoT devices . Add WiFi security training for remote workers and focus on keeping separate work-home networks and systems. Raise awareness that home devices, like smart TVs and home IoT devices, are open to attack. Peruse Vanhoef’s Github information and tools. These include descriptions of each FragAttack vulnerability, a research paper on the issue, examples that show the vulnerabilities, their practical exploitation and tools for testing for vulnerabilities. The content also includes advice from companies that have addressed the issue. FragAttacks are new and rare and in some cases, highly theoretical. But they’re still out there, so it’s vital as always to follow good Wi-Fi security measures."}}
{"https://securityintelligence.com/articles/cyber-insurers-making-ransomware-worse/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-16", "source": "securityintelligence.com"}, "text": "In mid-May, one of the largest insurance companies in the U.S. paid $40 million to ransomware attackers. Two people familiar with the matter told Bloomberg that the malicious actors stole an undisclosed quantity of data and then effectively locked the insurer out of its network for two weeks. The company ignored the attackers’ demands at first. But, a week into the infection, it decided to make contact with the attackers. This effort led to negotiations in which the insurer convinced the attackers to drop the ransom from $60 million to $40 million. Cyber Insurers’ Straight and Narrow View of Ransomware The attack discussed above stands out for a couple of reasons. First, it’s worth noting that $40 million is the largest ransom paid by any ransomware victim anywhere to date. Second, it’s important to point out that the victim was a company that offers cyber insurance itself. Why is the second point relevant? Well, there’s a paradox when it comes to cyber insurance companies and ransomware attackers. On the one hand, the former use monetary support to help their clients recover if and when they fall victim to the latter. On the other, cyber insurance companies normalize the fulfillment of ransom demands. Paying up puts all organizations at greater risk of an incident in the future. The issue is that insurers take a straight and narrow approach to the question of whether to pay. Insurers are concerned about the costs of recovery and business disruption. Is it cheaper for an organization to pay the ransom? Or is it cheaper if an organization attempts to restore their systems and data using existing backups? Download the Definitive Guide to Ransomware Why Ransomware Victims Shouldn’t Pay Up There’s a lot of uncertainty associated with the latter scenario. So, cyber insurers might be inclined to press their clients to pay the ransom. It’s a problem when they do. As noted by SC Media , they aren’t in a position to measure the more difficult-to-measure costs of paying a ransom. Such damages include a civil penalty that a victim could incur if they end up paying an attacker who happens to be a sanctioned individual, as the U.S. Department of Treasury’s Office of Foreign Assets Control announced in October 2020. They also include the negative publicity that often comes with supporting those who abide by ransomware’s business model. How cyber insurers view ransom payments is relevant given the proportion of claims that involve ransomware in some way. Ransomware incidents accounted for 41% of cyber insurance claims filed in the first half of 2020 — an increase of 260%. During that same period, ransom demands increased by 47%. Cyber insurance claims covered anywhere from as low as $1,000 to as high as $2 million per ransomware event. Ransom Demands Increasing The fact that ransom demands are increasing isn’t a coincidence. Per Bloomberg, the average ransom demand increased to somewhere between $50 million and $70 million over the first half of 2021. Even so, ransomware victims only ended up paying between $10 million and $15 million on average. The reality is that victims like the U.S. insurance company discussed above succeed in negotiating the ransom payment down. Not only that, but many victims have cyber insurance policies that cover some, if not all, of the cost of paying a ransom. Ransomware actors understand that many of their victims have cyber insurers paying with or for them. They can leverage that fact to jack up the price of their ransom demands, all while keeping the expectation that they’ll be paid by the victim, the insurance company or both. Anti-Ransomware Best Practices Amid Possible Changes The cyber insurance landscape could be changing with respect to ransomware. In the beginning of May, for instance, a global insurance company announced it would no longer write insurance policies in France that reimburse ransomware victims for paying the ransom. The insurance company clarified that its decision did not apply to existing policies, reported ABC News . More than that, it said that it would continue to provide coverage for responding to and recovering from a ransomware infection so long as the victim didn’t pay the ransom. Organizations don’t want to rely on an insurer when it comes to a ransomware attack. Cyber insurance companies could pressure them into paying the ransom and thereby contributing to the ransomware business model more broadly. The only answer is for organizations to prevent a ransomware infection from occurring in the first place. Layers, Like an Onion They can prevent a ransomware attack by taking a layered approach. First, they can invest in a security awareness training program that educates their workforce about some of the most common types of ransomware delivery vectors in circulation today. Organizations should specifically focus on using phishing simulations to familiarize all their employees with malware borne by email-based attacks. In doing so, organizations will take a step forward towards building a positive security culture . Second, organizations need to blend those human controls with technical security measures. Data backups are just the beginning. Take phishing as a delivery vector, for instance. Organizations can use disallow lists to prevent company inboxes from receiving mail from blocked websites or from opening email attachments in unusual formats. They can also use encryption to protect their data from the start. Doing so will not only help organizations safeguard their sensitive information against the threat of double extortion, it will also potentially trick a ransomware strain into deeming that data unsuitable for encryption. Putting Cyber Insurance into Context Cyber insurance is not a digital security strategy; it’s part of one. More than that, it functions best as a last resort and not a first response. Accordingly, organizations need to focus on implementing all the security measures discussed above as a means of defending themselves against ransomware. Doing so will help them to save time and money if and when it comes time to respond to a ransomware attack. If your organization requires immediate assistance with incident response, please contact IBM Security X-Force’s US hotline 1-888-241-9812 | Global hotline (+001) 312-212-8034."}}
{"https://securityintelligence.com/posts/dont-forget-internet-things-safety-vacation/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-13", "source": "securityintelligence.com"}, "text": "Home is where the ‘smart’ is. A recent study revealed the average American household has 25 connected or Internet of Things (IoT) devices. The number of consumers who have smart home devices connected to their home internet has grown by 38% since the pandemic began. The findings don’t surprise Brad Ree, the chief technology officer (CTO) of Internet of Things solutions at the ioXt Alliance . Nor do they surprise Adam Laurie, IBM Security X-Force Red ’s lead hardware hacker. Ree has more than 80 connected devices in his home. Laurie recently found five connected or IoT devices that he didn’t know existed inside his home. Even more, when he looked at the firewall rules on his internet service provider’s router, the universal plug and play (UPnP) was switched on, adding firewall rules for smart devices in his home unbeknownst to him. In addition, with the pandemic nearing the rearview window, employees are starting to travel again. This increase also means vacation rental home bookings are up. One vacation home company notes that by the end of March 2021, 90% of its homes in New Jersey and Cape Cod were booked for July. Another company revealed the booking lead time for summer stays at its rental properties is 147 days this year. Internet of Things Security in Vacation Homes While renting a vacation home can provide more space for less money, it can also create more attacker opportunities. For example, Ree shared a story about a recent family vacation. He, his wife and kids stayed in a vacation rental home from where he worked for a week. Being the security savvy CTO that he is, the minute he entered the home, Ree performed a port scan to see if anyone else could connect to the network. To his surprise, various past visitors had added multiple firewall rules to the home network. Any one of the rules could have enabled the visitors to remain connected, even remotely. The access also meant if the visitors had malicious intentions, they could compromise Ree’s laptop and potentially his employer’s network. “You are staying in an open environment,” says Ree. “Don’t assume it is your house. In a vacation rental home, an attacker could easily scan open ports and see what’s connected.” Invisible Connections Every time you rent a vacation home and connect to its network or an IoT device , you leave a footprint behind that can be leveraged by an attacker. Laurie gave an example. Let’s say your children play video games while on vacation. They may use a headset, which plugs into the game console, to chat with other players. The console connects to the router, which creates a firewall rule that allows players to connect to a shared port. Then, whenever someone connects to that port on the internet service provider’s external address, that person can also connect to your children’s game console. Removing access, as Laurie points out, is tough. You would need a UPnP daemon, which the average consumer most likely does not have. “When you leave the house, you can always connect to that port,” says Laurie. “If an attacker were to connect to that port, she would be routed to an address assigned to the game console.” Worse yet, imagine if the next visitor connected his work laptop to that same network. The visitor could run a business process on that same open port. Therefore, they can expose the laptop to other users with previous access. Vacation rental home networks typically do not adhere to the same security protocols as businesses. In business environments, routers are usually under an administrator’s control. That admin also likely limits IoT devices. The network isn’t open and insecure protocols are off. Many businesses apply the zero-trust model to their networks. Home and vacation rental home networks, on the other hand, typically do not have that kind of commercial-grade security. Ree refuses to even charge a phone in vacation rental homes for that reason. Protecting Against Loose Internet of Things Rules So how can you protect your own devices the next time you stay in a vacation rental home? The easiest step is to immediately connect to the corporate virtual private network. Savvier technology users may want to go an extra step and run their own port scans. Laurie applies those kinds of extra security measures when he rents homes and cars. In a rental car, he always checks the Bluetooth history and conducts a factory reset before and after using the vehicle. You could do the same in a vacation rental home, although it may create a conflict with homeowners if they set up their own rules. Ree stresses the need for IoT and smart home device manufacturers to step up their security controls and processes. Routers, for example, should not allow routing between nodes. The Federal Bureau of Investigation recommends that UPnP be turned off, although in some routers it may be turned on by default. Implementing a standard security label or certification could also help from a consumer and manufacturer standpoint. Manufacturers can validate their devices and have security controls and processes built-in before they go to customers, and customers can know which devices are more secure based on the security label. IBM X-Force, Silicon Labs and the ioXt Alliance are presenting a virtual panel at 11 a.m. EDT on July 21, 2021, where experts will discuss three IoT- and operational technology-related security topics — critical infrastructure security, standardizing IoT security and the perceived privacy and security problem. Register here"}}
{"https://securityintelligence.com/posts/roboski-global-recovery-automation/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-12", "source": "securityintelligence.com"}, "text": "In a recent collaboration to investigate a rise in malware infections featuring a commercial remote access trojan (RAT), IBM Security X-Force and Cipher Tech Solutions (CT), a defense and intelligence security firm, investigated malicious activity that spiked in the first quarter of 2021. With over 1,300 malware samples collected, the teams analyzed the delivery of a new variant of the RoboSki packer, which is widely used to thwart detection and deliver commodity RATs to enterprise networks. CT automated the capability to rapidly extract configuration data from malware to produce actionable indicators of compromise (IOCs). Analysts tested the ability to statically extract configuration data, bypassing dynamic anti-analysis features using data processed by CT , discovering approximately 1,300 additional samples. The RoboSki-packed malware samples feature new capabilities, such as the ability to load resources and convert pixelated data to RGB order, resulting in the RoboSki component, and decoding and decrypting a ReZer0 loader. The ReZer0 loader can embed malware or fetch it from remote servers and is known for its ability to deliver encrypted payloads and anti-sandbox checks. Layering loaders is a tactic many malware distributors use to evade anti-virus detection and security scanners. CT partnered with IBM X-Force to uncover how attackers delivered the commercial RATs . While analyzing the delivery of RoboSki samples, X-Force isolated a sample of 21 phishing emails addressed to organizations worldwide in and around mid-February 2021 with attachments including RoboSki-packed malware. The emails, which feature global trade themes, lead to the delivery of malware, such as Agent Tesla, FormBook, njRAT, NetWire and the Remcos RAT. X-Force found infrastructure overlaps with the delivery of RoboSki’s distribution and recent or ongoing activity spreading malware such as AsyncRAT, LokiBot, NanoCore and the Gamarue Botnet, in addition to Agent Tesla , FormBook, njRAT , NanoCore and Remcos RAT , which have previously been reported on IBM’s premium threat intelligence platform TruSTAR and Security Intelligence . Prior references to the RoboSki malware were made in mid-2020 , linking it to activity by a group known as Vendetta. X-Force and CT do not necessarily attribute the new RoboSki variant analyzed, or its means of delivery, exclusively to Vendetta. The teams believe that the activity points to independent cyber criminals distributing malware globally as part of a continuous effort to evolve tools and methods, obfuscate activity and evade detection. Are Cyber Criminals Riding the Tide of Global Recovery? Last year saw the global economy experience the worst peacetime economic decline since the Great Depression, but in its economic growth forecast for 2021, the International Monetary Fund predicts renewed global economic expansion of 6% in 2021. Arguably underpinning this recovery in global trade is a worldwide expansion in the e-commerce ecosystem , which grew by a staggering 30% within the last year . Doubtlessly attune to these changes in the digital current, malicious cyber actors are baiting their hooks to imitate authentic requests for quotations, payment orders and shipping updates, hoping to snare those logistics linchpins, like manufacturers, shippers and suppliers, in the global supply chain. X-Force analysts studied a sample of 21 phishing emails containing malicious attachments that deliver the RoboSki packer and subsequently a variety of final payloads. Analyzed emails were sent between the second and third week of February 2021 and were categorized into three main themes: purchase order/request for quotation/inquiry, shipping notification and payment notice/bank transfers. The sample emails were sent to 15 unique companies located in 12 different countries across Europe, South America, the Middle East and South Asia. In all instances, the phishing emails were addressed to companies associated with the manufacture or export of items supporting and/or supplying construction, transport, engineering or energy services. Most samples were directed at entities in Europe, with the highest concentration of targeted organizations based in Romania, Italy and Germany. X-Force and CT analysts assessed with high confidence that global trade- and logistics-themed phishing campaigns will continue to plague organizations into the year ahead, as the recovery of global trade unfolds over time. Organizations, especially those engaged in import and export, should exercise extra caution and seek to cultivate a culture of cyber awareness among management and employees. New Orders and Requests for Quotations Most emails in the sample were sent to a Romania-based company characterized as a global supplier of electrotechnical power products, including power transformers and rotary electric machines. Several of the emails were crafted to appear to originate from real company email domains, indicating the senders are trying to increase the likelihood that the phishing email appears legitimate. Apart from a single instance, the emails pose as an inquiry for purchase orders and requests for quotations. All emails are written in poor English and include an attached purchase order or quotation contained in an archive file (Zip, CAB or RAR), which, when executed, drops the RoboSki-packed malware. Figure 1 : Sample email sent to a Romania-based company Additional phishing messages uncovered with the same theme were composed in varying qualities of English and directed at seven unique entities across Europe and South America, targeting companies that manufacture automobile parts, machinery and energy components. While the quality of the text differs by sample, the uncovered emails contain signature blocks attempting to impersonate well-known global corporations. Where’s My Package? The teams found the email sender janattbs7[@]gmail[.]com sent not only an email to the Romanian-based company regarding a “quotation request,” but also an email for “shipping documents.” Due to additional emails sent to the same company with varying themes, X-Force researched the spoofed sender company as well as the recipient company; however, no clear connection between the two was discerned. Some of the sample emails used package delivery lures that purported to come from DHL or FedEx . These were typically sent to companies within the construction industry that support oil companies and government clients, as well as water technology and processing. Figure 2: Sample DHL email “Dear Customer, Your package has arrived at the office. Our courier could not deliver it to your address due to a wrong address provided by our customer. To receive your package, please go to any of our nearest office and show this receipt. CLICK ON THE ATTACHED FILE TO DOWNLOAD AND PRINT THE RECEIPT. Greetings The DHL team” Fake Notices , Payments and Invoices Other emails in the sample featured fake payment notices, invoices or bank transfers and were sent to organizations in Europe and the Middle East. Half of the samples were composed in the native language of the targeted recipients and contained signature blocks of authentic banks or import/export companies. The remaining emails were composed in well-written English and featured signature blocks impersonating the managing director of a legitimate global shipping and logistics/supply chain management company based in Bangladesh. While the sender email addresses did not match the signature blocks featured in each of the samples, in all cases the signature blocks themselves imitated authentic companies that may have a legitimate interest in the products or services of the targeted corporation. In two instances, emails used the encrypted email service Tutanota (ex. imports[@]tutanota[.]com[.]de.). Affixed to each of these emails was an attached archive file (TAR, 7z, GZIP) posing as either transfer requests, SWIFT statements from an authentic bank or numeric codes potentially pointing to account numbers. Figure 3: Sample payment email Observations From X-Force’s Analysis X-Force uncovered several unique characteristics that provide insight into the attack infrastructure used in the various delivery of RoboSki-packed malware to facilitate operations. The activity examined involved at least 289 email addresses for exfiltration, of which about 150 do not appear legitimate nor have discoverable returns, while more than half appear to be valid accounts. About 20% of the valid email accounts showed server errors, and roughly 10% of accounts were associated with catch-all servers that accept emails sent to the domain, regardless of whether the mailbox exists or not. The remaining accounts returned as either belonging to invalid domains with no mail exchange record, bad syntax, transient network faults or unknown status. Infrastructure Overlaps with Distribution of Other Malware The researchers isolated about 165 different command and control (C2) IP addresses and domains that were used in the distribution of malicious payloads. Several IP addresses and domains have been reported in previous malware campaigns or are associated with recent or ongoing activity delivering a variety of other malware. Some malware variants include Eldorado, Telegram Bot, NanoBot, LokiBot and the password stealers Fareit and Redline. The following represents a sample of the recent or ongoing campaigns that share or have shared infrastructure overlaps with the RoboSki packer. AsyncRAT Some malicious overlaps include domain 8123wsheurope.access[.]ly, which resolved to the RoboSki-packed AsyncRAT C2 IP address 79.134.225[.]44 in December 2020. Recently, this domain was reported as being part of activity in which attackers used collaboration platforms, such as Slack, to evade detection and deliver several types of RATs and stealers. AsyncRAT has also been active in the past month in attacks on the aviation, travel and cargo industry. NanoCore RAT In the same netblock as the AsyncRAT IP address, a RoboSki-packed NanoCore C2 IP address 79.134.225[.]71 resolved to adam9.ddns[.]net, which was a C2 domain reported in late 2020 with relation to activities by the Blade Eagle (Blade Hawk) advanced persistent threat (APT) group. In that campaign, Blade Eagle targeted organizations in the Middle East and West Asia. We also found that C2 domains uyeco[.]pw and zolta[.]icu were seen in a recent malspam campaign in which malicious executable file formats were abused and used in a way that hid them from email scanners and anti-malware software, ultimately to deliver the NanoCore RAT. The infection tactics, techniques and procedures (TTPs) were similar to the ones used to deliver the RoboSki-packed malware, via emails themed with purchase orders in archived files. LokiBot Other observed overlaps include RoboSki-packed LokiBot C2 domains: alphastand[.]trade alphashtand[.]top alphastand[.]win kbfvzoboss[.]bid These were previously observed in a campaign using Microsoft Publisher files to deliver the Pony malware . The domains were also reported as a separate phishing campaign in 2019 using ‘SWIFT monetary transfer’ themed lures to deliver LokiBot, in addition to Neshta and Fuerboos. All four C2 domains were used again in October 2020, as part of a different Lokibot spam campaign . Of note, these C2 domains were present in 95 of the RoboSki-packed LokiBot samples, accounting for 41 unique LokiBot payloads. Gamarue Botnet In addition, the C2 domains azmtool[.]us, becharnise[.]ir, newcesarnex[.]com and klimsourcinq[.]com were reported in February as being related to the Gamarue Botnet. In these instances, each of the domains was present in varying RoboSki-packed LokiBot samples. File Path Observations Some file paths have noticeable misspellings, such as %AppData%\\microsift.exe, which was observed in a RoboSki-packed AsyncRAT sample. We found that additional file paths, such as %Temp%\\windefendllinici.exe in RoboSki-packed AsyncRAT samples, may be associated with files compiled in February 2021 that matched YARA signatures for Nanocore, and password stealers, several of which communicate with the RoboSki-packed AsyncRAT C2 domain laboratoriogenfarp.linkpc[.]net. It is possible the appearance of the same file path in a limited sample set may suggest that the same malicious actor has been involved in several campaigns delivering various malware . File path %AppData%\\notes\\logs.dat, seen in a RoboSki-packed Remcos sample, was also observed within other files that matched YARA rules for Remcos RAT and Agent Tesla. The presence of %AppData%\\seguridad\\logs.dat in a RoboSki-packed Remcos sample may suggest that a Spanish-speaking company may have had their security logs accessed. In addition, this file path was found within a file possibly related to Razy malware. License Re-Use While analyzing some of the final payloads, some interesting and specific attributes regarding Remcos RAT were observed. Analysts found that the Remcos configuration contains a license code field (‘license_code’), which is unique to each purchaser. In some cases where the RoboSki packer led to the delivery of Remcos, it was observed that two specific license codes were re-used. The license codes observed within the configuration of multiple payloads for packaging were: License code A830299B3222E31F1F2765E3AC4D37FD was observed four times and associated with C2 addresses 184.140.53.148:1011 and 79.134.225.14:1011. License code 8896DBA4C4FC821D8BAAC764BC9822E3 appeared in eight instances, associated with C2 addresses 91.241.19.107:1313 and 176.111.174.14:2804. In addition, the configuration of Remcos RAT contains the field ‘server_password,’ with both of these license codes using the password ‘Yes’— although it is possibly defined as the default password. New RoboSki Version — The Technical Details As identified by X-Force, the RoboSki packer file typically arrives within a malicious email archive attachment. CT further analyzed the packer and its embedded components to understand the execution flow leading to a commodity RAT payload and how that execution flow differed from previous RoboSki packers. Figure 4: Mapping of RoboSki packer to final payload RoboSki.Packer CT analysts found that the RoboSki packer contains numerous .NET Microsoft resources, including the two resources of interest, SzGeneric and EventWaitHandleRights (highlighted in Figure 5), which are stored as PNG images. Figure 5: Key resources The resource SzGeneric contains the RoboSki component, which is used to decrypt the contents of the resource EventWaitHandleRights, resulting in a ReZer0 loader. To get to the ReZer0 loader, the RoboSki packer first loads the SzGeneric resource and converts the pixel data to RGB order, as denoted in the image below, resulting in the RoboSki component. Figure 6: Conversion to RGB order This differs from previous RoboSki packer versions, wherein the component was stored as string data and decoded using string replacement and the Base32 algorithm or string replacement, string reversal and the Base64 algorithm. The converted data is then executed and invoked in a series of module calls, depicted in the image below, in which the component is executed from its O5.Ga namespace/class and passed parameters from the class named ChannelSinkStack. Figure 7: Converted data executed and invoked The parameters stored within ChannelSinkStack are the hex-encoded values for the resource named EventWaitHandleRights and a base XOR key ‘xNksm.’ Figure 8: ChannelSinkStack parameters RoboSki.Component As described above, during execution the RoboSki component is provided as a resource and XOR key parameters, and proceeds to decode and decrypt the ReZer0 loader from the RoboSki packer. The component loads the resource and arranges the pixels in BGRA order. The component then parses the resource according to the structure below, and XOR decrypts the data using the results of permutations against the base XOR key and a control key. Figure 9: Python construct library structure Figure 10: Structure parsing and XOR decryption The resultant ReZer0 loader is then executed in memory and subsequently decrypts and executes an embedded payload, which, in this case, is an instance of the Agent Tesla RAT. The ReZer0 loader operates in the same manner as described by 360 Total Security and Fortinet . As mentioned in those blog posts, the ReZer0 loader exhibits anti-analysis features such as detection of virtual machines or sandboxes and can bypass anti-virus software. Due to these anti-analysis features, the results from dynamic analysis, including sandboxes, may be incomplete or wildly inaccurate. By using automated component and configuration extraction (ACCE) to statically extract the configuration data, the researchers bypassed all dynamic anti-analysis features that would otherwise prevent accurate and reliable analysis. How Is ACCE Support Built? ACCE is built on top of CT’s proprietary libraries, as well as the Department of Defense Cyber Crime Center’s (DC3) malware configuration parser and kordesii frameworks. This promotes an automation workflow where initial YARA signature detections prompt running targeted modules organized by capability to extract layers of components (RoboSki packer-> ReZer0 loader -> Agent Tesla payload) and report configuration at each layer. By adopting the ACCE workflow, reverse engineers can develop modules based upon analysis of a few samples, and then leverage that module to extract results from thousands of other related malware variants. The primary difference between the newly analyzed RoboSki packer and previous RoboSki packers is the way the ReZer0 loader is encrypted. Previously, written code for parsing the PNG pixels of the image resource was used in conjunction with new code for obtaining and using the resource name and initial XOR key using construct, regex patterns and an internal library. Figure 11: Construct Figure 12: Construct PAYLOAD_SPEC The referenced resource is acquired, PNG pixels are parsed and the resulting data is parsed using the construct PAYLOAD_SPEC. Subsequently, the ReZer0 loader is decrypted and dispatched for further processing. The configuration output for the RoboSki packer (MD5: 9b792353406c1c8bf440fa5417aee5b2), which contained the LokiBot sample with C2 domains previously observed in other campaigns. Figure 13: Configuration output Threat Hunting Using ACCE Output After adding a parser module to automatically extract the RoboSki component and ReZer0 loader from the new RoboSki packer variant, the researchers used VirusTotal to find additional samples using the new RoboSki packer variant. As a result, 55 samples were selected to test against the new parser module. Two variations in the initial RoboSki packer were observed: In addition to being hex-encoded, the .NET Microsoft resource name and base XOR key are Base64 encoded. A .NET obfuscator is leveraged to encrypt all strings in the RoboSki packer, inhibiting the ability to easily extract the resource name and base XOR key. All 55 RoboSki packer samples contained the same RoboSki decryption component. After updating the parser module(s) to support the variations observed in the RoboSki packer, approximately 1,300 additional RoboSki packer samples were obtained via VirusTotal and subsequently run against the capability. The resultant payload distribution is as denoted in the following chart: Figure 14: Payload distribution The most common payload observed was Agent Tesla, accounting for over half of the obtained payloads. Notably, all the payloads fell into a category of commodity malware such as information stealers or commercial RATs. An Ever-Evolving Commodity Malware Scene Malware distribution is a continually evolving practice undertaken by potential botnet herders and spam distributors alike, constantly on the quest to bypass organizational security controls to deliver malware. As part of that ecosystem, commodity packers, such as RoboSki, are used extensively to spread numerous types of malicious code. Keeping up to date about new variations, IOCs and overall delivery TTPs are essential to keeping networks free of malware that could eventually result in more advanced compromises. To avoid the associated risks that come with a reliance on digital exchange for operations, the use of automation to rapidly generate indicators can help equip net defenders with the necessary insight to identify and prevent compromise. X-Force and CT analysts assess with high confidence that the use of ordering- and logistics-themed phishing emails will persist, especially as global trade continues to recover. Organizations especially engaged in the import and export of items worldwide should exercise extreme caution and harden their network environments. For up-to-date information about malware campaigns, IOCs and malware reports, join us on X-Force Exchange ."}}
{"https://securityintelligence.com/posts/revil-ransomware-kaseya-supply-chain-attack/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-07", "source": "securityintelligence.com"}, "text": "On July 2, 2021, Kaseya customers were notified of a compromise affecting the company’s VSA product in a way that poisoned the product’s update mechanism with malicious code. VSA is a remote monitoring and management tool for networks and endpoints intended for use by enterprise customers and managed service providers (MSPs). According to Kaseya, it urged customers to shut down the VSA to prevent attackers from gaining remote access to further assets. Kaseya also shut down the cloud version of VSA and all SaaS servers as a precautionary measure. Although it was initially believed that only 50 companies using VSA on-premises were targeted, the evolving situation reveals more potential victims as numbers climb to the tune of 1,500-2,000 companies likely exposed to downstream impact by this major attack. The number of potential victims can be so much larger because Kaseya’s customers themselves are MSPs who serve a customer base of their own. Consequently, those who rely on VSA to deliver remote-monitoring services can also be impacted by the attack. It has not been long since the world had to reckon with major supply chain attacks that call to mind the devastating SolarWinds’ Orion breach and the Accelion attacks in which one poisoned software update infected a fleet of customers. Right ahead of the United States’ Independence Day holiday weekend, REvil ransomware gang affiliates managed to launch what appears to be a premeditated attack that took a page out of the same playbook, wreaking havoc across the globe. This time, the software update was Kaseya’s VSA remote management tool, which was poisoned with malicious code that launched a chain of events ending with an infection by the group’s ransomware. Some portion of REvil actors are believed to be based in Russia and other parts of Eastern Europe. The gang opened with a $70M ransom demand and later lowered it to $50M for the release of a decryptor that would apply to all the affected victims. How Did Attackers Get in? Threat actors affiliated with REvil ransomware were able to leverage a zero-day file upload and code injection vulnerability in Kaseya VSA’s on-prem solution. What’s been reported as CVE-2021-30116 was the security vulnerability the attackers exploited for their initial foothold. This flaw allowed for an authentication bypass and for executing arbitrary commands, which later helped attackers download and distribute a malicious loader masquerading as a VSA update to victim systems with VSA agents installed. It is suspected that more than one security flaw enabled the attack to reach its objectives. IBM X-Force’s Threat Intelligence Index shows that the most common entry point to organizations has been exploitation tactics, surpassing phishing and the use of stolen credentials. In cases where a VSA server is exposed to internet, any known vulnerability could be weaponized and leveraged by attackers to potentially breach it from a remote location. The compromised VSA agents then launched a PowerShell command that disabled anti-malware protections, then installed and executed the REvil ransomware payload. The ransomware encrypted data across devices it infected, rendering it impossible to access . The supply chain attack currently unfolding was most probably planned well ahead of the time it was actively launched over the long holiday weekend. Many major attacks, especially those that rely on ransomware or destructive malware, are carefully planned ahead of time and unleashed when security teams are not working in full capacity. Who Has Been Impacted? Researchers say that the number of victims is rising over time. At the time of this writing, at least 1,000 organizations have seen some impact by the attack and its consequences to their business continuity. One of the victims notably impacted by this attack has been a Swedish supermarket chain, “Coop”. With over 800 physical grocery stores, many of which were shut down after the attack, it is not yet clear when recovery could allow for Coop to fully resume operations. Organizations in several industries have reported issues, with victims identified in government, professional services, retail, and wholesale, to name a few. Companies are hailing from across the globe, including the U.K., South Africa, Canada, Argentina, Mexico, Indonesia, New Zealand, and Kenya. Since the situation continues to evolve, these details may change over time. What Are the Criminals Demanding? REvil initially published a ransom demand on their “Happy Blog” accessible through a TOR browser asking for $70M in Bitcoin to release a decryptor that would help all related victims unlock files encrypted in the attack. Figure 1: REvil’s post to their “Happy Blog” Dark Web page Unlike the case in singular attacks, REvil members do not appear to have exfiltrated data from their victims prior to the data encryption phase. A plausible reason could be rushing to set up the attack and worrying that data exfiltration would take very long and be an operation that could expose the gang prematurely. Also, the amounts of data to collect post exploitation could be overwhelming. Since data was not exfiltrated, REvil has less leverage to pressure victims to pay if they are able to recover from backups using incident response and disaster recovery plans. The REvil gang lowered the ransom demand, going from $70M to $50M in hopes of getting paid sooner. They allegedly also allow victims to use Monero instead of Bitcoin to pay the ransom and are willing to negotiate the price for a more specific decryptor that will unlock certain file extensions. Some victims resorted to attempting a private negotiation with REvil, where ransom demands varied and were, in some cases, as low as $50,000. What is Being Done to Respond to This Attack? On July 5, Kaseya released a patch to address the vulnerability exploited in this incident: www.kaseya.com/potential-attack-on-kaseya-vsa . Further guidance and advisories may be updated by Kaseya. A compromise detection tool was also made available and rolled out to Kaseya customers. CISA and the Federal Bureau of Investigation (FBI) continue to respond to the attack. CISA warns businesses to enable and enforce multi-factor authentication for all accounts – not just privileged accounts. CISA and FBI strongly urge affected MSPs and their customers to follow guidance published by CISA . Guidance from the FBI was also made available on their website . Deputy National Security Advisor for Cyber and Emerging Technology, Anne Neuberger, released a statement about the attack, urging anyone who believes their systems have been compromised in the Kaseya ransomware incident to immediately report to the Internet Crime Complaint Center at www.IC3.gov . What is REvil, Sodinokibi? REvil, also known as Sodin or Sodinokibi , is a ransomware-as-a-service (RaaS) malware family active since early 2019. Third party reporting suggests REvil was developed by GandCrab authors, another RaaS malware family that claimed to retire in May 2019. REvil has code built into the malware that prevents it from being installed on Russian language machines, which may suggest the developers reside within a Russian-speaking country and/or operate with impunity in one of these countries. Since its debut two years ago, REvil/Sodinokibi has gained considerable momentum, locking up and even auctioning off data that belonged to companies like Travelex, Gunnebo, Brown-Forman, and the pan-Asian retail giant “The Dairy Farm Group”, to name a few. The demand in each case is often exorbitant, asking victims for multi-million-dollar ransoms for their data: Leading cosmetics group Pierre Fabre: $25,000,000 The Dairy Farm Group: $30,000,000 New York-based law firm Grubman Shire Meiselas & Sacks: $42,000,000 Apple MacBook supplier: $50,000,000 With pressure tactics going beyond data encryption, Sodinokibi operators often steal data in advance, exfiltrate it, and then resort to extortion tactics. Those who refuse to pay up, hoping to rely on their ability to recover data will receive threats to have sensitive, confidential data exposed publicly on the group’s Dark Web site dubbed “The Happy Blog”. That’s also where it names and shames its victims, offering their data up for sale to the highest bidder. The ‘double extortion’ strategy has become a common practice among organized cybercrime groups that deploy ransomware targeting organizational networks. IOCs Analysis provided by Kaseya also provides relevant IOCs. Those can be accessed here . Remaining Vigilant X-Force is advising organizations to be on alert of the growing risk of ransomware attacks and to be prepared with incident response plans and a team that can escalate issues. It is also recommended to be mindful of having offline backups, segmenting networks to limit the reach of attackers, encrypting data , and applying critical patches in a timely manner to reduce the overall risk of attacks. Companies can benefit from testing their detection capabilities with adversary simulation and red teaming, as well as rehearse and test incident response plans to identify gaps, so they can limit the spread of an attack if and when one happens. For ongoing updates on this situation visit the X-Force Exchange Collection . Visit these resources with additional questions or to schedule a one-on-one consultation with an IBM subject matter expert or download the IBM Ransomware response guide . If your organization requires immediate assistance with incident response, please contact IBM Security X-Force’s US hotline 1-888-241-9812 | Global hotline (+001) 312-212-8034."}}
{"https://securityintelligence.com/posts/attacks-operational-technology-ibm-dragos-data/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-07", "source": "securityintelligence.com"}, "text": "Operational Technology Threats in 2021: Ransomware, Remote Access Trojans and Targeted Threat Groups Organizations with operational technology (OT) networks face many unique — and often complicated — considerations when it comes to cybersecurity threats. One of the main challenges facing the community is the convergence of an increasingly OT-aware and capable threat landscape with the digital transformation of the industrial community. This comes at a time when organizations have historically prioritized preventive-based controls (segmentation, patching, authentication, anti-malware, etc.) well beyond the ability to get visibility into their OT networks as well as the ability to detect and respond to issues. This creates significant risk and is made more complicated when many industries also face aging infrastructure and consequences that can manifest in the physical world with impacts on safety and environmental damage. To delve deep on the threat landscape for organizations connected to OT and industrial control system (ICS) environments, IBM Security X-Force threat intelligence analysts worked jointly with Dragos , a firm that specializes in OT and ICS cybersecurity, to investigate some of the major intrusion trends that may impact OT and ICS environments. The research shows that ransomware and remote access Trojans are the most common attack types against enterprise networks connected to OT networks. Ransomware specifically has direct impacts as it moves from enterprise networks into OT networks and causes costly operational outages. The remote access Trojans highlighted in this analysis are those utilized by OT-specific threat groups as they leverage this capability to gain access to enterprise networks and then move from Stage 1 to Stage 2 operations as defined by the ICS Cyber Kill Chain . While the data does highlight the most common attack types and vectors, it is important to note that the most frequent events are not always the most consequential. As an example, OT-specific threat groups, while active much more than people realize, are not nearly as active as the broader enterprise IT threats. However, OT threat groups cause significant impact that ranges from the theft of intellectual property to the direct targeting of human life (e.g. the TRITON/TRISIS attack in Saudi Arabia in 2017). The data further reveals that adversaries most frequently use stolen credentials to gain initial access to enterprise networks with connected ICS environments. Many defenders may think that by protecting their enterprise networks they are protecting their ICS networks, but it is important to note that many original equipment manufacturers, integrators and vendors have their enterprise and production networks directly connected to others’ OT networks. That is to say that, while adversaries often begin their operations in the enterprise, it is not always your enterprise that leads to compromises in your ICS. Looking ahead, ransomware threats will continue to impact both IT and OT networks directly while threat groups become more adept and intent on targeting OT networks directly. From ICS Kill Chain Stage 1 to Stage 2: Implications for ICS and OT The majority of the data, by the very nature of these operations, examined in this analysis primarily involves Stage 1 operations that initially affect enterprise and non-OT environments. Several examples demonstrate the ease with which adversaries can expand from ICS Kill Chain Stage 1 to Stage 2 operations — with the latter having direct impact on and implications for ICS and OT networks. For example, the EKANS malware is a ransomware variant that includes the ability to stop ICS-related Windows processes. Although this is a primitive technique, it indicates criminal enterprises are expanding ransomware targets to include industrial environments. Ransomware developers increase the odds of victims paying ransoms by crippling as much of the business operation as possible, demonstrating a jump from ICS Kill Chain Stage 1 to Stage 2 operations. Threat groups that Dragos tracks such as KAMACITE and ELECTRUM — with links to Hive0103 or Sandworm, a group multiple organizations have attributed to Russian government actors — work as an access-effects team and show how a Stage 1 intrusion can quickly become a Stage 2 intrusion. KAMACITE deploys malware with ICS-specific capabilities. This includes various modules linked to BLACKENERGY2 malware, infecting asset owners in Europe and North America. After compromising the IT environment, KAMACITE hands off ICS network access to other activity groups, like ELECTRUM, which was suspected in the 2016 Ukraine power event . Another example of an access-effects team, which Dragos also tracks, is PARISITE , which enables operations for MAGNALLIUM — a group with links to Hive0016 or APT33 and has been attributed to Iranian state actors. PARISITE’s initial access activity is associated with a focus on ICS-related entities and serves as an initial access vector for future disruptive operations associated with MAGNALLIUM. PARISITE represents the first actions against ICS asset owners and operators to breach victim IT networks and establish persistence. PARISITE and MAGNALLIUM incorporate vulnerabilities into exploited items and weaponize disclosed vulnerabilities in critical products, showing the capability to move from Stage 1 to Stage 2. This access can be utilized to gather additional information for further penetration of the environment and possible ICS attacks. Ransomware and Remote Access Trojans: The Top Attack Types Further analysis of X-Force incident response data reveals that ransomware was the top attack type against organizations with connected OT networks in 2020 and 2021. Ransomware attacks made up nearly one-third of all attacks on OT-connected organizations last year, underscoring the interest ransomware adversaries are taking in industrial victims. Joint research by IBM X-Force and Dragos revealed that of all the ransomware attacks impacting industrial organizations, such as those found in the electric, oil and gas, manufacturing, rail and mining industries, between 2018 and 2020, 56% had an impact on operations. Even for ransomware strains that are not specifically designed to affect ICS systems, these intrusions end up impacting operations across the organization, often by necessitating a shutdown of the operational environment. Figure 1: Attack types against organizations connected to OT networks, January 2020 – June 2021 (Source: X-Force Incident Response Data) After ransomware, which made up 30% of attacks, remote access trojans (RATs) were the second-most common attack vector against organizations with connected OT networks in 2020 and 2021, making up 16% of intrusions on these organizations. Malware like Adwind, jRAT, Trickbot and Emotet were some of the most common malware types associated with these RAT operations. A group Dragos tracks as STIBNITE uses spearphishing to drop PoetRAT to gather information, take screenshots, transfer files and execute commands on victim systems for the purpose of identifying access points into ICS networks. Another group, TALONITE, uses spearphishing, masquerading as legitimate engineering and energy entities, to entice victims to download executables containing RATs. This enables the group to establish persistence and move laterally within a network, attempting to achieve access into ICS while also stealing information related to operations that may be stored in enterprise networks. Vulnerability Exploitation and Stolen Credentials Provide a Way In In terms of initial infection vectors, X-Force incident response data indicates that vulnerability exploitation and stolen credentials are the most common entry points for adversaries, leading to 40 and 32% of incidents remediated, respectively. Figure 2: Initial infection vectors used in attacks on organizations connected to OT Networks, January 2020-June 2021 (Source: X-Force) Credential theft as an initial infection vector across all industries decreased in 2020, encompassing only 18% of X-Force attacks. This may be due to organizations doing a better job of implementing multifactor authentication (MFA) and making it more difficult for adversaries to make use of stolen credentials. A high percentage of attacks caused by credential theft at industrial companies suggests that a more robust implementation of MFA has the potential to hinder some incidents in the future. However, in Dragos’s incident response cases 100% of incident response cases in OT still leveraged credential theft and lateral movement. A common issue was shared systems such as Active Directory connecting IT and OT networks directly, allowing adversaries to easily pivot into industrial networks. Adversaries frequently used a combination of scanning for vulnerabilities and then exploiting those vulnerabilities, especially on internet-facing devices such as firewalls and VPN infrastructure. The combination of vulnerability exploitation as an infection vector for enterprises with a connected OT environment is concerning in light of the increasing number of OT and ICS-related vulnerabilities identified each year. In 2020, researchers identified 468 new vulnerabilities related to ICS, a 49% increase year-over-year from 2019, and a significant jump compared to increases in previous years. Figure 3: New ICS-related vulnerabilities identified per year, 2011-2020 (Source: X-Force Red) Remote Desktop Protocol (RDP) targeting came in third place at 12% of intrusions. Across all sectors, RDP makes up a much smaller percentage of overall infection vectors (7% overall in 2020), suggesting that adversaries capitalize on RDP more when targeting OT-connected organizations. Phishing accounted for the initial infection vector in only 8% of intrusions remediated by X-Force in 2020 and 2021. Across all sectors, phishing typically makes up one-third of infection vectors, suggesting that phishing is not an infection vector of choice for actors targeting industrial companies. Even so, the group Dragos tracks as KAMACITE breached multiple industrial networks by utilizing spearphishing with malicious attachments and external access via legitimate services to gain access to victim organizations. Looking Ahead: What Does This Data Mean for 2021? X-Force threat intelligence anticipates that ransomware will continue to be a top attack type for industrial organizations into 2021. Ransomware groups continue to attempt to exploit the sensitive nature of OT networks and increasingly blend data theft and leaks with traditional ransomware.  The battle with ransomware is likely to continue into the foreseeable future. To better prepare for potential attacks, encrypting company data so it is less valuable to adversaries and safely storing backups are two protective measures organizations can take to insulate networks from double ransomware attacks that are becoming increasingly common. It is also necessary to validate and potentially re-architect systems that bridge IT and OT networks and potentially re-architect the OT network itself. Over the years many changes have occurred that are not tracked in OT networks, leading to system and network weaknesses and attack paths that significantly increase the impact of these attacks. A key effort should be to get visibility in the OT networks, looking for weak segmentation, remote connections and interconnections with vendors and integrators. Network segmentation should also be monitored to ensure it is not bypassed. Further, do not over-rely on preventive measures alone. Once the organization has a defensible architecture in place it is important to actively defend that architecture with appropriately skilled personnel who understand OT and can detect key threat behaviors such as the tactics, techniques and procedures of OT threat groups and ransomware operators. With the number of reported vulnerabilities rising quickly, X-Force also sees vulnerability exploitation as an initial infection vector that is likely to continue over time for industrial companies with a connected OT environment. Border devices on the OT networks that bridge them to IT networks including firewalls, VPNs and data historians are at high risk. Vulnerability management programs can assist organizations in identifying which vulnerabilities deserve the most attention and should be prioritized in a patch management program. For example, adversaries frequently exploited CVE-2019-19781 — a Citrix server path traversal flaw — in 2020, providing adversaries access to critical servers and sensitive data. Adversaries all but ignored many other vulnerabilities, as exploitation is too complicated or would not provide the access necessary to fulfill objectives. X-Force data from 2020 also indicates that organizations’ widespread and successful implementation of MFA may be positively impacting the threat landscape — forcing adversaries to abandon credential theft and brute force attacks as initial infection vectors. These trends suggest that aggressive implementation of MFA has the potential to alter the threat landscape over time, shoring up RDP access points as a common initial infection vector, and decreasing the use of credential theft to gain access to OT organizations’ networks. Dragos tracks multiple ICS-targeting threat groups that target remote access technologies like RDP, including PARISITE, MAGNALLIUM, ALLANITE (associated with ITG15 or Dragonfly) and XENOTIME (the activity behind TRISIS). Identifying and prioritizing crown jewels , or the assets that exercise control over the safety of an industrial process, can prevent adversaries from gaining RDP access and modifying existing configurations to assets that could cause major impact to an organization. To learn more about our findings, check out the 2021 IBM Security X-Force Threat Intelligence Index and Dragos 2020 ICS Cybersecurity Year in Review ."}}
{"https://securityintelligence.com/articles/june-2021-security-intelligence-roundup-cybersecurity-phishing/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-30", "source": "securityintelligence.com"}, "text": "Cybersecurity careers are a buzzy topic lately, with more people needed and salaries competitive. How do you make yourself stand out in this field and find a career you both love and do well? Meanwhile, when you’re not working you may very well be making a new streaming account to escape after a long day. The pandemic has changed our streaming habits — and we need to be sure that doesn’t increase our risk at home. This month’s insights also include what an expert thinks are the most pressing worries in the field today, a primer on zero trust and more. Check out our top advice and news from June. Quick Briefs: Top Insights From June 3-Minute Read 🕒 Zero Trust or Bust: What It Is and Why It Matters to Data Security Zero trust wraps around other digital defense efforts like a moat, protecting your valuable data inside. This piece is a top-level look at what zero trust is for and what use cases might call for it. For example, if you’re using a lot of remote employees or a lot of different access rights, zero trust can make your defenses simpler. After all, it assumes everyone is a potential threat. 3-Minute Read 🕒 What’s Behind Rising Ransomware Costs? It’s a vicious cycle: more and more companies are willing to pay million dollar ransoms to high-end threat actors. Then, these attackers see more potential for ill-gotten gains. The rising costs of ransomware come from this cycle. See why it’s often best not to pay a ransom if you’re targeted. Instead, we lay out the best ways to make sure ransomware attackers can’t get inside your systems far enough to launch an attack in the first place. 4-Minute Read 🕒 Cybersecurity Certifications: Take Your Career to the Next Level Cybersecurity certifications can often boost a career faster than a degree, showing you know how to use your skills in the real world. Is a certification the right next step for your career? Our guide gives you a framework for exploring what you want out of your work in this field. In addition, take a look at which certifications are the most highly-respected and which organizations offer legitimate and practical certification programs. Worth Your While: In-Depth Coverage To Sharpen Your Skills & Tighten Security 4-Minute Read 🕒 Why a Phishing Attack Is Still Profitable — And How To Stop One Attackers are dangling a lot of hooks and bait in the water. Phishing, a staple of internet scams since nearly the dawn of the internet itself, is still a popular and profitable angle for threat actors. In particular, they’re using spear-phishing to target executives. Learn how to educate employees on the signs of a phishing attack. In addition, see how protections like two-factor authentication can reduce the risk. 5-Minute Read 🕒 Surge of New Digital Accounts During the Pandemic Leads to Lingering Security Side Effects I don’t know about you, but I started watching some TV shows outside my usual fare during the pandemic. All that “Star Trek” was already on a service I subscribe to, so I didn’t need to create a new username and password. But a lot of people during the pandemic did, making the summer after a very long winter a good time to revisit your passwords. Do you use the same one on multiple services? And, how does this apply to the way employees log in to your organization? 4-Minute Read 🕒 The Hottest Cybersecurity Must-Reads for the Busy Security Practitioner IBM prepared a variety of assessments and resources for cybersecurity practitioners looking to make structural changes. See step-by-step guides to finding out where you are on your cloud journey (and how to secure the cloud). Gain insights into what threat actors are thinking. And learn how to pass that information on to other members of your organization with authority. June’s Expert Insight: 3 Things That Keep a Top Data Security Expert Up at Night Tony DeMichele runs database engineering and database audit and compliance for a Fortune 50 company, so he has to have a finger on the pulse of cybersecurity. What does he prioritize? What is he really worried about? He talked to us about data breaches, human error and moving data to the cloud. Take a look at his practical advice for dealing with today’s most pressing cybersecurity worries. Want to keep up with today’s cybersecurity news and best practices? Watch this space for the Security Intelligence newsletter."}}
{"https://securityintelligence.com/posts/shellbot-publicly-available-cryptocurrency-miner/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-29", "source": "securityintelligence.com"}, "text": "IBM Security X-Force researchers studied the botnet activity of a malware variant that is used by cyber crime groups to illegally mine cryptocurrency. Examining two ShellBot botnets that appeared in attacks honeypots caught, the X-Force team was able to infect its own devices and become part of the live botnets, thereby gaining insight into how these botnets were managed internally. This post provides the details on IBM’s research and sheds light on the growing threat of cryptomining botnets to enterprise networks. While seeing computational resources abused by cryptojacking operations is enough of a problem, the riskier consequence of the infection is that malware begets malware. A seemingly simplistic infection is still a foothold that can result in more sophisticated malware on the network down the line, which may end up exfiltrating data and even installing ransomware to extort the organization later on. Cryptojacking Is the Name of ShellBot’s Game With the exponential rise in the value of cryptocurrency, cybercrime endeavors based on these digital coins have been rising as well. Aside from the devastating rise of ransomware attacks, the illegal mining of cryptocurrency on devices one does not own, aka cryptojacking, has become a commercial grade threat used in the hands of lone criminals and organized groups alike. In some cases, cryptojacking operations that keep mining farms processing coins reached the magnitude of a $50 million business for their bot masters. The ShellBot malware lives within this ecosystem. While it is a rather simple piece of Perl-based code, it enables attackers to mount internet relay chat (IRC)-controlled botnets that command coin mining on computers, Linux servers, Android devices and Internet of Things devices. The one requirement is having a weak password, as ShellBot’s typical entry point is a brute-force attack; the other is a command injection on servers that accept remote commands from the command-line interface (CLI). While it started out as a basic IRC bot, over time ShellBot has been using effective exploits to compromise servers and devices. It started out with a ShellShock (CVE-2014-6271) campaign, which is how it got its name, but over the years has used Drupalgeddon (CVE-2018-7600) and other exploits that can compromise large swaths of devices. ShellBot has also been evolving its features to better spread through networks and disable competing infections to ensure all the computing power is used for its own goals. ShellBot’s objective, in most cases, is mining for Monero coin. Brute-Forcing a Way In ShellBot infections typically use brute-force attacks to guess the passwords of targeted servers and devices. In the botnets IBM X-Force examined, the most frequently used credential types helped identify the targets as misconfigured databases, FTP-servers, monitoring servers and other Linux machines. By far the most frequent username for which the password was brute-forced was ‘root,’ followed by standard or default username strings such as ‘ubuntu’, ‘admin’, ‘user’ and ‘test’. There were also some standard database-type credentials such as ‘oracle’, ‘postgres’ or ‘mysql’. Figure 1: The top username types used in ShellBot attacks (Source: IBM X-Force) Botnet logs also showed the top passwords the malware managed to guess. Unfortunately for the targeted device owners, it was rather easy to figure out simple and default passwords. Figure 2: The top weak passwords used in ShellBot attacks (Source: IBM X-Force) ShellBot campaigns logged in IBM’s spam traps focused on verified ShellBot instances and ShellBot tactics, techniques and procedures (TTPs) that also launch a Perl-based payload. IBM X-Force saw quite a bit of activity every month, as shown in the figure below. Figure 3: ShellBot activity by month, January to June 2021 (Source: IBM X-Force) Infect and Control ShellBot is dropped as a payload to systems and devices where a password was brute-forced. Immediately after a successful login, the infected machine/device receives a list of commands to execute; those include sending back system information, downloading and executing a PERL script, removing logs, removing the command history and deleting the payload itself. Each ShellBot variant connected with a different botnet over an IRC channel. To get into the botnet, IBM infected some devices and followed the activity. The ‘Blackcat’ Server At the time of joining a server that was named Blackcat, the channel consisted of close to a hundred active bots and was about four months old. The channel itself was only used by the operator to address single or multiple machines, to which they would respond in a private chat. Reconnaissance commands were regularly issued to the bots, with the goal of collecting information that would allow the botnet’s operators to zero in on valuable assets. The information the attackers looked for was root access, CPU and GPU information and system architecture (ARMV, etc.) Most notably, the Blackcat botnet operators were eager to find machines with NVIDIA GPUs , which is a graphic processing unit with higher compute power that translates into faster mining. Once the server’s operators get the information on the system’s CPU/GPU, they group the bots in different channels accordingly. Figure 4: Operators probing for GPU info and sorting bots into #nvidia channel After sorting machines based on their mining capabilities, the operators would go on to download and execute a new ShellBot Perl script on those machines. The ‘pola’ version contained new IRC parameters, forcing the bots to join a different IRC server, which appeared like the operators were migrating active bots to a different network. Figure 5: Operators deploying secondary malware with different IRC parameters to move bots to Pola server Graduating to the Pola Server The operation X-Force tracked was probably rather fresh. When the researchers followed the migrated bots to the Pola server, they noticed that it was created that very same day. It already contained 143 bots, which were most likely migrated from other channels. Within the next day, the number of bots doubled, suggesting that there must have been additional servers like Blackcat moving higher value bots to the Pola server. Once on the Pola server, the filtering for higher value bots continued and a third payload — miner3.tgz — was deployed to the selected bots in a series of commands launched by the botnet’s operators. The process begins with the removal of previous versions of the ShellBot malware and those of other cryptominers that might be resident on the machine/device. Once the machine is clean of potential rivals, the operators go on to install their own miner. An archive is then unpacked into a .cache directory, in which the script .x is executed. This launches XMRig as well as XHide (process hider) on the infected machine. Figure 6: Cryptominer download #Armv – the DDoS Channel Botnets of all types, and especially those that command infected devices, are often used for distributed denial-of-service (DDoS) attacks. With a simple command, operators order the bots to browse to the target website and attempt to flood it with traffic and cause a denial of service. The botnets had a channel for bots that took part in DDoS attacks. The floods lasted 500 seconds each and did not appear very powerful. It is possible that the channel had a few low-value devices on it or was used as a testing ground. OpSec by Segmentation From the way bots are filtered, moved to other botnets and run new malware versions, it can be inferred that there is some sort of tiered segmentation. Conversations found on the server are proof that trading bots among operators are rather common, which explains how botnets can double in size quickly. The benefit of tiered segmentation is that it makes it very hard to find IRC server information on Tier 2 servers and higher, since these are only deployed by Tier 1 operators. The only way to join a Tier 3 botnet would be to be moved up the chain and follow the newly deployed Perl scripts. Along the way, it becomes much easier for the different botnet operators to filter out research bots, increasing the security of the operation. Attribution ShellBot is publicly available code, so it is harder to attribute it to any one group. Often, botnets using widespread code can be used by anyone, but they can see more meaningful activity from specific actors and groups. Links to Romanian-Speaking Operators What IBM found throughout its research, especially during the infiltration of IRC servers, are clues to an operation being managed by Romanian-speaking bot masters. For one, X-Force found Perl scripts stating flood.ro as the author, and some instances of ShellBot were hosted on a Romanian news site. The Perl scripts further linked to Romanian-speakers’ IRC channels on multiple servers. One of the operators used the Romanian hostname blackcat.ro on IRC. All threat actors conversing in the channels were fluent in Romanian. These links to Romania line up with threat intelligence on ShellBot by other security researchers in the past few years. Links to the Outlaw Gang The Romanian threat group tracked as Outlaw, which was identified in 2018, has been observed to use ShellBot to target different organizations. After comparing data from IBM’s own research with TTPs from previously reported Outlaw attacks, X-Force found similarities in the threat actors’ TTPs to those in the Blackcat and Pola servers. A screenshot of the Perl script had previously appeared in an article by TrendMicro and is identical to one of the samples used for the infections in the cases IBM saw. Another identical script is the Pola script applied to bots that graduated the Blackcat server. A malware analysis conducted by Yoroi on a 2020 Outlaw campaign mentions the same bash scripts, run and upd, which X-Force found in the cryptominers distributed on the Pola server. Lastly, TrendMicro published an article on Outlaw campaigns, which discovered the use of an old process hider, XHide, to mask the mining process XMrig. The hash of the XHide binaries, h32 and h64, contained in the cryptominer matched up to the ones used in one of the Outlaw campaigns. Is this evidence that the servers IBM infiltrated were associated with the Outlaw group itself? It’s possible, and it’s also plausible that other threat actors in this space copied the TTPs or bought the scripts from someone else. Mitigating the Risk of Cryptojacking Malware Cryptojacking malware can be an insidious and long-term attack that’s often hard to detect but can be damaging in a number of ways: impaired server performance, accumulation of electricity costs and overheating devices, to name a few. What puts companies at greater risk is the residence of malware on networked assets and devices, which can allow attackers to strengthen their foothold down the line. That risk can become any other type of attack given the time and the motivation of the attackers. In order to minimize the risk of a ShellBot infection, it is vital to properly configure all public-facing devices with strong credentials and ensure that logging is in place. For servers that can be accessed remotely, it is wise to add multifactor authentication and disable the option to run CLI commands remotely if that is a requirement the business needs. In addition, all outbound IRC traffic should be monitored or entirely blocked, as this may be an indicator of a ShellBot infection and potential data exfiltration that is not related to business needs. Network system monitoring should be implemented to detect excessive resource utilization and users should be educated about the risk and signs of cryptojacking on their devices. Indicators of Compromise IRC servers: Blackcat: 128.199.111.21 Same operator as on Blackcat: 68.183.180.36, 159.203.14.2 Pola: 159.89.7.123 Pola script download: hxxp://209.97.132.66/pola XMRig download: hxxp://162.243.166.183/miner3.tgz Recent Shellbot attacks detected on IBM’s honeypots: Attacker IPs (brute-forcing): 5.181.80.157 14/06/2021 193.232.68.71 12/06/2021 195.203.90.161 02/06/2021 142.93.169.146 16/05/2021 162.144.233.29 15/042021 Shellbot download URLs hxxp://51.38.105.98/a hxxp://5.253.86.50/div hxxps://gsmboss.clan.su/zn.jpg hxxp://142.93.127.16/wp-includes/images/media/.x/px.txt hxxp://58.135.80.99/a/div"}}
{"https://securityintelligence.com/posts/ursnif-cerberus-android-malware-bank-transfers-italy/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-23", "source": "securityintelligence.com"}, "text": "Contributed to this research: Segev Fogel, Amir Gendler and Nethanella Messer. IBM Trusteer researchers continually monitor the evolution and attack tactics in the banking sector. In a recent analysis, our team found that an Ursnif (aka Gozi) banking Trojan variant is being used in the wild to target online banking users in Italy with mobile malware. Aside from the Ursnif infection on the victim’s desktop, the malware tricks victims into fetching a mobile app from a fake Google Play page and infects their mobile device with the Cerberus Android malware. The Cerberus malware component of the attack is used by Ursnif’s operators to receive two-factor authentication codes sent by banks to their users when account updates and money transfer transactions are being confirmed in real-time. Cerberus also possesses other features and can enable the attacker to obtain the lock-screen code and remotely control the device. Cerberus is an overlay-type mobile malware that emerged in mid-2019 but initially lacked advanced capabilities. It has evolved over time to eventually feature the ability to hijack SMS content and control devices remotely, alongside other sophisticated data theft features . Cerberus was peddled in the underground as commodity malware until the summer of 2020, taking over the market share of Anubis, a previous pay-per-use malware. In September 2020, Cerberus’ development team decided to disband, spurring an auction attempt that aimed to sell off the source code to the highest bidder, starting at $100,000 . The code did not sell but was instead shared with the malware’s customer base, which meant it was publicly leaked. That intentional release of the source code gave rise to numerous malware campaigns involving Cerberus and likely also led to this combined attack with the Ursnif banking Trojan. A Combination Attack From Desktop to Smartphone Ursnif is a very long-standing staple in the cybercrime arena, possibly the oldest banking Trojan that’s still active today. Recent campaigns featuring this malware have been most notable in Italy, where it is typically delivered to business email recipients in attachments that purport to carry invoices, delivery notices or other business correspondence. The infection chain commonly involves poisoned macros, getting past email controls by featuring productivity files most organizations use. In some campaigns, the attackers keep access to the infection zone limited to Italian-based IP addresses only. Once infected by the Ursnif malware and upon attempting to access their online banking account, victims are advised, via web injection, that they won’t be able to continue to use their bank’s services without downloading a security app. To obtain that app, they are shown a QR code and instructed to scan it with their phone’s camera. Figure 1: Web injection instructing infected users to download a mobile app Looking into the QR code provided through the injection, we found a Base64 encoded string with the details. Figure 2: Malicious QR code’s content is a Base64-encoded string If users scan the QR code, they will open a web page on their smartphone and be sent to a fake Google Play page featuring a corresponding banking app logo of the banking brand the victim originally attempted to access. The campaign, in this case, included a number of domains that were most likely registered for that purpose and reported in other malicious activity in the past, such as hxxps://play.google.servlce.store/store/apps/details.php?id=it.[BANK BRAND]. Each of the domains hosting the fake Google Play pages used similar words or typo-squatting to appear legitimate. Some examples are: google.servlce.store gooogle.services goooogle.services play.google.servlce.store play.gooogle.services play.goooogle.services. These malicious domains have been flagged on VirusTotal for a few months, with more reports accumulating over time. Reports on the malicious Android Packages (APKs) that conceal the Cerberus malware spread in this campaign have been flagging it since at least late-2020. In cases of users who do not successfully scan the QR code, they are asked to provide their telephone number and subsequently receive an SMS message with a download link to fetch the malicious application, which warns users about a potential service interruption if they fail to obtain the app. Figure 3: Web injection instructing infected users to provide their phone number In the background, the injection’s code couples the phone number inserted by the victim with the bot ID the Ursnif malware assigned to that infected desktop, the bank’s name the victim uses and their login credentials as grabbed by Ursnif. Notice the use of the word ‘Jambo’ in parts of the code. It is most likely that Ursnif’s operators wrote a jQuery library to simplify HTML Document Object Model tree traversal and manipulation, using it to orchestrate their injections. Fraudsters can use the library to define the amounts to transfer from accounts and other parameters of the fraudulent transaction. Figure 4: Injection code sending Cerberus infection URL to Ursnif-infected victims If the victims submit their phone number on the web injection, the remote server will send back a download URL for them to unknowingly download the Cerberus malware. This injection also keeps the victims’ device identifiers linked to their bot ID and account credentials. Figure 5: Injection code sending Cerberus infection URL to Ursnif-infected victims, additional view Cerberus in Action Cerberus campaigns have already been detected spreading through the official Google Play store in the past, but this distribution attempts to land on victim devices through a third-party source — the attacker’s domains. The option to sideload APKs is not enabled by default on Android devices, and the choice to deliver the malware from a non-official source may have limited the spread of the campaign to a larger number of devices. When Cerberus is downloaded to a new device, it takes into account the original bank name the victim attempted to access when the infection process was initiated. A JavaScript function includes those details and ensures the victim continues to see a consistent message. Here too, the ‘Jambo’ word repeats throughout the function, calling into action the jQuery library that orchestrates the malware’s script-based activity. Figure 6: JavaScript function fetches Cerberus malware Cerberus is being used here only as the component that allows the attackers to bypass the bank’s SMS-code verification challenge. The fraudulent transaction itself takes place on the victims’ infected desktops (Windows-based devices). While most fraud is in-session using Gozi SOCK proxy capability, some access to the victim’s account came from other devices. Ursnif’s C2 Communications The basics of Ursnif’s command and control (C2) communications are also carried out through the same channels. Jambo.getScript sends information to srv_dom, which is the malware’s injection server in this case, used to manage the man-in-the-browser activity. Figure 7: Injection server communications The core commands botmasters can launch come in where string ‘step=’ appears. Some of the available bot actions are: Command Description ADD_INFO Send data to C2: token, SMS content, telephone, download an application. ASK Send communication to the C2. GET_DROP Check account balance on the victim’s bank account. GOOD_TRF Attempt to initiate a money transfer transaction. LOGIN Send victim’s login information to attacker’s C2 server. PING Check if the infected machine is currently online. IBAN Swapping Back in Style On the infected desktop, we are back to seeing familiar activity from the Ursnif Trojan. Since it hooks the internet browser, it takes different steps to manipulate what victims see on their screens and have them click on elements that launch the Trojan’s resources into action. One of the actions Ursnif wishes to take here is to automate transactions that start on the desktop’s browser. To do that, it is designed to swap the international bank account number (IBAN) and bank identifier code (BIC) numbers from legitimate transactions for an IBAN of an account the fraudster controls. To launch its fraudulent transaction flow, Ursnif needs to start a function that would be clicked by the infected victim. It, therefore, attempts to replace a login button from the original bank’s webpage and plant its own button that the victim will click. The function launched is named ‘hookPay()’: Figure 8: hookPay() function – Ursnif replaces IBAN number in legitimate transactions The function being used to swap the IBAN and plan the transaction parameters is called ‘makeTrf()’. The amount being transferred is set to move forward if the account’s balance is higher than €3,000. Figure 9: makeTrf() function – Ursnif sets up the fraudulent transaction’s parameters Injections Adapt to Security Challenge The configuration file in this campaign targeted the customers of banking institutions in Italy, specifically business banking services. On top of that, the attackers were after e-wallet and e-commerce credentials. Web injections were adapted to each target’s security challenge; for example, an injection instructing victims to provide numbers from a hard token. Figure 10: Adapting web injection social engineering to security challenge Victims are asked to enter the code they received into the web injection and are given a 90-second time-lapse to do that, likely also adapted to the time allotted by the targeted bank or service provider: Figure 11: Adapting web injection social engineering to security challenge, additional view After receiving the data from the victim, the malware sends data to the C2 server, including authorization token, SMS content, telephone number and account login information. It then shows a .gif file that makes it appear as if the web browser is loading something. After a couple of seconds, the .gif file is hidden, and the malware continues the login process in the background. To prevent victims from accessing the account and discovering the fraudulent activity before it is finalized, Ursnif presents a maintenance notice on the account. This notice can effectively prevent the victim from accessing the account from the infected device. Figure 12: Victims are denied access to their bank account to hide fraudulent activity Something Old, Something New — The Ursnif-Cerberus Combo Banking Trojan operators have always been fans of fraud they can automate. The rollout of two-factor authentication and strong transaction authorization schemes by online banking services across the globe have caused this entire threat actor class to rethink their tactics, techniques and procedures. Over time, the incorporation of mobile malware into the overall scheme of banking Trojan fraud has become a must, since it is the only way to complete transactions. The hindrance remains that malware operators have to continue to find ways to infect more mobile devices, especially when getting into official app stores has been getting harder. Also, activating the victim for the initial setup of the automation process is another place where the criminal can fail. Fortunately, these are also the places where defenders can help prevent fraud. Seeing Ursnif using Cerberus as its mobile malware component is new, but it is not surprising in the banking Trojan arena. Banking Trojan operators are constantly shifting tactics, but the strategy remains the same — they have to gain access to victims’ smartphones if they hope to get through security controls applied to banking and other services consumed online. Using Cerberus is also expected since the code was leaked and gave the option to any malware operator to make use of it against unsuspecting victims. IBM Security Trusteer helps organizations detect fraud, authenticate users and establish identity trust across the omnichannel customer journey. Through cloud-based intelligence, backed by artificial intelligence and patented machine learning, Trusteer provides a holistic approach to identifying new and existing customers, while improving the user experience. More than 500 leading organizations rely on Trusteer to help secure their customers’ digital journey and support business growth. To learn more visit: https://www.ibm.com/security/fraud-protection/trusteer To keep malware off your mobile devices, follow some security hygiene basics: Don’t jailbreak a smartphone Only download apps from Google Play’s official store If you download from a URL, get your bank’s application via your bank’s website Don’t enable sideloading; your bank or service provider will not ask you to load applications from unofficial sources Check who is the developer of the app you are downloading; if it does not look right, abort the download Be wary of excessive app permissions: Only allow apps to use your device for the purpose you require and not for unrelated activities If it looks like there’s a new security requirement from your bank, close the browser window and call your bank with the number on the back of your card to verify what’s needed If a transaction you attempted to carry out is stopped by an apparent ‘maintenance’ issue, attempt to access the account from a different device or call your bank. IOCs C2 Servers */statppaa/* hxxp://sanpoloanalytics[.]org/pp_am/ */statmoflsa/* hxxp://sanpoloanalytics[.]org/lancher/ MD5 Gozi: b6921ce0f1b94a938acb6896cc8daeba MD5 Cerberus + APK: 40b8a8fd2f4743534ad184be95299a8e17d029a7ce5bc9eaeb28c5401152460d Phishing domains and C&C servers: C&C: hxxps://ecertificateboly.us/lancher/ hxxp://sanpoloanalytics.org/lancher/ Phishing: hxxps://play.google.servlce.store/store/apps/details.php?id=it.phoenixspa.inbank hxxps://play.gooogle.services/store/apps/details.php?id=com.paypal.android.p2pmobile hxxps://google.servlce.store hxxps://gooogle.services hxxps://goooogle.services hxxps://play.google.servlce.store hxxps://play.gooogle.services hxxps://play.goooogle.services IP addresses: SOCKS Proxy: 37.120.222.138:9955 VNC: 194.76.225.91"}}
{"https://securityintelligence.com/posts/application-test-unexpected-opening-cisco-cucm/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-22", "source": "securityintelligence.com"}, "text": "Working as security consultants is highly rewarding. Companies depend on us to view their environment from the perspective of an attacker and find vulnerabilities that could enable threats to succeed. One of the most impactful parts of our role is when we’re the first to find a major vulnerability that could lead to a widespread compromise beyond just our client. That’s what happened this year with the Cisco Unified Communications Manager (CUCM) IM & Presence appliance. We performed an application penetration test against it for one of our clients. While doing so, we discovered an opening that could effect anyone who uses this appliance. Read on to find out how we explored the product, how we broke it and how to put it back together. What Is the CUCM Product? The CUCM solution is a middleware component that allows enterprises to integrate their various communication devices and manage them using one platform. In short, it unifies voice, video, data and mobile applications on fixed and mobile networks. Starting with the Cisco Unified Communications 9.0, the Cisco Unified Presence technology is integrated within the CUCM. Nowadays, most people refer to this solution as the CUCM IM & Presence Service. Almost every customer that uses the Cisco Jabber instant messaging application has the CUCM IM & Presence deployment. The Findings During the pen test, we first tried to use the least possible privilege to pinpoint the vulnerabilities that the least trusted users can reach. Then, we created a replica of the appliance in a lab environment. Using several reverse engineering techniques, we extracted the source code of the web application used to manage the appliance. Through both dynamic testing and analysis of the source code, we found the following vulnerabilities: 3 x Structured Query Language (SQL) injection (CVE-2021-1355, CVE-2021-1364, CVE-2021-1282) SQL injection leads to arbitrary code execution (CVE-2021-1363, CVE-2021-1365) Path traversal (CVE-2021-1357) Cross-site scripting (CVE-2021-1407, CVE-2021-1408) The main objective was to find vulnerabilities that attackers could exploit to elevate their privilege on the appliance. At first, our team managed to identify several SQL injection vulnerabilities , but the application had a protection module that filtered the user input. By inspecting this module, we found a weakness in the module logic that we used to bypass it. This allowed one to exploit three SQL injection vulnerabilities. An attacker could use this to extract sensitive information from the application database, including the administrator password hash. Other Vulnerabilities One of the SQL injections was chained with another vulnerability — an operating system command injection vulnerability — to achieve arbitrary code execution on the appliance. The chained attack could enable an attacker with low privileges on the appliance to escalate their privilege to root shell access. At that point, the attacker could have full control of the appliance, and the access could be used to move laterally inside the internal network and attack internal assets and other users. We also discovered a local file read vulnerability in one of the application’s endpoints. This could allow an attacker to read any locally accessible file on the web server through the vulnerable endpoint. Finally, we discovered a way to bypass and evade application security controls to exploit multiple reflected cross-site scripting issues on multiple endpoints. An attacker could exploit this vulnerability by constructing a request with an injected malicious payload in the vulnerable parameters and deceive the logged-in users to visit it. The malicious payload injected by the attacker is executed within the victim’s browser, in the context of that victim’s session. The malicious application allows the attacker to hijack the user session and redirect the victim to an attacker-controlled domain or another client-side attack. That might be in-browser keylogging or performing arbitrary actions within the context of the application. We also discovered sensitive information disclosure in one of the application endpoints. This could allow an authenticated attacker to disclose users’ hashed passwords, which could then be recovered using a dictionary attack. Moving Laterally Through the Enterprise As a result of these vulnerabilities, a low-privileged user could elevate their privileges to the highest level on the CUCM appliance. From there, they could access sensitive data, manipulate sensitive configurations and install malicious software on the appliance that monitors and records the communication between Cisco Jabber users. An attacker could hijack logged-in user sessions or deceive users to steal their credentials. Furthermore, since the application allows for code execution, an attacker could use it as a foothold within the network from which to move laterally. The Next Steps: Reducing the Risk of Compromise So, what should you do about it? We recommend you install the latest patch for the Cisco Unified Communications Products from the Cisco security advisories. The patches for both the CUCM and the CUCM IM & Presence are shown in the charts below. Links to the advisories are located in the References section. A continuous penetration testing program can also help discover and fix these types of vulnerabilities. Learn more about X-Force Red’s penetration testing services here . On July 21, 2021, X-Force Red will be hosting a virtual panel session about threats against and vulnerabilities exposing Internet of Things (IoT) devices. The presenters will include IoT industry leaders such as the ioXt Alliance and Silicon Labs. Register here References CUCM IM & Presence SQL injection vulnerability leads to arbitrary code execution: https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-imp-inj-ereCOKjR CUCM IM & Presence SQL injection vulnerability leads to local file disclosure and path traversal vulnerabilities: https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-imp-trav-inj-dM687ZD6 CUCM cross-site scripting vulnerability leads to attack on other appliance users: https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-cucm-xss-Q4PZcNzJ https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-cucm-inf-disc-wCxZNjL2"}}
