{"https://www.kaspersky.co.in/blog/icedid-qbot-banking-trojans-in-spam/23048/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-07-09", "source": "www.kaspersky.co.in"}, "text": "For employees facing hundreds of e-mails, the temptation to speed-read and download attachments on autopilot can be great. Cybercriminals, of course, take advantage, sending out seemingly important documents that might contain just about anything from phishing links to malware. Our experts recently discovered two very similar spam campaigns distributing the IcedID and Qbot banking Trojans . Spam with malicious documents Both e-mails were disguised as business correspondence. In the first case, the attackers demanded compensation for some bogus reason or said something about canceling an operation. Attached to the message was a zipped Excel file named CompensationClaim plus a series of numbers. The second spam mailing had to do with payments and contracts and included a link to the hacked website where the archive containing the document was stored. In both cases, the attackers’ aim was to persuade the recipient to open the malicious Excel file and run the macro in it, thus downloading either IcedID or (less commonly) Qbot to the victim’s machine. IcedID and Qbot The IcedID and Qbot banking Trojans have been around for years, with IcedID first coming to researchers’ attention back in 2017 and Qbot in service since 2008 . Moreover, attackers are constantly honing their techniques. For example, at one point they hid the main component of IcedID in a PNG image using a trick called steganography that is pretty hard to detect. Today, both malware programs are available on the shadow market; in addition to their creators, numerous clients distribute the Trojans. The malware’s main task is to steal bank card details and login credentials for bank accounts, preferably business accounts (hence the businesslike e-mails). To achieve their objectives, the Trojans employ various methods. For example, they may: Inject a malicious script into a Web page to intercept user-entered data; Redirect online banking users to a fake login page; Steal data saved in the browser. Qbot can also log keystrokes to intercept passwords. Unfortunately, theft of payment data is not the only trouble that awaits victims. For example, IcedID can download other malware, including ransomware, to infected devices. Meanwhile, Qbot’s tricks include stealing e-mail threads for use in further spam campaigns, and providing its operators with remote access to victims’ computers. On work machines in particular, the consequences can be serious. How to stay safe from banking Trojans No matter how crafty cybercriminals can be, you don’t need to reinvent the wheel to stay safe. Both of the spam campaigns in question rely on recipients taking risky actions — if they don’t open the malicious file and let it execute the macro, the scheme simply will not work. To reduce your chances of becoming a victim: Check the sender’s identity, including the domain name. Someone claiming to be a contractor or a corporate client but using a Gmail address, for example, may be suspicious. And if you simply don’t know who the sender is, check with colleagues; Prohibit macros by default, and treat documents that require you to enable macros or other content with suspicion. Never run a macro unless you’re absolutely sure the file needs it — and is safe; Install a reliable security solution . If you work on a personal device, or your employer is lax when it comes to workstation protection, make sure it’s protected. Our products detect both IcedID and Qbot."}}
{"https://www.kaspersky.co.in/blog/how-to-protect-from-vishing/23018/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-30", "source": "www.kaspersky.co.in"}, "text": "Between tech support requesting access to your computer, concerned tax services specialists demanding payments, medical equipment suppliers “returning your call,” and many more — none legitimate — it’s a wonder anyone even answers their phone anymore. You’d be hard-pressed to find someone who hasn’t experienced some form of phone scam, although the name for it isn’t as well-known: vishing. What is vishing? Vishing is short for voice plus phishing (as smishing is SMS + phishing ), and, aided by the mass transition to remote work, it has turned the phone into a major weapon of fraud, to the extent that law-enforcement agencies now periodically release official announcements about the danger. According to 2019 data from the US Federal Trade Commission, only 6% of scam calls ended in financial loss. Nevertheless, when it happened, the damage was quite significant, with a median value of $960. Anyone can fall for a scammer’s bait, even experts who think they’ve seen it all . Many fraudsters are excellent at gaining the confidence of even the most vigilant target. On the one hand, vishing is more conservative than regular phishing, because the telephone itself is an older means of communication. On the other hand, massive data leaks in the digital age have lent voice scams new power: Never before have scammers been in possession of such volumes of information about almost everyone on the planet. The proliferation of Internet telephony (VoIP) further plays into the hands of cybercriminals, enabling them to manipulate phone numbers and cover their tracks. Types of scam calls Scammers can say just about anything on a call, but their attempts tend to fall into a few main categories. Telemarketing Telemarketing fraud tends to involve offers too good to be true and pressure too time-sensitive to end well. Some examples include winning the lottery (bonus points it you didn’t even buy a ticket), a reduced credit card interest rate, and other lucrative offers that are hard to refuse. They tend to have in common the need to make a decision on the spot, plus a small advance payment from you to them. If you have the time to think about the offer, it’s (usually) clearly fraudulent. If you make the payment, it’ll just go to the scammers, literally rewarding them for their crime and also reinforcing the value of using leaked databases of phone numbers to call and defraud thousands more people. Government agency One of the most common schemes involves allegedly unpaid or underpaid taxes. A “tax office” initiates the call and provides a choice: Pay the arrears or face a fine. The offer expires soon, after which the fine will increase. Again, adding time-sensitivity works. Given time to think about how tax agencies communicate with citizens, not to mention their deadline structures, the average citizen could probably figure out that such calls are fraudulent. Faced with a ticking clock and (apparently) a government agency known for strictness, however, adjusts the odds in scammers’ favor. Technical support For unsolicited tech-support calls, scammers choose large, well-known brands to increase the chances of connecting with an actual user of the product. The caller typically claims to have found an issue with the victim’s computer and asks for login credentials or remote access to their computer. A more sophisticated scheme involves some preparation, for example, infecting a computer with malware that invokes a pop-up window with a description of the alleged problem and a phone number to call to get it fixed. Bank The ultimate object of any scam is money, so of course some fraudsters pretend to call from banks. Generally, they claim to be reporting suspicious account activity, which in reality gives them cover to request details such as a CVC/CVV code or a one-time passcode from a text message. Armed with such details, the fake bank employee can easily clean out an account for real. How to recognize scam calls We can’t discount the notion that scammers, always on the lookout for more-convincing hooks, might someday learn from fraud’s rich history of tells, but most scams exhibit at least one of several red flags. If a call supposedly from a bank or government agency comes from a cell number, it’s almost certainly vishing. Double those odds if the phone number is from a different region. However, an official-looking number is no guarantee of a legitimate call; modern technologies allow caller ID spoofing . If a caller tries to extract confidential information, especially in a threatening manner, that too is a sign of vishing. In general, any attempt to find out private information is an indication of fraud: any information a real bank or tax office employee needs about you, they probably already have — remember, we’re talking about communication they initiated, not you. If someone urges you to make a monetary transaction and cites a deadline, it’s definitely a scam. If a caller tries to persuade you to install software on your computer to fix some problem they called to tell you about, it will probably end badly for you. Finally, an indirect but still reliable sign of vishing is if the caller gets confused, misspeaks, is hostile, or uses slang expressions. We have nothing against everyday speech, of course, but real operators are generally trained to use professional language. How to guard against scam calls If you spot at least one of the above red flags, the best option is simply to end the conversation. After that, call the company or organization that supposedly just called you and report the incident — the more information they collect, the more likely they are to catch, or at least hinder, the fraudsters. Look up the tech or customer support number separately, for example by going to the organization’s official website. In addition, resolutely avoid installing remote access programs on your computer, however convincing any caller may be, and use a reliable security solution that detects dangerous applications in good time and warns you about them."}}
{"https://www.kaspersky.co.in/blog/wow-weakauras-auction-scam/22989/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-16", "source": "www.kaspersky.co.in"}, "text": "When scammers target gamers, they are typically pursuing gaming accounts. Today, we’re discussing a different target: players’ gold. As games go, the massively popular World of Warcraft sees scammers target players on a regular basis, one day threatening them with a ban for alleged cheating , the next seeming to offer virtual pets (but not really; it’s a scam, after all). A user nicknamed Legitamasterr posted on Reddit in late May, describing an original scam used at the World of Warcraft Classic Auction House. The player, who was trying to buy a stack of Chronoboon Displacers for 66 gold coins, instead had more than 11,000 gold coins deducted from his account. He had become a victim of a malicious script in an add-on he had installed. Here is how to protect yourself and avoid a similar fate in World of Warcraft Classic . What are World of Warcraft add-ons for? Add-ons are useful and sometimes indispensable in World of Warcraft . With them, you can customize the interface, filter out in-game chat spam, and do much more. For example, a popular add-on called WeakAuras can help you set up convenient access to information such as the amount of time before a boss’ next high-damage attack, a warning that you are under a curse that inflicts damage to nearby players, the mana reserve levels of raid healers, and so on. WeakAuras is essentially a framework: all timers and indicators are added to the base add-Аon using scripts written in Lua programming language, commonly called “auras”. Many sites offer ready-made assemblies of auras for specific classes, specializations, and even professions. Sometimes, though, players are looking for something specific, such as an aura for a single quest or an experimental tactic. Some players versed in programming customize existing scripts or create auras themselves. And sometimes, in a raid with random partners, an unfamiliar raid leader may demand, “we are using a new tactic to fight this boss — everyone needs to install this aura right now”, and send a link. Of course, the decision is yours, but anyone who doesn’t install the aura can expect to be kicked out of the raid. Worse, leaders usually drop those links into raid chats, and most players simply click on the name and install scripts without a second thought. It is important to remember that using these scripts, which are also linked on message boards or in in-game chats, can be risky. With no centralized validation mechanism, stuffing auras with malicious surprises is easy, and unless you know Lua, you cannot check the code. In addition, a deceptive aura may behave like a bona fide script until it is triggered by certain conditions. Scammers take advantage of that in Azeroth. A cunning auction The malicious script lies in wait, behaving normally until a player who has installed it stocks up on certain consumables (say, elixirs, ore, or herbs) at the Auction House. As soon as the player selected the desired item, the script redirects the query to an identical product that the scammer is selling for 10,000 coins. At the same time, the script replaces the system message confirming the purchase with a fake one, showing the original price, say 5 coins. That way, despite making and confirming a small purchase, the player finds their account has been charged 10,000 instead. The scammer can spend the gold in the game, although exchanging it for real money is more typical. It is with good reason that Blizzard support strongly recommends players refrain from buying gold at reduced rates on third-party websites. Why the WoW Auction House scam works World of Warcraft is known for showing zero tolerance to cheaters. Blizzard’s licensing agreement prohibits changes to the game’s source code and the use of tools that give some players advantages over others, as well as any interference with game-play. So, how did the auction fraud go unnoticed? It was because the scripts affect the interface only through WeakAuras tools, which are allowed. As far as the system is concerned, if players want to pay thousands of gold pieces for items worth pennies, that’s their choice. On top of that, most players need some help to figure out which of their many add-ons caused them to lose money. That gives cybercriminals the time they need to trick lots of users before their scheme is exposed. How to avoid becoming a victim, and what to do if you have been robbed Scammers rightly believe players will need some time to realize they are being cheated at the Auction House (controlled by Blizzard), or that the source of the problem is a script that never caused them any trouble before. Instead of relying on the game, be proactive and keep yourself safe. Update the WeakAuras add-on During the discussion on Reddit, an expert analyzed the victim’s installed add-ons and scripts, found the malicious one, and reported the finding to WeakAuras’ developers. The developers fixed the problem, so even if you have the malicious script installed, updating WeakAuras to the latest version should remove it automatically. That measure is unlikely to be effective against yet-unknown malicious auras. To protect WeakAuras from dangerous scripts reliably, its developers would need to implement a basic antivirus engine, regularly check existing auras, and add any malicious ones to a database. That’s a lot of work, though. In any case, if you have it, update WeakAuras right away. Double-check transactions and trade offers This particular tip wouldn’t have helped with the scheme we describe above, but it may prove generally useful. Scammers can try to deceive you without using any tricky add-ons, for example, by replacing an item with something much cheaper immediately after you enter the amount in the window, or by quickly removing a couple of zeros from their payment amount when buying. Therefore, before confirming any transaction, we recommend waiting an extra few seconds and carefully checking the item and purchase amount. Consult our online game safe trading guide as well. Ask for help if you have been harmed If you find yourself in a similar situation, share the news. Contact support and start a message board thread, and attach screenshots and a list of your add-ons in each case. You can expect moderators and experienced players to offer advice, help with next steps, and perhaps even find a way to punish the scammers. In asking for help, you will also help by alerting other players, and you might get your gold back as well, as Legitamasterr did. Protect yourself It’s critical to install a reliable security solution as well. Even though it probably won’t detect a cheat script for a WoW add-on, it will keep you safe from most malicious and dangerous sites and programs."}}
{"https://www.kaspersky.co.in/blog/malware-disguised-as-antivirus/22979/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-11", "source": "www.kaspersky.co.in"}, "text": "In almost every post about Android, we recommend installing apps from official sources only, and that won’t change anytime soon. A recent example illustrates why: Scammers were spreading a banking Trojan disguised as popular media players, a fitness app, a book reader, and one that hit close to home, Kaspersky Internet Security for Android. Why it is dangerous to install applications from alternative sources Nothing is wrong with third-party app marketplaces per se, but no one can know for sure whether any given store is trustworthy. In an official Android app store, be it Google Play or Huawei AppGallery, employees of the respective owner companies screen every application submitted by developers, weeding out any that are clearly malicious. These are large companies that protect their reputations and customers’ security, and they have both the resources and the motivation to help keep users malware-free. Sometimes, however, malware does get through , and even into Google Play, although the chances of encountering it there are much lower than on message boards, torrent trackers, or some other sites. Proudly small, independent marketplaces tend not to run many checks, typically because they lack the resources, and as a result, the apps they host could be anything in disguise, even a Trojan. We should mention here that downloading malware to an Android device is not usually enough to infect it. Unless the malware relies on some kind of zero-day uber-exploit to get superuser permissions , installing a dangerous app in Android requires some effort. The operating system queries the user about every step: whether they really want to install the app, whether they agree to grant it the permissions it requests, and so on. Cybercriminals employ social engineering to persuade people to say yes, often with great success. Malicious security from an alternative marketplace Here is an example. Not so long ago, a group of researchers reported on Android applications spreading through various fake sites. The apps included a fake version of Kaspersky Internet Security for Android. The scammers were spreading their fake app with the name “Kaspersky Free Antivirus” (we used to offer a product with that name, but it was for Windows). On Google Play, our mobile antivirus app is currently called Kaspersky Mobile Antivirus: Applock & Web Security . Ironically, users who downloaded the fake antivirus app received a banking Trojan known as TeaBot, which our security products detect as HEUR: Trojan-Banker.AndroidOS.Teaban or HEUR: Trojan-Banker.AndroidOS.Regon. Why is this especially problematic in the case of antivirus apps? It’s because the user not only downloads and installs a banking Trojan disguised like this, but also grants it all of the permissions it requests. After all, an authentic antivirus app needs a lot of permissions, including very powerful access such as Accessibility services . Worse, in the absence of actual antivirus protection, the device cannot detect the malware. Completing installation and granting all requested permissions gives the TeaBot Trojan the ability to do almost anything on the Android device. Its capabilities are many: from keylogging , stealing Google Authenticator codes, and exploiting Accessibility in other ways all the way to gaining full remote control of the Android device. How to make sure an app is legit Antivirus isn’t TeaBot’s only disguise. The malware is also available as fake versions of some well-known government, financial, fitness, and reading apps, among others. To stay safe, turn off your smartphone’s ability to install applications from unknown sources altogether — Android allows that. And if you need an app of any kind, find it on an official marketplace. Be very careful as well about the permissions you grant to applications . If a fitness app unexpectedly requests permission to use Accessibility, for example, think twice (or more) before answering. Finally, be sure to use authentic antivirus protection. With a completely free edition of Kaspersky Internet Security for Android available, there’s no reason to download it from unofficial sources. You can find our antivirus app in both Google Play and the Huawei AppGallery."}}
{"https://www.kaspersky.co.in/blog/minecraft-mod-adware-google-play-revisited/22950/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-09", "source": "www.kaspersky.co.in"}, "text": "Although we recently reported finding 20 apps in Google Play posing as Minecraft modpacks — the most popular with more than a million downloads — Minecraft -themed malware continues to pop up in Google Play. Instead of doing anything they claimed, the apps turned users’ smartphones and tablets into extremely intrusive advertising tools. To be clear, the apps were totally useless from a user perspective. Instead, after the first run they hid their icons and repeatedly opened the browser to flash ads. They could also play videos from YouTube, open Google Play app pages, and more. The version we analyzed, for example, opened the browser every two minutes, rendering the device essentially unusable. The thing was especially troubling, because it was extremely hard for a user to figure out what was going on, which app was responsible for the troubles and how to stop it. We notified Google about our find, and the malicious apps were quickly removed from the store. New versions of malicious apps Deletion from Google’s app store does not necessarily defeat malware; historically, its makers simply upload new, slightly modified, versions using different names and from different developer accounts. One example of the cycle comes from the VK Music Trojan, which stole VK user accounts and, despite being reported, dug in to Google Play for several years . Mindful of that, we revisited the case of the harmful Minecraft modpacks in Google Play to find out whether reporting had helped. To that end, we launched a search for similar apps — and found some. New, improved versions First, we found several apps using the abovementioned approach, but with some improvements. In a basic scenario the apps accept push message commands from the attackers to show full-screen ads (no user interaction required). The apps are designed to download an extra module as well. With that module downloaded, more functions become available, enabling the apps to hide their icons, run the browser, play YouTube videos, open Google Play app pages, and so forth. This time, the list of compromised apps included, in addition to Minecraft mods, a file recovery utility called File Recovery – Recover Deleted Files . Version 1.1.0, available from Google Play until February 2021 had a malicious payload. That version has been removed, and version 1.1.1, which is now on Google Play, is safe. Simplified version with paid subscription on Google Play Second, we found a couple of Minecraft modpacks with basic functionality, a configuration in which the apps occasionally show full screen ads, even with the app inactive, but are unable to hide their icons or run the browser, YouTube, or Google Play. For extra monetization, the in-app purchases function is used. One of the malicious Minecraft modpacks in Google Play Interestingly, one of the apps is now available from the store as a “basic” version and with in-app purchases enabled, whereas a couple of months back it relied on the extra downloadable module. From this we conclude that their owners are continuing to experiment with monetization options. Facebook-account-stealing version Third, we found several more apps were found in which the described above malicious functionality was not the core one. A while ago, for example, Google Play carried a fake Madgicx advertising network app and a fake TikTok ad-management app that would insistently prompt for the user’s Facebook account data and, if user provided it, would steal the account. Apps from alternative stores Finally, many such apps remain available from alternative stores even after Google removes them from its store. Which is no surprise; even Google, with vastly more resources than the average company, can’t always promptly moderate the great volume of existing apps. Yet we decided to mention this aspect here, as it provides clear evidence that alternative stores are unsafe to use. If still intending to use them for whatsoever reason, at least install a reliable mobile antivirus to protect you against dangerous apps. That said, as we see from this story, as well as many other episodes of malware getting into the official Google app store , even if you download your apps only from Google Play, you are still better off with an antivirus on your smartphone."}}
{"https://www.kaspersky.co.in/blog/cryptoscam-in-discord-fake-ico/22929/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-06-04", "source": "www.kaspersky.co.in"}, "text": "Following the helicopter money and fake cryptocurrency exchange scams, the Discord scam saga continues, this time with cybercriminals hitting ICO investors. What ICOs are, and how they work ICO is short for Initial Coin Offering . Before making them available for free trading on cryptoexchanges, makers of new cryptocurrencies release some tokens — typically to raise initial funds for the project. On the buyer side, speculators are hoping to profit — that the market rate will increase. That makes ICOs similar to IPOs (initial public offerings) on the stock market. The ICO concept is gaining momentum. According to PwC analysts , ICOs increased from only 49 ICOs in 2016 to more than 1,000 in 2018. The financial increase is no less impressive: from $252 million to $19.7 billion. ICO types Several initial placement options are available. Broadly, there are capped and uncapped placements. In the former case, the issuer clearly states the sum to be collected and the number of tokens up for trading — as a result, there may not be enough coins to cover the demand. Uncapped placements continue, as the name suggests, nonstop throughout the ICO. The organizers never stop collecting money, hoping to bring in as many investors and as much money as possible. But an unlimited supply may dampen investor interest, of course, so organizers have to hype the placement. There are also several distribution options. For example, in some ICOs, advance requests are processed based on an FCFS (First Come First Serve) basis; in others, whoever offers the highest price wins the assets at auction. Then we have the randomized queue, an alternative format that’s been gaining traction of late, in which the traders register on the project website well in advance but learn their number only after they are in the queue and trading begins. In other words, potential cryptoinvestors can’t know until the last moment whether they will get the coveted assets. Those who get nothing risk falling victim to FOMO (fear of missing out, a term investors use for anxiety due to lost profit or opportunity) — that is, getting nervous and letting their guard down. An ICO that never happened FOMO is at the heart of many scams. Lately, for example, we’ve been seeing mass messaging to members of cryptocurrency communities in Discord, with emoji-rich text advertising a new round of an uncapped ICO allegedly being held by a (real) leading-edge blockchain startup — Mina in our example, but there are others as well. Just like every other fraud scheme, this one tries to rush potential victims into following a link to the “official” website. Incidentally, the real Mina did hold a placement not long ago, in the randomized queue format, and many who registered got no coins. The new scheme exploits that history. Scammers warning about scammers in one of the messages in Discord The message contains links to what looks like the real Mina page. The Mina project is dedicated to creating a minimalistic blockchain, so the Mina website is also minimalistic to the extreme — which spared the scammers the effort of building a comprehensive fake. Visitors are required to complete a simple registration: name, e-mail address, and, for some reason, a link to their social network page. The rogue site’s overall style is similar to Mina’s The scammers claim to have streamlined the ICO process: “Make a cryptocurrency payment to the specified wallet and get your tokens.” In fact, the next prompt, right after registration, requests a cryptocurrency selection and payment amount. The token “purchasing” process is designed to be as simple as possible — select one of three popular cryptocurrencies … … and then specify the sum you mean to part with (forever) Once the currency and sum are specified, the payment alone remains — the website offers to copy the address of the scammers’ cryptocurrency wallet or scan its QR code. Almost there: time to pay Once they have pocketed the money, the criminals apologize for the delay, citing necessary confirmations in the blockchain network, which, unfortunately, is under heavy load at the moment. They ask investors to be patient and wait for three hours before contacting support, should the coins fail to arrive. Everything is fine, and the coins are on their way (not really) It should come as no surprise that the investors will never get their coins — their money are gone for good. Apparently, some people have already fallen victim to the scheme. For example, as of the time of this publication, the wallet specified on the fake Mina page had received 0.2 BTC in payments (more than $7,000 — again, as of the time of this publication). How to avoid ICO cryptoscams To stay clear of the scheme described, follow these simple rules — they’re good for just about any situation. Think. Consider the incoming message soberly. In the fake Mina example, ask yourself why such a generous (weird but generous) offer would have no buzz in specialized communities? Could the sender be trying to exploit your FOMO? Why the need to use no link but the one in the letter? Why does the letter ask you to spread the information among your contacts? There’s no proof of scam here, but plenty of food for thought. Check. Visit the issuer’s official website by typing its address into your browser’s address bar. Read any coverage of the ICO project on specialized resources. Check the real cryptoproject servers in Discord, which stay on top of scams and post warnings. However you choose to research and verify, never drop your guard: Scammers have built entire fake news sites to lend credibility to cyberscams. Protect. The human factor is not infallible; we need automatic defenses for added security. A reliable protection solution, such as Kaspersky Internet Security , will warn you if someone tries to redirect you to a malicious, phishing, or scam website."}}
{"https://www.kaspersky.co.in/blog/artstation-job-scam/22897/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-05-24", "source": "www.kaspersky.co.in"}, "text": "The pandemic has left tens of millions of people around the world effectively jobless, and scammers, never ones to miss an opening, have been targeting freelancers and job seekers more frequently. Today, we look at an unusually sophisticated scam aimed at artists and designers. Job hunting on ArtStation The story begins with ArtStation, a site where artists publish their portfolios in categories such as game art, anime, comics, media, and film production. It is normal for site users to receive personal e-mails from potential customers. Since last year, however, ArtStation freelancers have found themselves targeted by highly professional cybercriminals posing as employees of major game developers including 2K, Big Fish, Bluepoint, and Riot Games. The story of a scam One user, a US-based concept artist, received what looked like an invitation for an interview with 2K, publisher of such titles as BioShock, Mafia, Sid Meier’s Civilization, NBA 2K , and Borderlands . The position came with a good salary and the option to work remotely. The e-mail was well crafted and included many details that are usually indicative of an HR professional. Fake e-mail about a work-from-home job The contractor carefully studied the message, which looked nothing like ordinary spam. Even the sender’s domain appeared legitimate: @2kgamesjobs.com. In between the terms of employment and links to LinkedIn profiles, the alleged employer stated that the interview would be held on Telegram and included a link to download and install the app. The artist downloaded the messaging app and contacted the alleged recruiter. At this point most scammers would pivot straight to extortion, but these ones remained in character for quite a while longer. They conducted a long and in-depth interview with the artist, but not over a video or even voice call, which is what we’d expect from a legitimate company, but rather in text using Telegram’s secret chat mode . Still, not for one second did the artist get the sense it was all a sham. The fake recruiter’s questions required professional knowledge of perspective, color theory, and shading. The test seemed real, and the artist was relieved to pass it. Now all that stood between the artist and the perfect job was a couple of formal procedures: some software and hardware requirements including a MacBook Pro with certain specs, a graphic-design package, a screen-calibration tool, and a time-tracking system — nothing implausible, but the equipment had to be purchased from a particular vendor. In return, the artist could expect an advance payment check. However, the mandatory purchase of equipment was enough to make the artist suspect that something was amiss. The artist found a warning on 2K’s website about “bad actors posing as company HR personnel” and stopped communicating with the scammers. That was the end of the story for this artist, but not all targets were as vigilant. Denouement If the artist had continued to communicate with the fraudsters after the phony interview, they would indeed receive a check, which would appear to come from 2K’s finance department and be delivered by a real FedEx courier, which again shows how much effort the scammers put into the operation. The check looks real, but it’s fake However, the check does not stand up to scrutiny. It looks real; the lettering on the stub even suggests the presence of a watermark on the back. But it’s just a piece of paper printed on an ordinary color printer. The scammers try to time its arrival for late on a Friday afternoon so the recipient won’t have time to go to the bank and verify its authenticity. The timing may be linked to something more, however. Checks go through a process called clearing , which can take several days. Most banks do not work on weekends, so the scammers figure the new “employee” will simply pay for the equipment out of their own pocket that very weekend, assuming the check will clear. If the victim confirms their willingness to do so, the attackers reveal the identity of their authorized supplier, which turns out to be an individual with a Venmo or Zelle account, two US money transfer services. The bogus recruitment scheme is designed to get the jobseeker to send to this unknown party a sum equal to the cost of a MacBook and other “required software and equipment” — more than US$3,500 in total. How to protect yourself The scheme is big enough for the implicated companies to draw attention to it. ArtStation, for its part, posted an in-depth article about the scam. Some game developers and publishers have also posted warnings on their websites for potential candidates. Some studios warn artists to be careful Here are some tips to help you avoid falling victim to this kind of scam: Limit job searches to official sources. ArtStation’s job board , for example, shows only vetted listings. Be wary of offers to discuss a job or hold an interview in secret chats, in which messages are encrypted and cannot be forwarded, and which alert participants if anyone takes a screenshot. Check contact information on companies’ official websites, which usually provide addresses and communication channels for HR personnel. If necessary, e-mail a general inquiry to the company asking if the person who contacted you actually works there. Use a reliable security solution with fraud and phishing protection."}}
{"https://www.kaspersky.co.in/blog/rsa2021-tv-remote-listening-device/22890/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-05-20", "source": "www.kaspersky.co.in"}, "text": "There’s a certain reliability to everyday objects. Take a TV remote for example: It’s hard to imagine one eavesdropping on conversations, but cybersecurity researchers J. J. Lehman and Ofri Ziv from Israeli company Guardicore got one to do just that. They reported their findings at RSA Conference 2021 . How researchers hacked a remote The subject of Lehman and Ziv’s research was the remote control for the Comcast Xfinity X1 set-top box, which is popular in the United States (with more than 10 million users, according to the researchers). The remote control supports voice commands, for which it is equipped with a microphone and a quite capable processor. Two data transfer technologies are implemented in the device. For switching channels and other simple actions, a standard infrared transmitter is used, which has the important advantage of consuming minimal energy so that the remote does not need frequent charging, allowing it to operate on ordinary batteries for an extended period of time. But for cases requiring a faster data transfer speed, the remote uses a radio interface, enabling the remote not only to send data to the set-top box, but to receive from it as well. The radio interface consumes more power, so it is used only when needed. Like many modern devices, this type of remote control is essentially a connected computer — and therefore hackable. Having studied the remote’s firmware (with a copy conveniently stored on the set-top box’s hard drive), the researchers were able to determine the alterations that would enable the firmware to command the remote control to turn on the microphone and transmit sound over the radio channel. But modifying the firmware was not enough; they still needed a way to upload it to the remote, and preferably without physical contact. To do that, Lehman and Ziv examined how the set-top box communicates with the remote and updates its software. They discovered that the remote had to initiate the update process. Every 24 hours, the remote queries the set-top box and receives either a negative response or an offer to install a new version of the software, which it downloads from the set-top-box. The researchers also found several vital flaws in the communication mechanism between the remote and the Xfinity box. First, the former does not check the firmware’s authenticity, so it will download and install whatever firmware the set-top box (or the hacker’s computer impersonating one) offers it. Second, although the set-top box and the remote exchange encrypted messages, the encryption is not properly enforced. The remote accepts (and executes) commands sent in plain text marked “encryption disabled.” The remote’s requests are still encrypted and therefore cannot be deciphered, but simply understanding the communication mechanism makes it possible to effectively guess what the remote is asking and to give the right response. It goes something like this: “YdvJhd8w@a&hW*wy5TOxn3B*El06%D7?” “Sure, there’s a firmware update available for you to download.” “Cj@EDkjGL01L^NgW@Fryp1unc1GTZIYM.” “Sending the file; accept it.” Third, it is quite easy to trigger an error in the firmware module that handles communication with the remote, causing the module to crash and reboot. That gives the attacker a window during which they are guaranteed to be the only party giving commands to the remote. Therefore, to hack the remote one needs to: Wait for the remote to make requests and guess when it is querying about updates; Knock out the set-top box module responsible for communicating with the remote the moment it makes an update query; Give an affirmative response to the remote and send a modified file for uploading. All of that happens contactlessly, over the radio interface. The researchers stuffed their remote with modified firmware that queried for updates not every 24 hours, but every minute; then, on receiving certain response, turned on the built-in microphone and broadcast the sound to the attackers. Their tests succeeded at relatively long range and through a wall, simulating a wiretap van outside a house. How to stay protected In our opinion, there is little point worrying about your remote being hacked and turned into a listening device. Although proven feasible, the attack isn’t really practical. It might be suitable for a targeted attack on some kind of special person, but it’s too complex and time-consuming for large-scale use. That said, here are some tips for those of a you-can-never-be-too-cautious frame of mind: If you own an Xfinity TV box, check the remote’s firmware version. The researchers responsibly disclosed the vulnerabilities to Comcast, and the company has issued an update that fixes the problem; The remote controls of some other manufacturer’s TV boxes and TVs with voice support likely operate on the same principle and may have similar vulnerabilities. So periodically check for updates for your remote and install them when they are available. Corresponding items in TV and set-top-box menus are likely somewhere near their Wi-Fi and Bluetooth settings; Consider taking apart the remote to physically remove the microphone if your remote supports voice commands but you never use them. We think doing so is overkill, but it’s an option; Be aware that an attack on your Wi-Fi network is far more probable than such an exotic hack. Make sure to configure yours securely , move all vulnerable IoT devices to a guest network , and use a secure connection ] to protect the most valuable data."}}
{"https://www.kaspersky.co.in/blog/irish-health-service-ransomware/22856/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-05-14", "source": "www.kaspersky.co.in"}, "text": "Updated on May 17, 2021. Media outlets are reporting an attack by ransomware on the Health Service Executive (HSE), Ireland’s healthcare system. The HSE decided to shut down key information systems for thorough investigation and protection against further threat spread. A number of clinics have reported temporary shutdowns or at least disruptions in their operations, although they continue to provide emergency care services. The COVID-19 vaccination program was not interrupted, although some institutions have had to revert to outdated workflow systems. The Irish healthcare system attack in brief According to HSE representatives, a “very sophisticated,” human-operated ransomware attack caused “significant disruption” to their services. Such incidents are particularly difficult to counter because the cybercriminals adjust their tactics and specific targets during the attack. External experts and law enforcement cyberspecialists are contributing to the investigation, which is still in early stages. However, HSE representatives presume the main target was data stored on the organization’s servers. Representatives of Rotunda Hospital, a medical institution affected by the attack, say the unified HSE patient registering system may have been a spreading vector. Fortunately, the attack did not affect life-saving equipment; only healthcare records are unavailable. Who is behind the attack, and what do they want? According to Bleeping Computer , the operators of Conti ransomware contacted HSE representatives and demanded almost $20 million in ransom. The crooks claimed that they had been present in HSE’s network for more than two weeks before encrypting any data, that they’d downloaded approximately 700GB of unencrypted files — including personal data, contracts, and financial documents — and that they’d publish the information if their terms weren’t met. Conti ransom demand. Source: Bleeping Computer. Ireland’s prime minister refused to pay that ransom, a decision we fully support . How to protect healthcare from ransomware Ransomware threats to healthcare institutions around the world are on the rise . To minimize infection risk, we recommend prioritizing the protection of remote access tools and e-mail systems, the two most common entry points for ransomware . In addition, security awareness is more than just important. In particular, we recommend: Raising employee awareness about modern cyberthreats and the role all staff play in cybersecurity; Avoiding remote connections to internal networks to the extent possible; Maintaining a strict password policy requiring all passwords be unique, complex, and secure; Installing security patches and updates promptly; Using robust security solutions on all devices with access to the Internet, including medical equipment and information kiosks and panels ; Protecting corporate mail servers , through which a fair number of threats enter company infrastructure. Additionally, Endpoint Detection and Response –class solutions can help detect ransomware threats in their early stages, simplifying response actions and investigation."}}
{"https://www.kaspersky.co.in/blog/how-to-protect-from-smishing/22783/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-04-23", "source": "www.kaspersky.co.in"}, "text": "With smishing all the rage, media in the United States , Italy , and Brazil have been cranking out alarming stories about new scams. The German police even issued an official warning about one such campaign. The phenomenon has raked in massive sums, as evidenced by its search popularity. So, what is smishing? Rise in search popularity of “smishing” on Google in the past few years What is smishing, and how does it work? Smishing is phishing spread through text (SMS) messages rather than by e-mail; hence the term: smishing = SMS + phishing. Some classifications include phishing over messaging apps as part of smishing, but we consider that a separate category and won’t be discussing it here. The goal, as with any other phishing attempt, is to trick recipients into divulging sensitive information, typically their online banking password or bank card information. To do that, scammers send text messages, generally about an invented problem — a delivery issue, unpaid bill, or blocked account, for example — that the recipient has to resolve by clicking on a link. After that, things can go one of two ways: Scenario 1 infects the victim with malware disguised as a legitimate application but whose actual purpose is to request important information; Scenario 2 takes the victim to a Web page disguised as a legitimate website but whose actual purpose is to request important information. The choice of scenario really depends on the scammer’s comfort zone — malware or fake websites. The victim’s outcome is the same either way. Similar scams have resulted in the theft of thousands of dollars , euros , and pounds . Why has SMS phishing become so popular recently, and what makes it more dangerous than typical phishing? What makes smishing more dangerous than typical phishing Most of us have more or less gotten used to e-mail phishing, and people by and large know how to recognize and avoid it. Text messages are a more unexpected channel for scams, so people are less likely to think a short message will represent a scam. Beyond that, although people trust text messages more, texts tend to be less secure than e-mail. Nowadays, every halfway decent e-mail service has an intelligent built-in spam filter. The filters aren’t perfect, but scammers need to keep inventing new moves to get past them. Unfortunately, when it comes to flexibility and accuracy, mobile operators’ spam filters leave something to be desired. People also typically read their text messages on the go or between other tasks. That, combined with a lowered expectation of danger in text messages, means they tend to look less closely at text messages, making an attack more likely to succeed. In other words, when people get a message, they’re likely to disregard their mental checklist of warning signs and just click through. Finally, SMS messages display fewer signs that would help you recognize a scam. When you get an e-mail, you can look at the sender’s address, assess design and layout, and consider how plausible the message is overall — in short, you can look for standard red flags. With texts, even legitimate messages look a lot like one another, with short messages often employing nonstandard language and no design to speak of; and scammers with the technical skills can realistically spoof the sender’s info, replacing the sender’s real number with a fake one. How to protect yourself from smishing As with traditional phishing, you have strong defenses against smishing. Do not click on links or share any of your information in a text thread. As a general rule, the less activity, the better; Use two-factor authentication wherever you have the option. That way, even having a stolen password won’t help criminals raid your account. Contact your bank immediately if you suspect criminals have gotten access to your account. The bank can freeze your card, change your passwords, and advise you about further steps. We’ll close with a few FAQs to clear up any lingering questions. Should I respond to fraudulent messages, just to have them remove me from their mailing list? Do not do that. Responding simply confirms that your phone number is active. Unsubscribing can be hard even with legitimate companies; don’t expect a fair deal from people breaking the law. What if it’s not smishing but an important message from my bank? If you have any doubts, contact your bank directly. It’s unlikely they sent that message, but speaking of contacting the bank, make sure to get that phone number from an official source, such as its website. Whatever you do, don’t use any contact details from the suspicious text. Is there a way to automatically filter out phishing through SMS messages? Of course there is! Many security solutions have long used built-in filters to catch suspicious links in text messages and messaging apps, warn you about them, and make sure you don’t lose money just because you let your guard down for a moment. For example, you’ll benefit from such filters in Kaspersky Internet Security for Android ."}}
{"https://www.kaspersky.co.in/blog/top5-ransomware-groups/22771/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-04-21", "source": "www.kaspersky.co.in"}, "text": "Over the past five years, ransomware has evolved from being a threat to individual computers to posing a serious danger to corporate networks. Cybercriminals have stopped simply trying to infect as many computers as possible and are now targeting big victims instead. Attacks on commercial organizations and government agencies require careful planning but can potentially lead to rewards in the tens of millions of dollars. Ransomware gangs exploit companies’ financial clout, which tends to be far greater than that of ordinary users. What’s more, many modern ransomware groups steal data prior to encryption, adding the threat of publication as further leverage. For the affected company, that adds all kinds of risks, from reputational damage to problems with shareholders to fines from regulators, which often add up to more than the ransom. According to our data, 2016 was a watershed year. In just a few months, the number of ransomware cyberattacks on organizations tripled : Whereas in January 2016 we recorded one incident every 2 minutes on average, by late September the interval had shrunk to 40 seconds. Since 2019, experts have regularly observed targeted campaigns from a series of so-called big-game-hunting ransomware. The malware operators’ own sites show attack statistics. We used this data to compile a ranking of the most active cybercriminal groups. 1. Maze (aka ChaCha ransomware) Maze ransomware, first spotted in 2019 , quickly rose to the top of its malware class. Of the total number of victims, this ransomware accounted for more than a third of attacks. The group behind Maze was one of the first to steal data before encryption . If the victim refused to pay the ransom, the cybercriminals threatened to publish the stolen files. The technique proved effective and was later adopted by many other ransomware operations, including REvil and DoppelPaymer, which we discuss below. In another innovation, the cybercriminals began reporting their attacks to the media. In late 2019, the Maze group told Bleeping Computer about its hack of the company Allied Universal , attaching a few of the stolen files as evidence. In its e-mail conversations with the website’s editors, the group threatened to send spam from Allied Universal’s servers, and it later published the hacked company’s confidential data on the Bleeping Computer forum. The Maze attacks continued until September 2020, when the group began winding down its operations , although not before several international corporations, a state bank in Latin America, and a US city’s information system had already suffered from its activities. In each of those cases, Maze operators demanded several million dollars from the victims. 2. Conti (aka IOCP ransomware) Conti appeared in late 2019 and was very active throughout 2020, accounting for more than 13% of all ransomware victims during this period. Its creators remain active. An interesting detail about Conti attacks is that the cybercriminals offer the target company help with security in exchange for agreeing to pay, saying “You will get instructions how to close the hole in security and how to avoid such problems in the future + we will recommend you special software that makes the most problems to hackers.” As with Maze, the ransomware not only encrypts, but also sends copies of files from hacked systems to ransomware operators. The cybercriminals then threaten to publish the information online if the victim fails to comply with their demands. Among the most high-profile Conti attacks was the hack of a school in the United States , followed by a $40 million ransom demand. (The administration said it had been ready to pay $500,000 but would not negotiate 80 times that amount.) 3. REvil (aka Sodin, Sodinokibi ransomware) The first attacks by REvil ransomware were detected in early 2019 in Asia. The malware quickly attracted the attention of experts for its technical prowess, such as its use of legitimate CPU functions to bypass security systems. In addition, its code contained characteristic signs of having been created for lease. In the total statistics, REvil victims make up 11%. The malware affected almost 20 business sectors. The largest share of victims falls to Engineering & Manufacturing (30%), followed by Finance (14%), Professional & Consumer Services (9%), Legal (7%), and IT & Telecommunications (7%). The latter category accounted for one of the most high-profile ransomware attacks of 2019, when cybercriminals hacked several MSPs and distributed Sodinokibi among their customers. The group currently holds the record for the largest ever known ransom demand : $50 million from Acer in March 2021. 4. Netwalker (aka Mailto ransomware) Of the total number of victims, Netwalker accounted for more than 10%. Among its targets are logistics giants, industrial groups, energy corporations, and other large organizations. In the space of just a few months in 2020, the cybercriminals hauled in more than $25 million . Its creators seem determined to bring ransomware to the masses . They offered to lease Netwalker to lone scammers in exchange for a slice of attack profits. According to Bleeping Computer, the malware distributor’s share could reach 70% of the ransom, although such schemes typically pay affiliates much less. As evidence of their intent, the cybercriminals published screenshots of large money transfers. To make the leasing process as easy as possible, they set up a website to automatically publish the stolen data after the ransom deadline. In January 2021, police seized Netwalker dark web resources and charged Canadian citizen Sebastien Vachon-Desjardins with obtaining more than $27.6 million from the extortion activity. Vachon-Desjardins was in charge of finding victims, breaching them, and deploying Netwalker on their systems. The law-enforcement operation effectively killed off Netwalker. 5. DoppelPaymer ransomware The last villain of our roundup is DoppelPaymer, ransomware whose victims make up about 9% in the total statistics. Its creators made a mark with other malware too, including the Dridex banking Trojan and the now-defunct BitPaymer (aka FriedEx) ransomware, which is considered an earlier version of DopplePaymer . So the total number of victims of this group is in fact much higher. Commercial organizations hit by DoppelPaymer include electronics and automobile manufacturers, as well as a large Latin American oil company. DoppelPaymer frequently targets government organizations worldwide , including healthcare, emergency, and education services. The group also made headlines after publishing voter information stolen from Hall County, Georgia, and receiving $500,000 from Delaware County, Pennsylvania, both in the United States. DoppelPaymer attacks continue to this day: In February of this year, a European research body announced that it had been hacked. Targeted attack methods Every targeted attack on a large company is the result of a long process of finding vulnerabilities in the infrastructure, devising a scenario, and selecting tools. Then the penetration occurs, spreading malware throughout the corporate infrastructure. Cybercriminals sometimes remain inside a corporate network for several months before encrypting files and issuing a demand. The main paths into the infrastructure are through: Poorly secured remote access connections. Vulnerable RDP (Remote Desktop Protocol) connections are such a common means of delivering malware that groups on the black market offer services to exploit them. When much of the world switched to remote work, the number of such attacks skyrocketed. This is the modus operandi of the Ryuk, REvil, and other ransomware campaigns; Server application vulnerabilities. Attacks on server-side software give cybercriminals access to the most sensitive of data. A recent example came in March, when ransomware DearCry attacked through a zero-day vulnerability in Microsoft Exchange. Insufficiently protected server-side software can serve as an entry point for a targeted attack. Security issues also crop up in enterprise VPN servers, some examples of which we saw last year; Botnet-based delivery. To ensnare even more victims and increase profits, ransomware operators use botnets . Zombie network operators provide other cybercriminals with access to thousands of compromised devices, which automatically look for vulnerable systems and download ransomware onto them. That is how, for example, the Conti and DoppelPaymer ransomware spread; Supply-chain attacks. The REvil campaign best highlights this threat vector: the group compromised an MSP provider and then distributed ransomware to its customers’ networks; Malicious attachments. E-mails containing malicious macros in attached Word documents are still a popular option for malware delivery. One of our Top 5 villains, NetWalker, used malicious attachments to ensnare victims — its operators sent out mailings with “COVID-19” in the subject line. How business can stay protected Train employees in digital hygiene . Employees should know what phishing is, never to follow links in suspicious e-mails or download files from dubious sites, and how to create, remember, and safeguard strong passwords. Conduct regular training in information security not only to minimize incident risk, but also to mitigate damage in the event that attackers still manage to penetrate the network; Regularly update all operating systems and applications to ensure maximum protection against attacks through known software vulnerabilities. Take care of updating both client-side and server-side software; Perform security audits, check equipment security , and keep track of which ports are open and accessible from the Internet. Use a secure connection for remote work, but remember that even VPNs can be vulnerable; Create backups of corporate data. Having backups helps not only to reduce downtime and restore business processes faster in the event of a ransomware attack, but also to recover from more humdrum events such as hardware malfunctions; Use a professional security solution that employs behavioral analysis and antiransomware technologies; Deploy information security system that is able to recognize anomalies in the network infrastructure, such as attempts to probe ports or requests to access non-standard systems. Engage outside expertise if you don’t have in-house specialists capable of monitoring the network."}}
{"https://www.kaspersky.co.in/blog/cryptoscam-fake-antminer/22741/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-04-19", "source": "www.kaspersky.co.in"}, "text": "Rising cryptocurrency prices have led to an increase in demand for mining equipment, but COVID-19 restrictions have led to a drop in supply. As a result, the world is witnessing another shortage of powerful video cards and cryptomining equipment , with months-long wait times for new deliveries. Cybercriminals, as always, are looking to capitalize on the crisis. For example, fraudsters have been extracting cryptocurrency from buyers using a popular Google service and a clone of a mining equipment manufacturer’s website. How the scam works Scammers and spammers have long relied on Google services (Forms, Sheets, Calendar, Photos and others) for their ability to send automatic notifications to anyone the author of a file (or a calendar entry, etc.) shares it with or mentions in it. The e-mails come not from the actual author, but from no less an authority than Google, so spam filters typically let them through. In this case, potential cryptocurrency miners are receiving e-mails saying they have been mentioned in a Google Docs file by a user with the nickname BitmainTech (the name of a real manufacturer of mining rigs). The respectable name — @docs[.]google[.]com — in the From field helps lower the recipient’s guard. The displayed username is whatever the sender wants it to be, and the sender’s real e-mail address remains hidden. The e-mail reads: “BitmainTech mentioned you in a document” Bait follows in the form of an announcement of a sale on Antminer S19j mining machines. Posing as the Bitmain sales department, the scammers report that the equipment is available to be ordered, but time’s running out; stock is limited and delivery is on a first-come-first-served basis. The text is replete with trust-inspiring facts and figures. Fake Bitmain sales team uses Google Docs to tell victim about Antminer S19j availability The same text appears in the Google Docs file, only with an active link that leads, through a chain of redirects, to bitmain[.]sa[.]com, a clone of the official bitmain[.]com website (note the differences in the address). A WHOIS check reveals that the domain of the fake site was registered in March 2021. For extra credibility, the cybercriminals use the HTTPS protocol. Readers of this blog already know HTTPS protects data from interception as it travels from user to site but does not guarantee a site is bona fide. If the destination site is malicious, using a secure protocol just means the data will travel securely to the cybercriminals. Fake Bitmain site with Antminer S19j ad On the real Bitmain website, at the time of posting, the Buy button was inactive because the last Antminer S19j batch had already been snapped up; the site does not expect new deliveries to occur before October. But on the fake resource, the coveted mining machine slides right into the shopping cart, and for the same price as the real one, $5,017. The fake website lets you add the mining machine to your shopping cart To proceed to checkout, the victim has to sign in or register. There are two possible reasons to implement this requirement: for greater authenticity or to build a database of addresses and passwords for account hacking purposes. Despite registering (using a disposable e-mail address, of course), we never received a registration confirmation message. Fake Bitmain authorization page In any event, the system allows the user to sign in and finalize the order. The login procedure looks quite convincing. The Antminer S19j is in the cart! Or is it? At the next stage, the victim is asked to provide a delivery address. Perhaps the scammers are collecting this data for sale as well. A warning that the manufacturer cannot ship to mainland China if the order is placed on the English-language site Most cryptomining rig manufacturers, including Bitmain, are located in China. Moving heavy and expensive equipment from there is not cheap, yet the cybercriminals charge roughly five dollars for shipping, regardless of destination and service (UPS, DHL, or FedEx). Choosing a delivery service. The shipping cost is $5.45 no matter where the shipment is headed Next, the victim is asked to choose a payment method. They must use cryptocurrency but can choose BTC, BCH, ETH, or LTC. Selecting a payment method: Bitcoin, Ethereum, Bitcoin Cash, or Litecoin The final and most important step is making the payment. The cybercriminals provide cryptowallet details and warn that the transaction must be completed within two hours, otherwise the order will be canceled. Note that the cost of delivery, though minuscule, does not appear in the bill. The total order price does not include shipping After the victim has parted with a considerable amount of cryptocurrency, the air of legitimacy evaporates. The user’s personal account contains no order data, and the buttons are inactive. The inglorious finale How to stay safe from scams To avoid being duped, stay vigilant so as not to fall for hype. Stay wary, and pay particular attention if someone tries to hurry you into making a payment. In this case, the appearance of a scarce product for sale is no different than receiving news of a sudden lottery win (doubly suspicious if you didn’t even buy a ticket). Check the official website. If you receive an offer from a well-known brand, find the official website and look there for information about the promotion. Always examine the address bar. Use an advanced security product with protection against phishing and online fraud, such as Kaspersky Internet Security ."}}
{"https://www.kaspersky.co.in/blog/cve-2021-28310/22719/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-04-14", "source": "www.kaspersky.co.in"}, "text": "Kaspersky researchers have found a zero-day vulnerability (CVE-2021-28310) in a Microsoft Windows component called Desktop Window Manager (DWM). We believe several threat actors have already exploited the vulnerability. Microsoft just released the patch, and we suggest applying it immediately. Here’s why. What is Desktop Window Manager? Pretty much everyone is familiar with the windowed interface of modern operating systems:  each program opening in a separate window that doesn’t necessarily take up the whole screen. Windows may overlap, for example, one casting a shadow over others as if it were physically blocking the light. In Microsoft Windows, the component responsible for rendering features such as shadows and transparency is Desktop Window Manager. To understand why Desktop Window Manager is important in a cybersecurity context, consider that programs don’t just draw their windows on the screen; they put the necessary information in a buffer. Desktop Window Manager grabs that information from each program’s buffer and creates the overall composite view that the user sees. When a user moves one window over another, the open programs don’t know anything about whether their windows should be casting a shadow or having a shadow cast on them, for example. Desktop Window Manager does that job, and as such it is a key service in Windows that has existed in every version of Windows since Vista — and cannot be deactivated in Windows 8 or later versions. Desktop Window Manager’s vulnerability The vulnerability our advanced exploit prevention technology discovered is an elevation of privilege vulnerability. That means a program can trick Desktop Window Manager into giving it access that it shouldn’t have. In this case, the vulnerability allowed the attackers to execute arbitrary code on victims’ machines — it essentially gave them full control over the computers. How to avoid CVE-2021-28310 exploitation It’s critical to act quickly. Here’s what you can do: Install the patches Microsoft released on April 13 , immediately and on all vulnerable computers; Protect all of your devices with a robust security solution such as Kaspersky Endpoint Security for Business , whose advanced exploit prevention component blocks attempts to exploit CVE-2021-28310."}}
{"https://www.kaspersky.co.in/blog/cryptoscam-in-lightshot/22713/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-04-12", "source": "www.kaspersky.co.in"}, "text": "Cryptocurrency scams seem to be gaining momentum by the day. Hard on the heels of scammers tricking Discord users by offering nonexistent coins on fake exchanges , inventing stories about lucky winners on fake news sites , and simulating helicopter money , a new scheme is exploiting Lightshot’s screen-sharing tool to get money from overly curious cryptoinvestors. Convenient doesn’t mean safe Lightshot is a tool for creating, customizing, and quickly sending screenshots. It consists of an app for Windows, macOS, or Ubuntu and the prnt.sc cloud portal and lets users share screenshots quickly and easily: One click or shortcut sends an image to the cloud and returns an URL for sharing. Anyone can see published screenshots without authentication ; you don’t even need a Lightshot account. That makes the service fast and convenient but not very secure. Moreover, to view a screenshot, you don’t even need the exact link; the URLs are sequential, so if you replace a character in one of them with the next in order, for example, another image will open. The process can even be automated. A simple script for brute-forcing URLs and downloading content from them takes just a few minutes to write. Such openness is not a bug; the service warns users that every uploaded image is public . However, given that leaks of valuable information through Lightshot regularly make the news , clearly not everyone reads the fine print. How to leak data in Lightshot So what if screenshots enter the public domain? Who cares about sharing gaming records or jokes from work messages? Think creatively: Lightshot users can dox themselves in any of at least three very plausible ways. Take, for example, an employee who snaps a screenshot of an interface to get help with setting up a new program. Sounds fine. Now, what if a confidential document is open, partially hidden under the application window? Or if someone shares a hilariously stupid work e-mail with a trusted friend, just for a laugh? Or someone shows off an intimate chat but forgets to blur names and addresses? Made public in Lightshot, those screenshots could spell serious trouble. Online troublemakers hunt for revealing photos for fun; trolls can use them for harassment; and cybercriminals can use the threat of exposure to extort money from victims. A trap for busybodies At the same time, even those who keep valuable data private and always check screenshots for unwanted extras may find the service still has a few pitfalls. For example, on any given day the Lightshot portal might contain screenshots with details for accessing a cryptocurrency wallet. Sometimes, the screenshots appear to suggest the account was shared deliberately. Some display requests for help. Some are bizarre and unrelated — we even saw a suicide note. Screenshots of correspondence showing credentials for fake cryptocurrency accounts In other cases it looks like the “credentials” got on Lightshot as if by accident or carelessness. For example, we saw screenshots that appeared to be password recovery e-mails for cryptocurrency wallets. Fake password reset e-mails for equally fake cryptocurrency accounts If a user goes to the URL in the screenshot in pursuit of easy pickings, they will find themselves on a website posing as a cryptocurrency exchange. Entering the credentials gets them into a fake account that appears to hold an impressive amount of cryptocurrency, say, 0.8 BTC (more than $45,000 at the time of posting). And from inside the account, the victim can try to withdraw the funds and transfer them to their own account. In that case, the exchange asks for a small commission. It’s mere peanuts compared with the full sum, but it’s fake and will do nothing but line the scammers’ pockets. And, of course, “peanuts” is relative: A commission of 0.001–0.0015 BTC, for example, at current bitcoin rates, comes to approximately $60–$90. All in all, the scheme seems to work well, and it does have a certain elegance. At the time of posting, about 0.1 BTC (roughly $6,000) had been transferred to the “commissions” wallet. How to save your money and secure your data Convenience does not mean security or privacy — often quite the opposite. Lightshot is a prime example. Here are a few tips for working safely with screenshots: Before installing Lightshot, consider whether you really want to share screenshots by making them public; If you decide to go ahead, remember that confidential information — banking details, passwords, other personal information — is the bread and butter of cybercriminals. Use secure channels to share it, not Lightshot, or better still, don’t share it at all; If you’ve already used Lightshot and now regret sharing something, get the URL by searching your messages, go there, and click Report abuse ; or send a request to support@skillbrains.com ; Use your operating system’s built-in tools and shortcuts for creating screenshots. In Windows, use the Snipping Tool or the Print Screen button; Mac users can press Cmd-Shift-3 to save a full-screen capture or Cmd-Shift-4 to select an area to screenshot. To be clear, we do not recommend logging in to others’ accounts, even just out of curiosity. And to avoid accidentally giving your login credentials to phishers, use a reliable security solution that will alert you if you stray onto a suspicious website."}}
{"https://www.kaspersky.co.in/blog/infected-apkpure/22710/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-04-09", "source": "www.kaspersky.co.in"}, "text": "We always recommend downloading apps from official stores only , to reduce the likelihood of installing malware. However, unofficial stores not only host malicious apps, but they might not be safe at all. Following a recent investigation, we are sorry to report that APKPure, a popular alternative source of Android apps, was Trojanized and has been distributing other Trojans. What is APKPure for? The most official of all Android app stores is, of course, Google Play. But it is available only on devices that use Google Mobile Services (GMS) and are firmly tied to Google’s infrastructure. Some vendors avoid GMS libraries to stay independent, and because Android is an open operating system, they can. For users, there are both advantages and disadvantages. One prominent disadvantage is a loss of access to Google’s app store, where Android users can download the usual apps. That’s where alternative stores come in, and APKPure is one of them. Distinctively, it hosts only free or shareware apps. Also, the owners stress that the apps in their store have all been scanned by Google and are completely safe; they say their apps are exactly the same as the ones on Google Play. What happened with APKPure? The apps in the store may have passed all tests, but the APKPure app hasn’t. This incident smacks strongly of the CamScanner episode , in which the app’s developers implemented an advertisement SDK from an unverified source and it turned out to be malicious. That’s also how malware got into APKPure. Looks like APKPure version 3.17.18 was likewise fitted with an advertisement SDK, one with an embedded Trojan dropper , which Kaspersky solutions detect as HEUR:Trojan-Dropper.AndroidOS.Triada.ap. When launched, it unpacks and runs its payload , which is the dangerous part. This component can do several things: show ads on the lock screen; open browser tabs; collect information about the device; and, most unpleasant of all, download other malware. What can happen to a device with APKPure installed? Which Trojan gets downloaded (in addition to APKPure’s built-in one) depends on the Android version, as well as on how regularly the smartphone vendor released — and the user installed — security updates. If the user has a relatively recent version of the operating system, meaning Android 8 or higher, which doesn’t hand out root permissions willy-nilly, then it loads additional modules for the Triada Trojan . These modules, among other things, can buy premium subscriptions and download other malware. If the device is older, running Android 6 or 7, and without security updates installed (or in some cases not even released by the vendor), and thus more easily rootable, it could be the xHelper Trojan . Removing this beast is a real challenge; even a factory reset won’t do it. Armed with root access, xHelper lets attackers do almost anything they want on the device. Is APKPure safe now? On April 8, we informed APKPure about the issue. On April 9, APKPure representatives replied that they saw the problem and were working on the fix. Shortly after that, a new version (3.17.19) appeared on the APKPure website. According to its description , the update “Fixed a potential security problem, making APKPure safer to use.” We can confirm that the problem has indeed been fixed: APKPure 3.17.19 doesn’t contain the malicious component. It is safe to use. How to guard against Trojanized APKPure If you don’t use APKPure, then don’t worry — today’s problem does not concern you. But to avoid similar issues in the future: Never download apps from unofficial sources, and block the installation of apps from third-party sources in Android’s settings; Use a reliable security solution that automatically scans all new files; Regularly update all apps and the operating system. If you do use APKPure, we additionally recommend that you: Update the APKPure app to the version in which the issue is fixed (that is, 3.17.19 or newer); Run a full antivirus scan of the device."}}
{"https://www.kaspersky.co.in/blog/history-of-ransomware/22700/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-04-07", "source": "www.kaspersky.co.in"}, "text": "If you follow information security, you have probably heard a lot about ransomware in recent years. You may even have had the misfortune of being on the receiving end of an attack. It is perhaps no exaggeration to describe ransomware as the most dangerous malware of our time. But did you know that such malicious programs have been around for more than 30 years, and that researchers predicted many features of modern-day attacks back in the mid-1990s? Do you want to know why cryptors replaced blockers, what the largest ransom in history was, and what AIDS has to do with it all? Then read on, for we have compiled a history of ransomware with the answers to these and many more questions. Together, let’s trace the development of blockers, cryptors, wipers, and other ransomware nasties over the past few decades. Ransomware dictionary The following terms appear frequently in the text. Cryptography — the science of preventing outsiders from reading confidential information. Encryption is one aspect of cryptography. Symmetric encryption — a data encryption method in which one key is used both to encrypt and to decrypt the information. Asymmetric encryption — a data encryption method that involves the use of two keys: one public to encrypt the information, and one private to decrypt it. Knowing the public key does not help with decryption; that requires the private key. RSA — a commonly used asymmetric encryption algorithm. Ransomware — any malicious program that forces the victim to pay a ransom to the attacker. Ransomware includes blockers , cryptors , and wipers disguised as cryptors. Blocker — a type of ransomware that blocks or simulates the blocking of a computer or mobile device. Such malware typically shows a persistent message with a payment demand on top of all other windows. Cryptomalware (cryptor) — a type of ransomware that encrypts user files so they cannot be used. Wiper — a type of malware designed to wipe (erase) data on the victim’s device. Sometimes ransomware simulating a cryptor actually turns out to be a wiper, damaging files irreparably; so even if the ransom is paid, it is still impossible to recover the data. RaaS (Ransomware-as-a-Service) — a criminal scheme whereby creators lease ransomware to anyone who wants to distribute it for a cut of the proceeds. It is a kind of cybercriminal franchise. 1989: The first ransomware attack Dr. Joseph L. Popp, a biological researcher, created the first known cryptor. Popp took advantage of widespread interest in AIDS; hence his malware became known as the AIDS Trojan. In those days, the Internet was still in its infancy, so Popp used a highly original (by modern standards) delivery method. Having gotten mailing lists of subscribers to the WHO AIDS conference and PC Business World magazine, he sent victims a floppy disk with a sticker reading “AIDS Information Introductory Diskette” along with detailed instructions for installing the program. License agreement said that by installing the program, the user agreed to pay the company $378. But who takes things like that seriously? In fact, the installer served to deliver the malware to the hard drive. After a certain number of system boots, the AIDS Trojan became active, encrypting file names (including extensions) on the C: drive of the infected computer. The names turned into a jumble of random characters, making it impossible to work normally with the files. For example, to open or run a file, it was first necessary to work out what extension it should have and to change it manually. At the same time, the malware displayed a message on the screen, saying that the software trial was over and the user must pay a subscription fee: $189 for one year or $378 for lifetime access. The money was to be transferred to an account in Panama. The malware used symmetric encryption, so the key to recover the files was contained right in the code. Therefore, the problem was relatively easy to solve: Retrieve the key, delete the malware, and use the key to recover the file names. By January 1990, Virus Bulletin editorial advisor Jim Bates had created the AIDSOUT and CLEARAID programs to do just that. Joseph Popp was arrested, but the court found him mentally unfit to stand trial. He did, however, publish the book Popular Evolution: Life-Lessons from Anthropology a decade later. 1995–2004: Young, Yung, and the ransomware of the future Perhaps because the AIDS Trojan failed to enrich its creator, the idea of encrypting data for purposes of ransom did not generate much enthusiasm among scammers of the day. Interest in it returned only in 1995, and in the scientific community. Cryptographers Adam L. Young and Moti Yung set out to learn what the most powerful computer virus would look like. They came up with the concept of ransomware that uses asymmetric encryption. Instead of using one key, which would have to be added to the program code, to encrypt the files, their model used two, public and private, which kept the decryption key secret. What is more, Young and Yung hypothesized that the victim would have to pay using electronic money, which did not yet exist. The cybersecurity prophets presented their thoughts at the IEEE Security and Privacy conference in 1996, but they were not well received. Then, 2004 saw the publication of Malicious Cryptography: Exposing Cryptovirology , in which Young and Yung systematized the results of their research. 2007–2010: The golden years of blockers While cryptomalware was biding its time, the world saw the rise of another kind of ransomware: blockers. This rather primitive sort of malware interfered with the normal functioning of the operating system by adding itself to Windows’ startup routine. In addition, to foil deletion, many types blocked the registry editor and task manager. This kind of malware used diverse ways to keep victims from using their computers, ranging from a window that wouldn’t close to a change of desktop wallpaper. One method of payment was by text to a premium number . Neutralizing ransomware blockers usually did not require an antivirus program, but rather a fair bit of know-how on the part of the user. To remove the malware manually, it was necessary, for example, to boot the system from a Live or rescue CD, start in safe mode, or log in to Windows under a different profile. However, the ease of writing such Trojans offset the relatively low risk. Practically anyone could distribute them. There were even automatic generators. Sometimes, the malware placed a pornographic banner on the desktop and alleged the victim had viewed prohibited content (a tactic still used today). With the ransom demand being manageable, many preferred not to seek help, but simply to pay. 2010: Cryptomalware with asymmetric encryption In 2011, cryptomalware developers stepped up their game considerably and, as Yung and Young predicted, began using asymmetric encryption. A modification of the GpCode cryptor, for example, was based on the RSA algorithm . 2013: CryptoLocker hybrid ransomware Late 2013 marked the appearance of hybrid ransomware combining a blocker with cryptomalware. The concept increased cybercriminals’ chances of receiving payment, because even removing the malware, and thus removing the block, did not restore victims’ access to their files. Perhaps the most notorious of these hybrids is CryptoLocker . This malware was distributed in spam e-mails, and the cybercriminals behind it accepted ransom payment in Bitcoin. 2015: Cryptors replace blockers In 2015, Kaspersky observed a snowballing number of cryptomalware infection attempts, with the number of attacks growing by a factor of 5.5. Cryptors started to squeeze out blockers . Cryptors prevailed for several reasons. First, user data is significantly more valuable than system files and applications, which can always be reinstalled. With encryption, cybercriminals could demand significantly higher ransoms — and had a better chance of getting paid. Second, by 2015, cryptocurrencies were widely used for anonymous money transfers, so the attackers were no longer afraid of being traced. Bitcoin and others made it possible to receive large ransoms without lighting up on the radar. 2016: Mass ransomware Ransomware continued to grow as a force in cybersecurity, and 2016 saw an elevenfold increase in the number of ransomware modifications , with the average ransom ranging from 0.5 to hundreds of bitcoins (which were worth a fraction of today’s price). The main focus of attacks switched from the individual user to the corporate sector, justifiably prompting talk of the emergence of a new criminal industry. Cybercriminals no longer had to develop malware by themselves; they could just buy it off the shelf. For example, a “lifetime license” for Stampado ransomware went on sale. The malware threatened to delete random files after a certain period of time to scare victims into paying the ransom. Ransomware also became available under the RaaS (Ransomware-as-a-Service) model, a term that emerged with the appearance of Encryptor RaaS . The model helped ransomware spread even more widely. Extortionists began targeting government and municipal organizations in addition to businesses and home users. The HDDCryptor, which infected more than 2,000 San Francisco Municipal Transportation Agency computers, serves as a prime example. The cybercriminals demanded 100 BTC (then about $70,000) to restore the systems, but the agency’s IT department managed to solve the problem on its own. 2016–2017: Petya, NotPetya, and WannaCry In April 2016, new malware called Petya reared its head. Whereas previous cryptors had left operating systems intact to allow victims to pay the ransom, Petya completely bricked infected machines; it targeted the MFT (Master File Table) — a database that stores the entire structure of files and folders on the hard drive. As destructive as it was, Petya’s penetration and distribution mechanism was rough. To activate it, the victim had to manually download and run an executable file, which made infection less likely. In fact, it might not have made much of a mark if not for another ransomware — the aptly named WannaCry . In May 2017, WannaCry infected more than 500,000 devices worldwide, causing $4 billion of damage. How did it do that? Вy incorporating the EternalBlue exploit , which took advantage of some very dangerous vulnerabilities in Windows. The Trojan infiltrated networks and installed WannaCry on victims’ computers. The malware then continued, spreading to other devices on the local network. Inside infected systems, WannaCry behaved normally, encrypting files and demanding a ransom. Not two months after the WannaCry outbreak another cryptor appeared, also modified for EternalBlue: NotPetya, also known as ExPetr . NotPetya devoured hard drives whole. Moreover, NotPetya encrypted the file table in such a way as to rule out decryption even after ransom payment. As a result, experts concluded that it was actually a wiper disguised as a cryptor. The total damage from NotPetya exceeded $10 billion . The WannaCry attack was so devastating that Microsoft released an urgent patch for operating systems it no longer supported. Updates for supported systems had been available long before both epidemics, but not everyone had installed them, allowing these two ransomware programs to make their presence felt for a long time to come. 2017: A million bucks for decryption In addition to the unprecedented damages, another record was set in 2017, for the biggest known ransom of a single organization. South Korean Web host Nayana agreed to pay $1 million (negotiated down from 4.5 times that much) to unblock computers infected with the Erebus cryptor. What surprised the expert community most was that the company publicly announced the payment. Most victims prefer not to advertise such things. 2018–2019: A threat to society The past few years are notable for massive ransomware attacks on utilities and community facilities. Transportation, water, energy, and healthcare institutions found themselves increasingly at risk . Cybercriminals counted on them paying up, too; even with very large ransom requests, going dark would mean leaving thousands or millions of people in the lurch. In 2018, for example, a cryptomalware attack on Bristol Airport in the UK disrupted flight display screens for two whole days. Staff resorted to using whiteboards, and to the airport’s credit, its response to the attack was quick and effective. As far as we know, no flights were cancelled and no ransom was paid. Hancock Health, a US clinic, fared less well, paying 4 BTC (then $55,000) after SamSam ransomware struck its systems. Explaining the company’s decision to pay the ransom , CEO Steve Long cited an approaching snowstorm, coupled with one of the worst flu seasons in memory. The clinic just did not have the time to restore its computers independently. In all, more than 170 municipal agencies in the United States fell victim to ransomware in 2019 , with ransom demands reaching as high as $5 million. Updating operating systems in such organizations can be difficult, so cybercriminals often used old — and therefore more accessible — exploits. 2020: Rising scale and data leak extortion In addition to the rising scale of infection , as well as the consequences and ransom amounts, 2020 is memorable for a new hybrid approach that saw ransomware, before encrypting data, sending it to the cybercriminal operators. Threats to leak the information to competitors or to publish it followed. Given hypersensitivity about personal data these days, that could be fatal for a business. The tactic was first mastered by the Maze group back in 2019, but in 2020 it became a genuine trend. The Transform Hospital Group cosmetic surgery chain was the victim of one of the most high-profile incidents of 2020. The REvil hacker group encrypted and stole 900GB of Transform’s data , including pre- and post-operation photographs of patients, which the attackers threatened to publish. In addition, cryptomalware operators adopted a range of new tactics in 2020. For example, the REvil group started auctioning off stolen information. Cybercriminals have also united into cartel-type organizations. The first was the Maze group, which began posting information stolen by the LockBit cryptor. According to the cybercriminals , they are now working closely with LockBit, providing their platform for data leakage as well as sharing their knowledge. They also boasted that another notable group would soon be joining the cartel: RagnarLocker, a trailblazer in organizing DDoS attacks on victims’ resources as an additional lever of pressure on companies it extorts. Conclusion In a span of three decades, ransomware has evolved from a relatively harmless toy into a serious threat to users of all platforms, and especially to businesses. To guard against attacks, be sure to observe a few security rules — and if somehow, a hack succeeds, it is important to seek help from experts and not simply do the cybercriminals’ bidding."}}
{"https://www.kaspersky.co.in/blog/apple-m1-malware/22691/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-04-01", "source": "www.kaspersky.co.in"}, "text": "A few months ago, Apple unveiled three series of computers powered by its own M1 chip, designed to replace Intel’s processors. The chips are notable for being based on the ARM architecture instead of the x86 architecture traditionally used in personal computers. In essence, the Apple M1 is a direct relative of the iPhone and iPad processors. If everything goes according to plan, Apple will be able to switch completely to its own processors and unify its software under a single architecture. Leaving aside the current pros and cons performance-wise, we took a look at the innovation from a security perspective. Bad news: Just a few months after the release of the first Apple M1 computers, virus writers had already adapted several malware families to the new processor. What makes Apple M1 malware unique? In terms of malicious functionality, absolutely nothing distinguishes M1 malware from “regular” malware. It can run natively on Mac computers with M1 chips, that’s the difference. Developers recompiled their code and adapted the malware to the new architecture to make it work more efficiently. Essentially, the M1 adaptation drive is just more evidence that virus writers are motivated to keep their creations up to date. Does that mean old malware doesn’t work on computers with the Apple M1? Unfortunately, malware adapted for M1 is an addition, not merely a replacement. Apple uses the Rosetta 2 system to make the transition from one platform to another seamless. Roughly speaking, it translates old program code written for the Intel x86 series into a form that the M1 can digest. Rosetta doesn’t distinguish legitimate programs from malicious ones; it runs x86 malware as readily as any other app. But it is always more convenient to work without an intermediary, which is why some virus writers adapted their handiwork for the Apple M1. Are older computers immune to M1 malware? The new malicious programs for the Apple M1 are not fundamentally new; they’re modifications of old ones. Cybercriminals tend to release the updated versions in a hybrid format, compatible with both platforms. How many varieties of M1 malware are out there? Our researchers have reliably identified four families already adapted for the M1. The first, known as XCSSET, infects Xcode projects and allows attackers to do all kinds of nasty stuff on the victim’s Mac. The second is Silver Sparrow, which recently made a media splash and is spreading far faster than the first. The third and fourth known M1-malware varieties are adware from the Pirrit and Bnodlero families. Hardcore techies can check out our technical breakdown of all four families. How can you guard against M1 malware? Probably the most important advice for Mac users is not to become complacent just because Apple devices are supposedly safer than others, and to adhere to all the usual rules of digital hygiene: Do not follow suspicious links; Do not download suspicious files or apps; Do not install apps from untrusted sources; Use reliable security solutions that detect and neutralize this new breed of malware pests."}}
{"https://www.kaspersky.co.in/blog/cryptoscam-in-discord-fake-dex-airdrop/22665/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-03-25", "source": "www.kaspersky.co.in"}, "text": "Following recent scams involving fake cryptocurrency exchanges and fake news sites , we recently uncovered a third campaign, one using fake DEX exchanges and aimed at cryptocurrency enthusiasts on the Discord messaging app. Here’s how the new scheme works. A word about cryptocurrency exchanges First, what’s a DEX? Two types of cryptocurrency exchanges exist: centralized (CEX) and decentralized (DEX). With a CEX exchange, clients transfer money to the exchange and the funds are moved to a wallet, the private key for which is stored on the platform. Accordingly, exchange operators are also responsible for security. CEX exchanges belong to specific legal entities, and their clients undergo know-your-customer checks to fight money laundering. In general, such sites are convenient and reliable, but some users are put off by the need to transfer funds to the exchange and the possibility of having their account frozen during verification. Unlike CEX platforms, DEX exchanges are essentially just intermediaries between buyers and sellers. Traders can use any wallet and don’t need to transfer private keys. DEX exchanges tend not to be owned by any particular organization, they don’t necessarily verify their clients, and they’re not typically very invested in stopping illegal transactions. The decentralized approach provides greater anonymity. In addition, DEX exchanges often have lower fees, which is perhaps why they have been attracting ever more cryptocurrency traders of late. Decentralization also means more security concerns for users — and on top of the ordinary added risk DEX users accept, cybercriminals recently created a phishing site disguised as a DEX exchange called Uniswap. How DEX clients get duped Potential victims — users of popular Discord cryptocurrency servers — receive phishing messages that appear to come from Uniswap and offer free tokens. The authors pass their scheme off as an airdrop — a giveaway of coins, usually to promote a new cryptocurrency but sometimes for user loyalty or for simple tasks such as reposting on social networks. (Such “gifts” are sometimes called helicopter money .) In their message, the scammers claim that several cryptocurrency services have just launched such a campaign, and the addressee is among the lucky recipients of the drop. The prize is juicy, too: 2.5 Ethereum and 25,000 ZKSwap coins — more than $75,000 at the time of posting. A scam message from a fake exchange about winning helicopter ETH and ZKS If one ignores the unusually generous airdrop, the message looks credible: The language is awkward but not riddled with major errors, the level of emoji use is reasonable, and the list of exchanges includes reputable names. It even includes believable T&Cs for receiving the prize. The brevity of the link to the giveaway might arouse suspicion, but that’s unlikely; many are already accustomed to shortened addresses such as t.co or bit.ly links. The link leads to a page very similar to the Uniswap website — and the fairly well-known exchange actually held a helicopter money promotion for clients not so long ago. The scam website, however, prominently features a button labeled Claim accumulated rewards . A page disguised as Uniswap offers 2.5 ETH Clicking the button takes the victim to a screen requesting the private key or mnemonic phrase for their cryptowallet (in our story, the scammers requested a Metamask wallet). In this case, a mnemonic phrase , or seed phrase, is a sequence of normal human words that restores access to a wallet in the event of a technical failure or a change of device. How not to fall for DEX scams To avoid swallowing the cybercriminal bait, follow these simple rules: Be wary of any offers of free cryptocurrency. Bona fide promotional giveaways tend to be reserved for early investors; Pay attention to the criteria. If a message about a prize or a giveaway contains a condition you have not fulfilled, then even if the promotion is real, you still won’t be eligible; Consult Claimable if you have any doubts. It’s a free service that lets you check whether you can claim a prize and requires only the public key for your cryptowallet, no confidential data; Check on official websites to see if a particular promotion is actually running; Add the websites you use to your bookmarks and visit them from there; do not follow links in messages or e-mails; Read the terms of use of the services, paying attention to which data they might request from you and which they won’t."}}
{"https://www.kaspersky.co.in/blog/pandemic-year-in-infosec/22654/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-03-24", "source": "www.kaspersky.co.in"}, "text": "By March 2020, the COVID-19 outbreak had already reached more than 100 countries and was officially designated a pandemic . The world has now been fighting this unprecedented virus for a whole year. In addition to its obvious effects on individuals’ health and entire countries’ economies, the disease’s spread triggered sudden and radical changes in the daily life of millions of people. Work and study moved to the home, and videoconferencing replaced social and business meetings. The massive shift online has only exacerbated cybersecurity concerns. Cybersecurity threats in the home office The main change in the work process has probably been the forced transition to working from home. Our global survey of April 2020 found that nearly half of the 6,000 respondents had never worked from home before. Despite that, in 73% of cases, employers didn’t conduct any special training on safe interaction with corporate resources over the Internet, which could have reduced the number of incidents caused by the human factor. Corporate IT’s decreased control over devices, software, and user actions led to increased risk. Home equipment Many companies didn’t provide their employees with corporate equipment. Instead, they allowed staff to work and connect to the office IT infrastructure from home devices, which in many cases are poorly protected. According to our survey, 68% of respondents worked at home using their personal computers. In the fall, we conducted another study and found even more people in this position. About 80% of people surveyed used their home computers for work, even though more than half (51%) of respondents were provided with the necessary equipment by their employers. Remote workers also used their personal devices for entertainment, playing online games (31%) and watching movies (34%). However, many also used company laptops and smartphones for unintended purposes. For example, 18% of respondents used them to view adult content. Cybercriminals have actively exploited the increased interest in online entertainment by trying to lure users to fake sites and persuade them to download malware disguised as a movie or an installation file. A total of 61% of users surveyed in the fall admitted that they downloaded software from torrent sites, 65% used such sites for music and 66% for movies. Our telemetry data identified the most popular targets in spring 2020 as Minecraft and the television show Stranger Things . Unsecured channels for remote work In the office, IT administrators take care of securing the Internet channel. But when employees work from home, they set up their own routers and networks, a practice that increases security risks. As such, from March to April 2020, the number of attacks on unsecured RDP ports — the most popular remote connection protocol on computers running Windows — increased tenfold in Russia and by seven times in the United States . Vulnerabilities in collaboration tools In the office, workers could edit documents and attend meetings in person. In the world of remote work, the demand for videoconferencing software and collaboration tools has increased dramatically. The growth in demand has attracted interest from cybercriminals. Security gaps were also discovered in legitimate videoconferencing software. For example, a year ago, a vulnerability was detected and eliminated in the Microsoft Teams corporate messaging service that had allowed an attacker to gain access to all accounts in an organization. Around the same time, the developers of Zoom for macOS fixed bugs that allowed outsiders to take control of a user’s device. Employees have often used personal accounts on free services such as Google Docs to collaborate on documents and exchange files. These services generally lack the centralized rights management that would enable them to protect confidential data. Healthcare in attackers’ sights During the pandemic, with the healthcare sector weighed down by a colossal burden, cybercriminals tried to attack its agencies, hospitals, and even doctors directly. In March 2020, for example, the servers of the US Department of Health and Human Services (HHS) experienced a massive DDoS attack . In the same month, a cyberattack affected databases belonging to the University Hospital in Brno, one of the largest centers for COVID-19 blood testing in the Czech Republic. As a result, doctors couldn’t process coronavirus tests and even canceled a number of surgical operations. Advanced cybercriminals have targeted organizations combatting COVID-19. There is evidence that in September 2020 members of the Lazarus Group attacked a pharmaceutical company that was developing a coronavirus vaccine; a month later, they switched to a related health ministry. Both medical organizations and individual employees became targets. In the UK, scammers tricked health workers out of e-mail logins and passwords by offering to register them for a nonexistent seminar on “the deadly COVID-19 virus.” The healthcare system’s work was also hindered by people who should presumably have understood the threat: employees of healthcare companies. For example, in the spring of last year, a man dismissed from his position as vice president of the American company Stradis Healthcare disrupted the supply of personal protective equipment for doctors for several months as revenge for his dismissal. According to information from the FBI , he kept a secret account through which he sabotaged his former colleagues’ work. It was reported in January 2021 that he had been sentenced to a year in prison. COVID-themed phishing While governments around the world have been battling COVID-19 and developing measures to support businesses and citizens, cybercriminals have tried to capitalize on fear of the virus and people’s need for help. According to our survey, a quarter of users received malicious e-mails about COVID-19-related topics. Fake correspondence from clients and government departments For example, scammers sent fake e-mails pretending to be from the US Centers for Disease Control and Prevention (CDC) . Victims were asked to fill out a summary of recent cases of coronavirus among their neighbors, which involved clicking a link and entering their e-mail login and password. Their account details ended up in the hands of criminals. During the wave of lockdowns, the number of e-mails masquerading as customer requests for product shipments grew. To give them credibility, attackers complained about “logistics problems due to COVID-19” or demanded expedited delivery, citing problems with Chinese counterparties. These messages usually included an attachment containing a Trojan or backdoor that would give the criminals remote control over the infected machine. Fake COVID-19 payments According to our data, scammers sent five times as many malicious e-mails about welfare benefits in 2020 as they had in the previous year. The messages again purported to come from government departments, the International Monetary Fund, and even the World Health Organization . The classic scheme was presented in a new way: Promise the victim compensation and ask for a small commission to transfer the funds. Cybercriminals also took advantage of the very real news that Facebook was giving grants to small businesses. They cited the story and announced that payments were due to all users of the popular social media platform. Victims were asked to apply by providing their account username and password, address, Social Security number, and a photo of an ID document. This package fetches a handsome price on the black market. How to protect yourself Cybercriminals didn’t invent any fundamentally new attack schemes during this pandemic year, but they did actively exploit the COVID-19 theme. And, since work moved online for many people, the number of online attacks has naturally increased. To avoid becoming a victim, we recommend reading our selection of articles on how to protect yourself when working from home . And, finally, a few universal tips: Don’t click links from strangers or download files from e-mails if you’re not sure you can trust the sender; Use corporate devices and company-approved software for work, and configure programs and devices properly; Ask your employer to install reliable protection on company devices, and strengthen your own personal computer and smartphone security ."}}
{"https://www.kaspersky.co.in/blog/scam-with-playstation-5-giveaway/22629/": {"metadata": {"dateAccessed": "2021-07-27", "dateCreated": "2021-03-19", "source": "www.kaspersky.co.in"}, "text": "The PlayStation 5 console went on sale last November, but many hopeful shoppers are still empty-handed. Sony, suffering a chip shortage as a result of COVID-associated supply restrictions, cannot keep pace with demand. Meanwhile, scammers are moving in to take advantage of the hype by offering the chance to win a PS5. Win a PS5 from a pharmaceutical company As with most phishing, a careful look reveals trouble. For example, although the scam e-mails in this campaign contain no glaring errors, the sender’s name — India Pharma in this case, an actual organization — is not affiliated with any gaming giveaways. Phishing e-mail offering the chance to win a PlayStation 5. It is not clear who is behind this display of wondrous generosity What’s also suspicious is that the terms and conditions (the very small print at the bottom of the message that most people don’t read) mention an entirely different company: toleadoo GmbH. It too exists. It’s based in Germany and is the subject of numerous user complaints . The small print also mentions certain “competition T&Cs,” but there is no link to them. Again, we’re looking for suspicious elements, and inconsistencies in legal language are very suspicious. In any case, to try your luck, the organizers ask you to register your e-mail address. The scammers just need your e-mail address to get started The next step opens a website bearing the Amazon logo, although with a URL that looks nothing like amazon.com. The page ramps up the phishing pressure, saying you’re one of ten lucky visitors who can win the coveted console this week, but you have to act in the next minute and 18 seconds — just enough time to complete the short survey and enter the drawing. This, of course, is another example of a pretty effective phishing tactic: Ramp up the pressure with an artificial time constraint and people will panic and rush instead of slowing down to apply critical thinking. The clock is ticking! Wheel of Fortune If you complete the survey and check the rest of the boxes, a dozen identical gift boxes appear on the screen, one of which is the winner. Spoiler alert: You win the prize! Can’t believe your good luck? Well, below are fake reviews from past “winners” to stoke your excitement and keep your vigilance nice and low. Positive reviews promote the scam Now comes the catch. A payment of £1 (one pound sterling — around $1.40 at the time of writing) is required to claim the prize. The organizers give no reason for the payment — but in comparison with the price of the console, it’s peanuts. In addition, they promise to cover all postage costs and deliver the shiny PS5 in just one week. You won! Now pay Next comes a request for address, ZIP code, phone number, and (again) e-mail, most of which makes perfect sense in the context of arranging prize delivery. However, at this point, the required payment jumps from £1 to £1.78; again, with no explanation. The payment magically increases from £1 to £1.78 The last step is to provide your banking details. The princely sum of £1.78 won’t make the cybercriminals rich, but your card details — in particular the CVV2/CVC2 code — might. One last step to giving the scammers your money Keep a cool head To avoid such pitfalls, don’t believe the hype. If you receive a tempting offer, keep your head, and always follow these simple guidelines to help guard against phishing: Check information about giveaways and other promos on the organizer’s website; Do not follow links in e-mails. Instead, enter the URL manually if you know it, or use a search engine to get there (after making sure the link is not an ad); Be very wary if getting a prize requires paying a fee, even if the amount is small. You risk losing more than just the amount requested ; Guard your personal data carefully, and if you have any doubts about a website, do not enter your contact details on it; Use a reliable security solution that warns you when you are about to visit a fraudulent website."}}
{"https://www.kaspersky.co.in/blog/proxyware/23676/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-11-20", "source": "www.kaspersky.co.in"}, "text": "Imagine getting paid for access to just a tiny portion of your Internet bandwidth at work. Sounds pretty sweet, doesn’t it? The computer is on all the time anyway, and you have unlimited Internet access, so why not? It’s not even your own resources, just corporate equipment and bandwidth. That all sounds simple, but you don’t have to look too closely to see that when you agree to install a proxyware client on a work computer, it’s not harmless at all. Install proxyware and you’re exposing your corporate network to risks that far outweigh any income you might earn from the deal. To put it bluntly, no other questionable Internet money-making scheme comes with such a variety of undesirable consequences. Today we explain why proxyware is dangerous. What is proxyware? Researchers at Cisco Talos coined the term proxyware and have reported on the phenomenon in depth . Essentially, a proxyware service acts as a proxy server. Installed on a desktop computer or smartphone, it makes the device’s Internet connection accessible to an outside party. Depending on how long the program remains enabled and how much bandwidth it is permitted to use, the client accumulates points that can eventually be converted into currency and transferred to a bank account. Of course, these kinds of services do not have to be used for illegal purposes, and they do have some legitimate applications. For example, some appeal to the marketing departments of large companies, which need as many Web entry points as possible in different geographic regions. Why proxyware on a company computer is a bad idea Although proxyware services claim “tenants” are harmless, problems sometimes still occur, including IP address reputation damage and software reliability. Pessimization of the IP address The most common problem with proxyware for the users of the computers on which it runs — or even for the entire network if it has a single IP address — is that the services often encounter CAPTCHA s, whose entire point is to ensure only real humans can get access to an online resource. A computer with proxyware raises suspicions, and rightly so. One way bandwidth tenants can use proxyware-laden computers is to scan the Web or measure the speed of website access by regularly deploying a flood of requests. Automatic DDoS protection systems do not like that. It can also be a sign of something even more shady, such as spam mailings. Keep in mind that the consequences can be much more dire for the company, with automated requests landing the organization’s IP address on a list of unsafe addresses. So, for example, if the e-mail server operates on the same address, at some point the employees’ messages may stop reaching external recipients. Other e-mail servers will simply start blocking the organization’s IP address and domain. Fake proxyware clients Another risk employees take in installing proxyware is that they may download something they didn’t mean to. Try this little experiment: Go to Google and search for “honeygain download.” You’ll get a couple of links to the developer’s official website and hundreds to unscrupulous file-sharing sites, half of which include “bonus content” with their downloads. What kinds of bonus content? Well, researchers describe one such trojanized installer as deploying a cryptocurrency-mining program (which devour a PC’s resources and electricity) and a tool to connect to the cybercriminals’ command server, from which anything else can be downloaded at any time. That kind of proxyware can take down an organization’s entire IT infrastructure. It could also lead to ransomware encrypting data, ransom demands, and more. In sum, proxyware is a grab bag of dangers for a business. Covert installation of proxyware Most scenarios resemble the above: unintended consequences of purposeful (if sometimes unauthorized) installations. The converse sometimes happens as well, with an employee catching actual malware on a shady site, and that malware installing a modified proxyware client on the computer. That’s nothing but trouble: slowed computers, less network bandwidth, and, potentially, data theft. Recommendations for businesses Your best way to combat criminal exploitation through proxyware is to install a reliable antivirus solution on every computer that has Internet access. Not only will that protect your company from the harmful effects of proxyware, but if said proxyware includes, or is included with, other malware, you’ll still be covered. To be clear, even “clean” proxyware is not much better. A sound security policy should not allow anyone to install proxyware or any other questionable software on employees’ computers, regardless of whether the computers are in the office or employees are connecting to the organization’s VPN. As a rule, most employees do not need, and should not be allowed, to install software on their computers independently."}}
{"https://www.kaspersky.co.in/blog/netflix-phishing/23657/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-11-17", "source": "www.kaspersky.co.in"}, "text": "Movies and TV shows have been a huge source of comfort for many in these COVID times, and the number of new shows on Netflix, Amazon Prime, and the like has skyrocketed. But when searching for the latest megahit, don’t neglect basic security measures or you might find that someone else is enjoying it at your expense — or worse, that the money in your bank account has evaporated. It’s more fun to ponder what to watch next than to dig through security settings, but attackers are ready and waiting to siphon off your personal and payment information. Phishing bait Streaming services offer a variety of payment plans, but generally they all involve paying with a credit card. And where there are card details, there is phishing. What’s more, newbies and seasoned account holders may experience different forms of bait. We collected some examples from users who agreed to share threat information. “Subscribe now!” To sign up for a streaming service, you need a valid e-mail address; and to pay, you need some form of online payment such as a credit card or PayPal account. (If you plan to watch Apple TV, you’ll also need an Apple ID.) Unsurprisingly, cybercriminals have created fake sign-up pages to net all of those goodies in one go. Armed with your info, they can withdraw or spend your money right away; your e-mail address should come in handy for future attacks. In the example below, the fake site is not very convincing. Can you spot the phishing signs ? Fake Netflix sign-up page “Refresh data” If you already have a paid subscription, then attackers will threaten to block it, assuming, logically, that you value it. Here’s an e-mail from “friends at Netflix,” telling the recipient to update or confirm payment details or they’ll close the account. And it includes a big, red button. Don’t rush to click that — remember what happens in the movies when they push the big, red button? “Dear costumer, please update your account” The link takes you to a payment confirmation page. Now, many phishing messages contain such obvious mistakes as addressing “costumers,” but take the form below as an example that actually looks plausible. It has no spelling mistakes or weird design elements, but the inattentive user who falls for it could lose money from their bank account. Fake Netflix website prompts to enter personal and banking data, allegedly for account reactivation A dangerous premiere In the example below, cybercriminals used popular shows to attract fans who didn’t have subscriptions, offering them the opportunity to watch the shows on the fake website. This unofficial page invites fans to watch or download The Mandalorian As a teaser, they show a short clip, which they sometimes try to pass off as a new, previously unaired episode. More often than not, it is cut from trailers that have long been in the public domain. Intrigued victims are then asked to buy a low-cost subscription to continue watching. What follows is a classic scenario: Any payment details users enter go straight to the crooks, and the never-before-seen episode remains such. No longer your account Cybercriminals are interested in more than bank account details; account credentials for streaming services are also hot. Because hijacked accounts with paid subscriptions get put up for sale on the dark web , you could log in one day and discover someone else is already there. After all, depending on your Netflix plan, you can stream on 1–4 devices simultaneously, and cybercriminals can sell your login credentials to any number of streamers. That means you might find yourself having to wait in line until some stranger decides to sign out. This fake Netflix login page looks just like the real one That may not be the end of it, either: Many people use the same password for different accounts , and databases of stolen passwords die hard. If their password is the same everywhere, the victim need only enter it on a phishing page once. Buy a subscription for yourself, not cybercriminals Cybercriminals scam movie and TV show lovers in different ways. Some of their ruses are quite easy to spot, others less so. By following simple digital security rules, you can protect your data not only in online movie theaters, but elsewhere as well. Do not click links in e-mails, even if a message seems to be from a real streaming (or other) service; always go to the official website by entering the address manually or through the app; Do not trust any person or site promising viewings of movies or shows before the official premiere; Pay attention to red flags that warn of phishing e-mails or fake websites; Stay alert and read more about scams and phishing schemes to learn how to sense which e-mails and websites are trustworthy, and which you should avoid; Use different passwords for all accounts that you value, and use a password manager to remember them for you; Use a reliable security solution that identifies malicious attachments and blocks phishing websites."}}
{"https://www.kaspersky.co.in/blog/linkedin-phishing/23618/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-11-10", "source": "www.kaspersky.co.in"}, "text": "Have you disabled annoying e-mail notifications from social networks? We think that’s great! We even periodically offer advice on how to cut down on digital noise . But LinkedIn is a special case. People really do expect messages from the social network for professionals — one could be from a prospective employer or business partner, after all. But a message from LinkedIn might just as easily come from a scammer pretending to represent a legitimate company. In this post, we’re taking apart some phishing e-mails masquerading as LinkedIn notifications. “I am a bussinessman and am interested in doing business with you” On the face of it, this type of e-mail looks like a typical partnership proposal. It includes the photo, position, and company name of the potential “partner,” and even a LinkedIn logo. The message is too short, though, and one might expect the word “businessman” to be spelled correctly in a legitimate message. You may also see that the message came from “LinkediinContact” — note the extra “i” — and the sender’s address has nothing to do with LinkedIn. E-mail purportedly from LinkedIn proposing cooperation with an Arab businessman The link in the e-mail leads to a website that looks similar to the real LinkedIn login page. Phishing LinkedIn login page But the URL is far removed from LinkedIn’s, and the domain is the Turkish .tr, not .com. If the victim enters their credentials on this site, the account will soon be in the hands of the scammers. “Please send me a qoute” A similar case is this message seemingly from an importer in Beijing, asking for a quote for the delivery of goods. The notification looks convincing; the message footer includes links to view help and unsubscribe from notifications, a copyright notice, and even the actual postal address of LinkedIn’s China office. Even the sender’s address looks like the real deal. Nevertheless, we see some red flags. E-mail purportedly from LinkedIn in which a Chinese buyer requests a quote. The sender’s address looks clean, but that doesn’t mean everything’s in order For example, an article is missing in front of the word “message” in the subject line. The author may not speak fluent English, but the platform generates the subject of LinkedIn notifications automatically, so the subject can’t contain errors. If you smell a rat and do a search for the company (UVLEID), you won’t find it because it doesn’t exist. And most important, the links in the e-mail point to a suspicious address in which random words, numbers and letters have been added to the name of the social network. The domain is again wrong, as well. This time it’s .app, which app developers use. The button points to a phishing site The “LinkedIn login page,” which the link opens, has issues: a blue square covering part of the last letter in the logo, and Linkedin instead of LinkedIn (under the username and password fields). arefully check the URL of the site and the name of the social network “You appeared in 2 search this week” Links in fake notifications don’t always open fake login pages — sometimes they can lead to more unexpected places. For example, this message saying that the recipient’s profile has been viewed twice — common information for LinkedIn users to see — obviously uses bad English, but even if you miss that, a few other details should catch your attention: Unknown sender address and link to a site in a Brazilian domain With this kind of deception, if the victim misses the strange set of letters in the sender’s address or the Brazilian domain, they may well click the button and get to an unexpected site — in our case, a “how to become a millionaire” online survey. After a few redirects, we ended up at a form asking for contact information, including phone numbers. The scammers most likely use the collected numbers for phone fraud . Online survey with redirect for further data harvesting How to tell if a message from a potential partner or employer is fake Cybercriminals use phishing to steal accounts, personal data, and money, but that is no reason to stop using LinkedIn or other services. Instead, learn how to guard against phishing , and always keep these basic tips at the ready: Watch out for unexpected messages from well-known companies; Look for inconsistencies in the names and addresses of senders, as well as typos in links, the subject line, and the e-mail body; Check notifications using official apps or websites, and in the latter case, manually type in the address or open it from your bookmarks; Enter contact information, card numbers, or login credentials only after double-checking you are on the real site; Use a reliable security solution that warns you of danger and blocks phishing and fraudulent sites."}}
{"https://www.kaspersky.co.in/blog/malware-in-discord/23600/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-11-08", "source": "www.kaspersky.co.in"}, "text": "In the six years since the launch of Discord’s chat and VoIP service, the platform has become a popular tool for building communities of interest, especially among gamers. However, just like any other platform that hosts user-generated content, Discord can be exploited. Discord’s extensive customization options also open the door to attacks on ordinary users, both on and off the chat server. Recent research into Discord security has revealed several cyberattack scenarios linked to its chat service, some of which can be truly dangerous for users. Here’s how to protect yourself. Malware being spread through Discord Malicious files distributed through Discord represent the most obvious threat. A recent study identified several dozen types of malware. We call this threat “obvious” simply because sharing files through Discord is very easy; every file uploaded to the platform is assigned a permanent URL, formatted as follows: cdn.discordapp.com/attachments/{channel ID}/{file ID}/{file name} Most files are freely available for download by anyone with the link. The study describes a real-life attack example: a fake website offering Zoom Web conferencing client downloads. The website looks like the real one, and the malicious file is hosted on a Discord server. That gets around restrictions on downloading files from untrusted sources. The rationale is that the servers of a popular application used by millions are less likely to be blocked by antimalware solutions. The malicious “lifehack” is as obvious as are the means of combating it: High-quality security solutions look at more than just the download source to determine the level of threat a file may pose. Kaspersky tools immediately detect malicious functionality the first time a user tries to download the file, for example, and then, with the help of a cloud-based security system, let all other users know the file should be blocked. All services that permit uploads of user-generated content face issues of misuse. Free Web hosting sites see phishing pages created on them, for example, and file-sharing platforms are used for spreading Trojans. Form-filling services serve as spam channels. The list goes on. Platform owners do try to combat the abuse, but with mixed results. Discord developers also clearly need to implement at least some basic means of user protection. For example, files used on a particular chat server need not be made available to the whole world. Checking and automatically blocking known malware also seems wise. Regardless, this is Discord’s least exotic problem, and combating it is really no different than dealing with any other method of malware distribution. It is not, however, the only threat users face. Malicious bots Another recent study demonstrates how easy it is to exploit Discord’s bot system. The bots extend chat server functionality in various ways, and Discord offers a vast array of options for customizing users’ own chats. One example of chat-related malicious code was recently published on (and fairly quickly removed from) GitHub: Using mainly capabilities provided by the Discord API, the author was able to execute arbitrary code on a user’s computer. It might look something like this: A malicious chatbot launches an arbitrary program on a user’s computer after receiving a command through a Discord chat. Source In one attack scenario, malicious code relies on a locally installed Discord client to launch automatically on startup. Installing a bot from an untrusted source can lead to such an infection. The researchers also looked at another Discord misuse scenario that doesn’t rely on the user having installed a Discord client. In this case, the malware uses the chat service to communicate. Thanks to the public API, uncomplicated registration process, and basic data encryption, a backdoor can easily and conveniently use Discord to send data about the infected system to its operator and, in turn, receive commands to execute code, upload new malicious modules, and more. That kind of scenario appears quite dangerous; it greatly simplifies the work of attackers, who then do not need to create a communication interface with infected computers but can instead use something already available. At the same time, it somewhat complicates the detection of malicious activity; conversations between the backdoor and its operator look like regular user activity in a popular chat. Protection for gamers Although the aforementioned threats apply to all Discord users, they relate mainly to those who use Discord as a game add-in: for voice and text communication, streaming, collecting gaming statistics, and so on. Such use entails substantial customization and adds to users’ risks of finding and installing malicious extensions. The relaxed, seemingly safe environment actually represents further threat, increasing the success rate of social engineering techniques — bait goes down easier in a cozy chat with people you believe are your friends. We recommend following the same digital hygiene rules on Discord as you do elsewhere on the Web: Don’t click suspicious links or download obscure files; scrutinize offers that sound too good to be true; and refrain from sharing any personal or financial information. As for the Trojans and backdoors, Discord-based or simply distributed through the platform, they are not special or essentially different from other kinds of malware. Use a reliable antivirus app to stay safe, keep it running at all times — including when you install any software or add bots to a chat server — and pay attention to its warnings. Performance need not be a concern. For example, our security products include a game mode that minimizes overhead without compromising protection."}}
{"https://www.kaspersky.co.in/blog/trickbot-new-tricks/23505/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-10-20", "source": "www.kaspersky.co.in"}, "text": "Exactly five years ago, in October 2016, our solutions first encountered a Trojan named Trickbot (aka TrickLoader or Trickster). Found mostly on home computers back then, its primary task was to steal login credentials for online banking services. In recent years, however, its creators have actively transformed the banking Trojan into a multifunctional modular tool. What’s more, Trickbot is now popular with cybercriminal groups as a delivery vehicle for injecting third-party malware into corporate infrastructure. News outlets recently reported that Trickbot’s authors have hooked up with various new partners to use the malware to infect corporate infrastructure with all kinds of additional threats, such as the Conti ransomware. Such repurposing could pose an additional danger to employees of corporate security operation centers and other cybersec experts. Some security solutions still recognize Trickbot as a banking Trojan, as per its original specialty. Therefore, infosec officers who detect it might view it as a random home-user threat that accidentally slipped into the corporate network. In fact, its presence there could indicate something far more serious — a ransomware injection attempt or even part of a targeted cyberespionage operation. Our experts were able to download modules of the Trojan from one of its C&C servers and analyze them thoroughly. What Trickbot can do now The modern Trickbot’s main objective is to penetrate and spread on local networks. Its operators can then use it for various tasks — from reselling access to the corporate infrastructure to third-party attackers, to stealing sensitive data. Here’s what the malware can now do: Harvest usernames, password hashes and other information useful for lateral movement in the network from Active Directory and the registry; Intercept web traffic on the infected computer; Provide remote device control via the VNC protocol; Steal cookies from browsers; Extract login credentials from the registry, the databases of various applications and configuration files, as well as steal private keys, SSL certificates and data files for cryptocurrency wallets; Intercept autofill data from browsers and information that users input into forms on web-sites; Scan files on FTP and SFTP servers; Embed malicious scripts in web pages; Redirect browser traffic through a local proxy; Hijack APIs responsible for certificate chain verification so as to spoof the verification results; Collect Outlook profile credentials, intercept e-mails in Outlook and send spam through it; Search for the OWA service and brute-force it; Gain low-level access to hardware; Provide access to the computer at the hardware level; Scan domains for vulnerabilities; Find addresses of SQL servers and execute search queries on them; Spread through the EternalRomance and EternalBlue exploits; Create VPN connections. A detailed description of the modules and indicators of compromise can be found in our Securelist post . How to guard against the Trickbot Trojan The statistics show that the majority of Trickbot detections this year were registered in the US, Australia, China, Mexico and France. This does not mean, however, that other regions are safe, especially considering the readiness of its creators to collaborate with other cybercriminals. To prevent your company from falling victim to this Trojan, we recommend that you equip all Internet-facing devices with a high-quality security solution . In addition, it’s a good idea to use cyberthreat monitoring services to detect suspicious activity in the company’s infrastructure."}}
{"https://www.kaspersky.co.in/blog/dangerous-feature-phones/23496/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-10-15", "source": "www.kaspersky.co.in"}, "text": "A recent review of five entry-level mobile phones retailing for about $10–$20 examined their security in detail . Commonly referred to as “feature phones” or “granny phones” — and often procured for elderly relatives either unwilling or unable to get used to smartphones — such phones can also be “just in case” spares. Some people also believe they are safer than Android-powered smartphones. Well, the reviewer refuted that last bit. He discovered hidden functions in four out of the five phones: Two transmit data at first power up (leaking the new owner’s personal information), and the other two not only leak private data, but can also subscribe the user to paid content by secretly communicating over the Internet with a command server. Infected granny phones The study author offers information about the methods used to analyze these simple devices’ firmware, the technicalities of which may be interesting to those willing to repeat the same analysis. However, let’s get straight to the findings. Out of the five phones, two send the user’s data somewhere the first time they’re powered on. To whom the data goes — manufacturer, distributor, firmware developer, or somebody else — is not clear. Neither is it clear how the data may be used. It could be assumed that such data might be useful to monitor sales or control the distribution of batches of products in different countries. To be clear, it doesn’t sound very dangerous; and after all, every smartphone transmits some telemetry data. Remember, however, that all major smartphone manufacturers at least try to anonymize the data they collect, and its destination is usually more or less clear. In this case, however, nothing is known about who is collecting owners’ sensitive information without their consent. For example, one of the phones transmits not only its serial number, country of activation, firmware info, and language, but also the base station identifier, handy for establishing the user’s approximate location. Moreover, the server collecting the data has no protection whatsoever, so the information is basically up for grabs. One more subtlety: The transmission takes place over the Internet. To be clear, a feature phone user may not even be aware that the device can go online. So, apart from anything else, the covert actions may result in surprise mobile traffic charges. Another phone from the review group, apart from leaking user data, was programmed to steal money from its owner. According to firmware analysis, the phone contacted the command server over the Internet and executed its instructions, including sending hidden text messages to paid numbers. The next phone model had even more advanced malicious functionality. According to one actual phone user, a total stranger used the phone number to sign up for Telegram. How could that have happened? Signing up for almost any messaging app means providing a phone number to which a confirmation code is sent by SMS. It seems, however, the phone can intercept this message and forward the confirmation code to a C&C server, all the while concealing the activity from the owner. Whereas the previous examples involved little more than unforeseen expense, this scenario threatens real legal problems, for example should the account be used for any criminal activities. What should I do now that I know push-button phones are unsafe? The difference between modern low-end phones and their counterparts of 10 years ago is that now, even dirt-cheap circuitry can include Internet access. Even with an otherwise clean device, this may prove an unpleasant discovery: a phone chosen specifically for its inability to connect to the Internet goes online anyway. Earlier, the same researcher analyzed another push-button phone . Although he found no malicious functionality, the device had a menu of paid subscriptions for horoscopes and demo games, the full versions of which the user could unlock — and pay for — with a text. In other words, your elderly relative or child could press the wrong button on a phone purchased specifically for its lack of Internet and apps and end up paying for the mistake. What makes this “infected” mobiles story important is that it’s often the manufacturer or a dealer back in China adding the “extra features,” so local distributors may not even be aware of the problem. Another complicating factor is that push-button phones come in small batches in a multitude of different models, and it is hard to tell a normal phone from a compromised one, unless one can thoroughly investigate firmware. Clearly, not all distributors can afford adequate firmware control. It might be easier just to buy a smartphone. Of course, that depends on budget, and unfortunately, cheaper smartphones may have similar malware issues . But if you can afford one — even a very simple one — from a major manufacturer, it could prove a safer choice, especially if your reason for choosing a push-button device is that you’re looking for something simple, reliable, and free of hidden functions. You can mitigate Android risks with a reliable antivirus app ; feature phones offer no such control. As for elderly relatives, if they’re used to answering calls by opening their flip phone, adapting to a touch screen may prove next to impossible, but upgrading is worth a try in our opinion. Plenty of older folks have switched to smartphones easily enough and can now happily experience the wide world of mobile computing."}}
{"https://www.kaspersky.co.in/blog/finspy-for-windows-macos-linux/23484/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-10-08", "source": "www.kaspersky.co.in"}, "text": "At Kaspersky’s recent Security Analyst Summit , our experts presented a detailed report on FinSpy (aka FinFisher) spyware and its distribution methods, including some previously unknown ones. You can read more about their findings in Securelist’s post . In this article, meanwhile, we explore what kind of malware FinSpy is and how you can protect yourself from it. What is FinSpy (FinFisher)? A commercial spyware program used by law enforcement and government agencies worldwide, FinSpy first lit up researchers’ radar in 2011, when documents related to it appeared on WikiLeaks. Source code appeared online in 2014, but FinSpy’s story didn’t end there: After a redevelopment and to this day, the malware continues to infect devices around the world. FinSpy is versatile, with versions for computers running Windows, macOS, and Linux, as well as mobile devices with Android and iOS . Its capabilities vary depending on the platform, but in all cases the malware employs various means to transmit bundles of data about them covertly to its handlers. How FinSpy spreads The spyware has several ways to infiltrate Windows machines. For example, it can hide in infected distribution packages including installers for TeamViewer, VLC Media Player, WinRAR, and others. Downloading and running the modified application sets in motion a multistep infection chain . Additionally, our researchers found the malware loader in components that load before the operating system: UEFI (Unified Extensible Firmware Interface, the interface through which the operating system communicates with the hardware) and MBR (Master Boot Record, needed to start Windows). Either way, simply booting up the computer installs FinSpy. A smartphone or tablet can pick up FinSpy through a link in a text message. In some cases (for example, if the victim’s iPhone is not jailbroken ), the attacker may need physical access to the device, which somewhat complicates the task. Also, it seems that physical access is necessary for the attackers to infect Linux machines, but we cannot say for sure. What data does FinSpy steal? FinSpy has extensive user-surveillance capabilities. For example, PC versions of the malware can: Turn on the microphone and record or transmit everything it hears; Record or transmit in real time everything the user types on the keyboard; Turn on the camera and record or transmit images from it; Steal files the user interacts with: accesses, modifies, prints, receives, deletes, and so forth; Take screenshots or capture a section of the screen the user clicks; Steal e-mails from the Thunderbird, Outlook, Apple Mail, and Icedove clients; Intercept contacts, chats, calls, and files in Skype. In addition, the Windows version of FinSpy can eavesdrop on VoIP calls, intercept certificates and encryption keys for certain protocols, and download and run forensic data collection tools. On top of all that, the Windows version of FinSpy can infect BlackBerry smartphones, so even that now-exotic platform is not overlooked. As for the mobile versions of FinSpy , they can listen and record calls (voice or VoIP), read text messages, and monitor user activity in instant messaging apps such as WhatsApp, WeChat, Viber, Skype, Line, Telegram, Signal, and Threema. The mobile spyware also sends the operators a list of the victim’s contacts, calls, calendar events, geolocation data, and much more. How to avoid FinSpy Unfortunately, it is not easy to protect yourself completely from government-level spyware. That said, you can take some precautions against FinSpy and other surveillance apps: Download apps only from trusted sources, whether for mobile or desktop or laptop programs. Additionally, Android users should forbid installation from unknown sources to reduce their chances of infection; Stop and think before you click on links in e-mails and messages from strangers. If you must click, first carefully check where the link leads; Don’t jailbreak your smartphone or tablet; Android rooting and iOS jailbreaking make break-ins much easier; Don’t leave devices unattended where strangers have access; Install reliable protection on all of your devices."}}
{"https://www.kaspersky.co.in/blog/three-vulnerabilities-in-chrome/23438/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-10-02", "source": "www.kaspersky.co.in"}, "text": "Google has released an emergency update for the Chrome browser that addresses three vulnerabilities: CVE-2021-37974 , CVE-2021-37975 , and CVE-2021-37976 . Google experts consider one of the vulnerabilities as critical and the other two as highly dangerous. What’s worse: according to Google cybercriminals have already exploited two of these three vulnerabilities. Therefore, Google advices all Chrome users to immediately update browser to version 94.0.4606.71. These vulnerabilities are also relevant to other browsers based on the Chromium engine — for instance, Microsoft recommends updating Edge to version 94.0.992.38. Why these vulnerabilities in Google Chrome are dangerous CVE-2021-37974 and CVE-2021-37975 are use-after-free (UAF) class vulnerabilities — they exploit incorrect use of heap memory and, as a result, can lead to arbitrary code execution on the targeted computer. The first one, CVE-2021-37974, is related to the Safe Browsing component, a Google Chrome subsystem that warns users about unsafe websites and downloads. The CVSS v3.1 severity rating for this vulnerability is 7.7 out of 10. The second vulnerability, CVE-2021-37975, was found in Crome’s V8 JavaScript engine. This one is considered the most dangerous of all three — 8.4 on CVSS v3.1 scale, which makes it a ‘critical’ risk vulnerability. Unknown malefactors are already using this vulnerability in their attacks on Chrome users. The cause of the third vulnerability, CVE-2021-37976, is data overexposure caused by the core of Google Chrome. It’s slightly less dangerous — 7.2 on the CVSS v3.1 scale, however it is also already being used by cybercriminals. How cybercriminals can exploit these vulnerabilities Exploitation of all three vulnerabilities requires the creation of a malicious web page. All attackers need is to create a website with an embedded exploit and a way to lure victims to it. As a result, exploits for two use-after-free vulnerabilities allows the attackers to execute arbitrary code on the computers of unpatched Chrome users who have accessed the page. That can lead to the compromise of their system. An exploit for the third vulnerability, CVE-2021-37976, makes it possible for the attackers to gain access to the victim’s confidential information. Google will most likely reveal more details on the vulnerabilities after the majority of users have up-dated their browsers. In any case, it’s not worth delaying the update — much better do it as soon as possible. How to stay safe The first step for everyone is to update browsers on all devices that have access to the Internet. Quite often the update is installed automatically when the browser is restarted, however many users do not restart their computer for a long time, so their browser may remain vulnerable for several days or even weeks. In any case, we recommend checking the version of Chrome. Here’s how to do it: click on the Customise and Control Google Chrome button at the top-right corner of the browser window and choose Help -> About Google Chrome . If your browser version is not the latest available, Chrome will automatically start the update. For extra protection we recommend users to install security solutions on all devices with Internet access. This way, even you’re caught without an up-to-date browser, proactive protection technologies will minimize the possibility of successful vulnerability exploitation. We also recommend employees of corporate information security departments to use security solutions on all devices , monitor security updates and employ automatic update delivery and control system. It would be also reasonable to prioritize the installation of browser updates."}}
{"https://www.kaspersky.co.in/blog/what-is-spookjs/23412/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-09-29", "source": "www.kaspersky.co.in"}, "text": "By comparison, a phishing attack makes sense: Click a link, land on a malicious page, enter some details, and an attacker steals them. Try this one on for size, instead: Click a link and an attacker steals your data. That’s right, today we’re talking about malicious pages that exploit a fundamental CPU feature to steal data without requiring a victim to enter anything. And the vulnerability in question is very difficult, if not impossible, to fix. In 2018, researchers proved the scenario was theoretically possible, unveiling the first two variants of the Spectre vulnerability. Three years later, September 2021 saw the first real-life attack using Spectre v1. Known as Spook.js, the attack concept is complicated, but we will try to strip it down. Spectre v1 background News of the first two attacks of this family — Spectre and Meltdown — broke in 2018 . The attacks exploited the branch prediction mechanism, which is designed to speed up command execution, found in all modern CPUs. When a user enters a password to log in to a website, if the password is correct, one set of instructions is executed. If not, another set is executed. However — and this is where the branch prediction kicks in — before receiving the answer, the CPU starts executing the set of instructions it thinks it will most likely need. In our example, if the password has been entered correctly a hundred times before, the CPU will assume that this time will be no different. If it guesses correctly, the user gets a performance boost. If not, the CPU discards the speculatively executed instructions and runs the other set. In a Spectre-vulnerability attack, an attempt is made to read a data area to which the program does not have access. In the first stage of the attack, multiple calls are made to open-access data areas, whereby the branch prediction system is “trained” to perform the forbidden read operation as well. Using branch prediction, the CPU performs the operation in advance because it is used to the program asking to read data that it is actually allowed to read. But a check reveals that the program is prohibited from accessing the data, so the speculatively executed computations are discarded. So far, so good — but the data read by the CPU is stored for some time in the cache, the CPU’s own memory. Next comes the most interesting part: With no way to read the confidential data from the CPU’s cache directly, the malicious process deploys a so-called side-channel attack to steal it. That involves measuring the speed of access to certain information. If it’s relatively small, that means the data is located in the cache. If large, it is loaded from regular RAM. A set sequence of read attempts results in a leak of the secret information. The result is a fundamental CPU flaw whose only fix is to disable branch prediction completely, thus seriously affecting performance. That said, Specter attacks do have many limitations: The attacker must be able to execute program code on the target computer or mobile device; The attack requires a specific target program coded so as to create the conditions for a successful attack; Even if the attack is successful, data extraction is extremely slow — tens or hundreds of bytes per second — and read errors are far from impossible; In general, stealing the intended secret data, such as passwords, encryption keys, and so forth, requires a combination of conditions. Spook.js — real-life application of Spectre v1 We might conclude that Spectre isn’t all that dangerous. After all, if an attacker can execute code on a target computer, exploiting one of the many vulnerabilities in the operating system or installed programs to escalate privileges and steal data would be far simpler. That is true, but modern Web pages also contain large amounts of program code that gets executed on the user’s computer, in the browser. That’s how Spook.js attacks exploit the Spectre v1 vulnerability: An infected page loads, the browser executes the code, and the cybercriminal steals confidential data. The authors of the report demonstrated some practical attacks. First, they stole a user password from Tumblr. Second, they stole data from Lastpass. Third, they intercepted a user-uploaded image from private storage on a Google server. A feature of the Google Chrome browser made it all possible. Since the release of information about Spectre, Chrome’s developers have taken measures to ward off potential attacks by forcing websites to load in isolation. Because each website creates its own process, malicious code on one page cannot be used to steal data from another resource. But there is one exception: Multiple pages from the same site or domain are grouped together in a common browser process. If the malicious code (written in JavaScript, hence the .js in the name of the attack) is run on one of them, data on other pages can be stolen. Spectre.js attack on Tumblr As a collective blog, Tumblr can host malicious code, at least in theory. That way, with a malicious page open in one tab, if a user tries to log in to their account on the service in another tab, the browser saves and automatically fills in the username and password — which the malicious code can then steal. By exploiting the Spectre vulnerability, an attack can interact tangentially with another tab from the same site and steal data by indirect means. A successful attack using this approach leaves almost no traces. Specter.js attack on LastPass The attack on the LastPass password manager was different in that the code to steal data using Spectre v1 was embedded in a malicious extension for Google Chrome. The LastPass extension was also running in the browser. In some cases, the extensions are also executed in a common browser process, making data theft possible. Specter.js attack on Google Cloud Storage Another example uses attacks on Google cloud storage: One browser tab contains a malicious page hosted on sites.google.com; another lets users upload images to their private storage in the G Suite service. In this scenario, an attacker can use malicious code to gain access to the images. Original image (left) and the one stolen from Google cloud storage using a Spook.js attack. Source Method limitations Researchers have shown how the attack can be carried out on different CPUs, including several modern ones from Intel and even the new ARM-based Apple M1. In all cases, the attack was accomplished in Google Chrome. In principle, several unique features of the browser make Spook.js possible. Other Chromium-based browsers, such as Microsoft Edge, are also vulnerable to this attack. However, there are certain limitations. First is the low speed of data theft (400–600 bytes per second, depending on the CPU), which is why the target file in the last demo is very small. Second is the large number of errors when stealing data from the CPU cache. Up to 4% of the data is erroneous; hence the artifacts in the stolen copy of the image. The attack doesn’t work on AMD processors or in Mozilla Firefox, whose JavaScript engine works differently. The researchers aren’t ruling out the possibility of a successful attack on AMD chips and Firefox browser, but verifying that will require more study. Finally, an attack requires uploading malicious code to a page with the same domain name, such as in the case of collective blogs or hosting. Applying this method to, say, a bank’s website is probably not going to work. No reason to panic The study of Spook.js is important because researchers have, for the first time, been able to demonstrate a fairly realistic scenario for the exploitation of one of the Spectre vulnerabilities. Nevertheless, the chances of a real-world attack are low. First, the developers of Google Chrome, on the back of this research, have beefed up the mechanism for isolating loaded sites from one another. Second, cybercriminals have many easier ways to steal user data, from traditional malware to social engineering, and this one requires serious knowledge of the low-level workings of modern CPUs. As a scientific work, Spook.js is set to alter the software landscape through the introduction of new recommendations for website security (for example, the authors propose moving authorization pages to a separate domain name). Subsequent studies may find ways to make attacks a little easier, but most likely they will lead to more rounds of security enhancements. Even if Spectre-type vulnerabilities can be exploited en masse, the protection means will be the same as for any malware. Security vendors will simply add the new types of attacks to the list of those to be monitored and blocked before execution. It’s also possible that one day researchers will stumble upon a feature of Spectre-like vulnerabilities that necessitates a major reworking of the entire modern IT ecosystem. That, however, remains unlikely. Let’s not forget that it took three years to move from a theoretical vulnerability to the first practical attack (and even then, it’s an attack with many limitations). Spectre may also be used for targeted attacks in which the potential benefit from the stolen data exceeds the costs of the operation. Even if that scenario is relevant to your organization, you can easily make attacks more difficult by using different browsers for different content. For example, do not open pages and Web services with sensitive information in the same browser where you get your online entertainment. Ideally, handle confidential information in an isolated environment, in a virtual machine, or simply on a separate device."}}
{"https://www.kaspersky.co.in/blog/bloodystealer-and-gaming-accounts-in-darknet/23376/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-09-27", "source": "www.kaspersky.co.in"}, "text": "In March this year, our experts discovered an ad on an underground forum for a piece of malware dubbed BloodyStealer by its creators. The ad states that it steals following data from infected devices: Passwords, cookies , bank card details, browser autofill data; Device data; Screenshots; Desktop and uTorrent client files; Bethesda, Epic Games, GOG, Origin, Steam, Telegram, and VimeWorld client sessions ; Logs. BloodyStealer ad. Source What struck us was that most of the listed programs are game-related, which suggests that gamer accounts and their contents are in demand on the underground market. We decided to examine in detail exactly what risks gamers face. BloodyStealer conquers the world Although BloodyStealer is relatively new, it is already globe-trotting. According to our data, the malware has hit users in Europe, Latin America, and the Asia-Pacific region — not so surprising given its malware-as-a-service (MaaS) distribution model, meaning anyone can buy it and the price is quite low (about $10 per month or roughly $40 for a “lifetime license”). In addition to its theft functions, the malware has a set of tools meant to thwart analysis (read more about them here ). It sends stolen information as a ZIP archive to the C&C server, which is protected against DDoS and other Web attacks. The cybercriminals use either the (quite basic) control panel or Telegram to get the data, including gamer accounts. Not by BloodyStealer alone BloodyStealer is just one of many tools available on the dark web for stealing gamer accounts. Cybercriminals sell other types of malware, many of which have been on the market longer than BloodyStealer. In addition, underground forums often feature ads offering to post a malicious link on a popular website or selling tools to generate phishing pages automatically. Cybercriminal sells BlackMafia phishing tool to create fake PUBG pages With the aid of these tools, cybercriminals can collect, and then try to monetize, a huge amount of credentials. All kinds of offers related to gamer accounts can be found on the dark web. Logs for wholesale access Among the most popular products are so-called logs — databases containing reams of data for logging into accounts. In their ads, attackers can specify the types of data, the geography of users, the period over which the logs were collected, and other details. For example, in the screenshot below, an underground forum member offers an archive with 65,600 records, of which 9,000 are linked to users from the US, and 5,000 to residents of India, Turkey, and Canada. The entire archive costs $150 (about 0.2 cents per record). Dark-web ad for the sale of logs for August 2021 That said, these databases can contain outdated or even useless information, and so some sellers let buyers check the logs to confirm they’re up to date. Another dark-web ad: Fresh logs for $300 per 1,000 records Gamer accounts, games, and inventory Cybercriminals sell access to specific gaming accounts as well, both individually and wholesale. Unsurprisingly, accounts with many games, add-ons, and expensive items hold particular value. Typically cybercriminals sell them at huge discounts. A cybercriminal selling 280,000 gamer accounts for just $4,000 Account content is also traded, again for a fraction of its real value. On the dark web, for example, you can find Need for Speed and other titles selling for less than 50 cents. Games from stolen accounts are sold for a song In-game items are also in circulation. Discounted skins on the underground market How to avoid falling victim to BloodyStealer and other thieves Having games and in-game items sold off is not the only problem that awaits the owner of a stolen account. Cybercriminals or buyers (it makes little difference to the victim) can use the account to launder money, distribute phishing links, and do other illegal things. To avoid falling prey to cybercriminals, make sure your accounts and devices are secure. Protect your accounts with strong passwords, enable two-factor authentication, and generally max out the platform’s security settings (see our guides for Steam , Battle.net , Origin , Twitch , and Discord users). Download apps only from official sources to minimize the chances of picking up BloodyStealer or other malware. Be wary of links in e-mails and messages from strangers. Before entering your credentials on any website, make sure it’s genuine. Use a reliable security solution. For example, Kaspersky Security Cloud blocks BloodyStealer and doesn’t interfere with gameplay ."}}
{"https://www.kaspersky.co.in/blog/how-to-protect-mikrotik-from-meris-botnet/23303/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-09-16", "source": "www.kaspersky.co.in"}, "text": "Recent large-scale DDoS attacks using a new botnet called Mēris peaked at almost 22 million requests per second. According to Qrator research , MikroTik’s network devices generated a fair share of the botnet’s traffic. Having analyzed the situation, MikroTik experts found no new vulnerabilities in the company’s routers; however, old ones may still pose a threat. Therefore, to ensure your router has not joined the Mēris botnet (or any other botnet, for that matter), you need to follow a few recommendations. Why MikroTik devices are joining the botnet A few years ago, security research discovered a vulnerability in MikroTik routers : Winbox, a configuration tool for MikroTik routers through which many devices were compromised. Although MikroTik fixed the vulnerability back in 2018, apparently not all users updated their routers. Furthermore, even among those who did, not everyone followed the manufacturer’s additional password-change recommendations. If a user didn’t change the password, then even updated firmware could let attackers log in to the router and start exploiting it again. According to MikroTik , the routers that are now infected with Mēris are the same devices that were compromised back in 2018. The company has published indicators of device compromise and issued recommendations. How to tell if your MikroTik router is part of a botnet When a router joins a botnet, cybercriminals change a number of settings in the device firmware. Therefore, MikroTik’s first recommendation is to look at device configuration and check for the following: A rule that executes the script with the fetch () method. Remove this rule (under System → Scheduler), if present; A SOCKS proxy server enabled. You’ll find the setting under IP → SOCKS ; if you do not use it, disable it; An L2TP client called lvpn, (or any other L2TP client unfamiliar to you). Delete these clients as well; A firewall rule that allows remote access through port 5678. Remove this rule. Recommendations for protecting your MikroTik router Regular updates are a crucial part of any successful defense strategy. Much of keeping a MikroTik network safe is following general network security best practices. Make sure your router is using the latest firmware available, and update it regularly; Disable remote access to the device unless you absolutely need it; Configure remote access — again, if you really need it — through a VPN channel. For example, use the IPsec protocol; Use a long and strong management password. Even if your current password is strong, change it now, just in case; In general, proceed under the assumption  that your local area network is not secure, meaning if one computer gets infected, then the malware can attack the router from inside your perimeter and gain access by brute-forcing passwords. That is why for our part, we strongly recommend using reliable security solutions on all Internet-connected computers."}}
{"https://www.kaspersky.co.in/blog/cryptophishing-in-luno/23236/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-09-01", "source": "www.kaspersky.co.in"}, "text": "Since the advent of cryptocurrency, scammers of every stripe have sought to get rich from stealing virtual coins. With cybercriminals duping both buyers of mining equipment and cryptoinvestors , we spotlight a scam targeting users of the Luno cryptoexchange. About Luno The Luno cryptocurrency exchange has been in existence since 2013, and today it serves more than 5 million clients in 40 countries. Luno’s primary focus is on emerging markets, allowing users from countries such as Singapore, Malaysia, Indonesia, South Africa, and Nigeria to purchase tokens with local currency. Luno is a centralized exchange (CEX), meaning clients’ cryptowallet keys are stored on the exchange. Typically, such sites are well protected against hacking and leakage. However, account protection becomes much harder when owners spill their credentials to cybercriminals. A simple phishing scheme The attackers who targeted Luno did not reinvent the wheel. Rather, they employed the tried-and-true method of playing on people’s desire for free cryptocurrency, sending potential victims e-mail messages, seemingly from the Luno team, saying that an incoming payment has been “placed on hold due to error(s)” in their profile data. The message includes a link for users to follow and solve the problem. Fake incoming transfer notification with link — just not to Luno As per usual with a phishing attack, the scammers forged the sender’s address, making the message look plausible. The strange address of the link lurking under the button, which looks nothing like luno.com and is located in the .ar domain zone (Argentina), might arouse suspicion. If the victim doesn’t notice this discrepancy and simply clicks, the link takes them through a chain of redirects to an illegitimate Luno login page. The fake resource is very similar in design to the real Luno site, but the cybercriminals did not even try to disguise the URL, apparently counting on user carelessness. The fake login page looks like the real one, although with an entirely different URL To keep the cryptoinvestor victim from suspecting anything is amiss, the scammers even set strict security requirements. For example, to log in to the fake site, you need to enter a strong password with the same strict requirements as the official platform. The password requirements on the fake exchange are as strict as on the real Luno site Next, if the victim enters their credentials and tries to log in, the screen will display a 403 Forbidden error, and that’s it, the attackers now have the password — and access to the victim’s cryptocurrency. Error message on the fake exchange How to guard against cryptophishing Phishing remains a viable method of stealing accounts and money on cryptocurrency platforms. That said, knowing a few simple rules will help minimize the risk of getting hooked. Be vigilant. Unexpected messages about large transfers, gifts, and winnings are nearly always a trick; Carefully check the URL in the address bar before entering credentials. Website spoofing is a common phishing technique; Don’t trust links in e-mails. Instead, bookmark the URLs of cryptocurrency wallets, exchanges, and other important services, and open them using your bookmarks; Use a unique password for each cryptocurrency service (and for all other sites and services as well) so that a hack or data leak on one resource won’t affect your other accounts; Install a reliable antivirus solution to protect against phishing. For example, Kaspersky Internet Security ‘s built-in antiphishing and antifraud modules warn users about potentially dangerous sites in good time."}}
{"https://www.kaspersky.co.in/blog/ransomware-five-tips/23223/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-08-27", "source": "www.kaspersky.co.in"}, "text": "Recent years have seen ransomware grow from an abstract curiosity into a major problem anyone can face — and that hundreds of thousands of people already have . Now a mass industry , ransomware even shows a division of labor, with some criminals writing malicious code and others selecting targets and using the code to infect them, earning a percentage of the ransom. In the past couple of years, ransomers have focused increasingly on organizations, but that does not mean ordinary users are in the clear — people still get hit, sometimes even by accident. If you don’t want to lose your photos, documents, and other files, you cannot avoid picking up a few antiransomware skills and habits. What is ransomware? Ransomware is malware that searches a hard drive for user-valuable information (such as documents, tables, images, and databases) and encrypts everything it finds, locking the files. Next, the ransomware displays a message demanding payment to restore the data. If the victim pays, one of several scenarios may play out: Sometimes the attackers actually send the decryption key with instructions; Some attackers simply take the victim’s money and vanish; In some cases, the cybercriminals cannot recover the data even if they want to — some ransomware damages files irrevocably. Ransomware can get onto your computer in a variety of ways. For example, you might plug in an infected flash drive or download something from a shady website. E-mails with dangerous attachments or links to malicious sites are the most common sources of infection. Perhaps the most unpleasant aspect of many ransomware programs is their ability to spread across devices on the same network. That means if your home desktop picks up malware, you can expect an attack on your laptop as well. And one piece of ransomware on a work device can bring all corporate communications to a standstill. What to do if your data gets encrypted If your data gets encrypted, don’t panic. It’s a bad situation, but you may still be able to recover your files : Do not pay. Each ransom payment represents a financial contribution to malware development and a signal to the cybercriminals that the scheme is profitable. And it may not work — you may get nothing even if you comply. Use the Crypto Sheriff service on the No More Ransom website to find out what malware has infected your drive. A decryptor may already exist for it, in which case you can use it to recover your data without spending a dime. No More Ransom , which is supported by Europol and various anticybercrime companies, hosts dozens of decryptors. If you’re unable to find a decryptor for the ransomware that attacked you, keep checking; one might be released any day. How to stay safe from ransomware Now that you know the enemy, it’s time to learn a few information hygiene rules that can help you avoid ransomware. 1. Make backups Regularly save important files and documents to a cloud storage and to an external hard drive. You can limit photo backups to once a week or even every month, but be sure to back up important, current documents every few days or even daily. Backing up your files doesn’t have to be a chore: See our guide to automatic backup . However you decide to back up your data, don’t delay. Having a backup in the event of a ransomware attack — or if the cat walks across the keyboard and deletes your report — means you don’t have to lose any work. For a successful backup, don’t forget a few important rules: Connect the backup hard drive only when you’re writing to or reading from it. Any drive connected to the computer at the time of a ransomware attack will be encrypted as well. Protect access to cloud storage with a strong password and two-factor authentication. 2. Be careful with messages E-mail attachments and infected websites are the most common hiding places for ransomware Trojans, so treat all unexpected e-mails and messages as potential sources of danger. What makes a message suspicious, though? It’s a gray area requiring consideration and judgment. Make sure you know the sender. Treat content, attachments and links in e-mails from strangers with the utmost skepticism. This applies to messages in messaging apps, social networks, and forums as well. If you have any concerns , consign the message to your spam folder, especially if it promises unexpected payouts. To encounter such messages less often, configure spam filtering and mail traffic scanning in your security solution. If you receive a suspicious link or file that you weren’t expecting from someone you do know, contact them by phone or in another format; their account or mailbox may have been compromised. 3. Avoid suspicious websites Not limiting themselves to links in e-mails, cybercriminals employ a formidable array of tricks to dupe victims into downloading malware. If clicking on a banner results in an unexpected Web resource appearing, or the screen prompting you to download something, close the page immediately. You are very likely seeing an infection attempt. 4. Update software in a timely manner To penetrate devices, cybercriminals often exploit known vulnerabilities that developers have already patched. Anyone who doesn’t update their software regularly is at particular risk. Turn on automatic updates wherever possible, and regularly check for updates for apps that don’t update automatically. 5. Install a security solution Modern security solutions can identify and block malware in real time. For example, Kaspersky Internet Security includes a range of tools to protect users against ransomware. Even in the unlikely event that a particularly cunning piece of malware makes it past file antivirus protection, it won’t be able to do much: Kaspersky Internet Security analyzes the actions of running apps and blocks attempts to encrypt files or rolls back the actions of malicious programs if they manage to damage any data."}}
{"https://www.kaspersky.co.in/blog/fmwhatsapp-mod-downloads-malware/23215/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-08-24", "source": "www.kaspersky.co.in"}, "text": "We recently discovered that a version of popular WhatsApp mod FMWhatsApp includes an embedded Trojan. The Trojan, called Triada, downloads other malware to users’ devices. Here’s how it happened and why using modified versions of WhatsApp is dangerous. Why use WhatsApp mods? Not all users are happy with the official WhatsApp app. Some may feel a need for self-destructing messages or, conversely, the ability to view messages another user deleted. Others are after dynamic themes, and still others want to hide certain chats from the general list or automatically translate messages. Naturally, they want these features right away, not when WhatsApp’s developers finally get around to implementing them. As a result, some users turn to the modified WhatsApp clients available online, which are fairly numerous and not hard to find. Fans of mods are not deterred even by WhatsApp’s occasional crackdown on such modifications or the threat of account bans. The creators of WhatsApp mods often embed ads in them — understandably — along with the features users are looking for. Problems arise, however, from their use of third-party ad modules through which malicious code can sneak in under developers’ radar. Triada et al. in the FMWhatsApp mod That’s precisely what happened with FMWhatsApp, a popular WhatsApp mod. In version 16.80.0 the developers use third-party ad module that includes a Trojan. Our mobile antivirus solution detects this malware as Trojan.AndroidOS.Triada.ef. We saw a similar situation in the spring of 2021 with the APKPure unofficial app store, whose developers also used an ad module from an unverified source, thereby infecting their creation , and consequently users, with the Triada Trojan (albeit a slightly different version). As in the case of the infected APKPure, the Triada Trojan in the dangerous version of the FMWhatsApp mod performs an intermediary function. First, it collects data about the user’s device, and then, depending on the information, it downloads another Trojan. Triada’s “extras” come in a variety of flavors — the infected version of FMWhatsApp downloads several types of malware to devices: Trojan-Downloader.AndroidOS.Agent.ic, a Trojan that downloads and runs other malicious modules; Trojan-Downloader.AndroidOS.Gapac.e, which downloads and runs other malicious modules and can also display full-screen ads at unexpected moments; Trojan-Downloader.AndroidOS.Helper.a, which downloads and runs the installer module of the xHelper Trojan and runs invisible ads in the background; Trojan.AndroidOS.MobOk.i, a Trojan that signs up for paid subscriptions; Trojan.AndroidOS.Subscriber.l, another Trojan that signs up for paid subscriptions; Trojan.AndroidOS.Whatreg.b, the most complex Trojan in the list, signs in to the WhatsApp account on the victim’s phone, intercepting the login confirmation text. The device can then become a site for various types of illegal activity such as spam distribution or illegal trading. Our Securelist post delves more into the FMWhatsapp mod’s Triada Trojan. How to defend against such attacks Practicing caution and using your device safely is key to keeping malware and other mobile nasties off your phone. Generally speaking, follow these tips to avoid trouble: Avoid installing apps from unofficial sources and use your device’s settings to deny permission to install them. (If you need to install an app not from an official store, temporarily enable that permission and then disable it again); Use only official messaging apps, and download them only from official app stores — they may lack some features, but will not flood your phone with viruses; Check what permissions you’ve granted to installed apps — some might pose a real threat ; Install a reliable mobile antivirus app on your phone, and heed its warnings."}}
{"https://www.kaspersky.co.in/blog/malware-in-pirated-games-2021/23213/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-08-23", "source": "www.kaspersky.co.in"}, "text": "So long as gamers seek out free apps in the form of unlicensed copies, cracks, and other goodies, cybercriminals will continue to prey on them, and we will continue to spotlight the dangers gamers face. Here are some we’ve found over the past year. Cyberattacks on gamers Our experts took a look at how cybercriminals made money from gamers who skimped on both gaming and security, ending up with unexpected apps along with (or instead of) the games they thought they were downloading. Want some ads? Perhaps the most common surprise greedy gamers find in their popular games is adware. Although not usually too harmful, adware can be very annoying. With this uninvited guest on their computer or smartphone, users will constantly be closing banners, pop-up videos, and browser pages they didn’t open. Cryptomining, a timeless threat In the hierarchy of bad stuff users might get with pirated games, cryptominers rank far higher than adware. Gamers, with their souped-up computers and brawny video cards, make ideal targets for cryptocurrency freeloaders — and a miner concealed inside a game with high system requirements can go unnoticed for quite some time, during which the computer is working for a malicious third party. Swarez: Danger at the top of search results Most gamers know that the place to get official games is a specialized store such as Steam. But for a “Minecraft crack” or “virus-free FIFA,” they turn to search engines. Cybercriminals take advantage of this, creating websites offering free keys, cracks, and unlocked versions of games; adding Trojans; and pushing them onto the first page of search results. Alternatively, they can load infected, pirated copies onto existing warez sites. That is how the Swarez loader gets distributed. Users who try to download, say, cracks for Minecraft get sent through a long chain of redirects to a page with a ZIP archive, inside of which is another password-protected ZIP and a text file with a key. Unzipping the archive loads Swarez on the unfortunate gamer’s device, where it proceeds to download Taurus spyware, a Trojan that takes screenshots and steals cryptowallets, desktop files, and passwords and other data stored in browsers. Fake Minecraft targets Android users Minecraft remains very popular cyberattack bait, including on smartphones and tablets. Back in 2020, we found more than 20 malicious apps on Google Play disguised as mods for the game, and this year saw a repeat . The game also serves as a front for Hqwar malware, which reports an installation error and prompts the user to uninstall the app. In fact, that removes only the icon; the malware remains, working in stealth mode to harvest online bank credentials. Vesub Trojan disguised as Brawl Stars and PUBG Another example of cunning malware, Vesub, hides in pirated versions of Brawl Stars and PUBG for Android. When run, the malware appears to load very slowly — and then, nothing. The victim, seeing the game is not working, quits. The icon disappears from the screen at that point, but the Trojan remains on the device and gets to work. What’s actually happening during that fake startup is data collection: Vesub collects system data and receives further instructions. Then, running in the background, it can subscribe the victim to paid services, send text messages from their smartphone, play YouTube videos, visit app pages on Google Play, and open advertising websites. And then there’s phishing By now you should understand quite well that downloading pirated games is far more trouble than it’s worth. If so, your gaming experience just became a lot safer. However, you should know about another way cybercriminals exploit gamers’ quest for freebies: offering bundles of games at a 99% discount, promising mountains of free or near-free in-game currency, and inviting players to take part in nonexistent tournaments. Hiding behind famous titles — from FIFA 21 and Apex Legends to GTA Online and Pokemon Go — cybercriminals scoop up victims’ e-mail addresses, social network names and login credentials, and game info. Even without passwords, such information fetches a price on the dark web . Need we state that by entering your password on an unofficial site, you run the risk of losing your account? Even worse is if the victim, asked for payment card details for “verification,” agrees. What happens next, you know only too well. How to get games risk-free The risks gamers face are neither new nor particularly unusual. Although gamers appear to be a relatively risk-tolerant group, you can practice safe gaming by following some commonsense tips: Buy games (yes, buy them) from official stores only. You can still save money on video games , and you need not walk into traps. For example, publishers hold sales regularly and even host the occasional giveaway. By waiting for official discounts, you not only minimize the chance of a run-in with malware, but also support the developers and get the latest patches for your favorite games in good time. Be careful when downloading games. Cybercriminals often promote malicious pages that appear to be well-known online stores. Unfortunately, you cannot trust search engines completely, here. Just download the platform’s official app (if it has one), bookmark its website, or enter the URL manually. Follow our simple security guide for buying loot boxes or other virtual goods: One rule, for example, is never to trust shady sites offering cheap unique skins, weapons, and so forth. Check the security settings of services you use, and see our how-to guides for protecting accounts on Steam , Battle.net , Origin , Discord , Twitch , and other platforms . Install a reliable antivirus solution on your computer and smartphone, and never disable it. Contrary to popular myth, antivirus software does not cause game slowdown , especially if you configure it correctly."}}
{"https://www.kaspersky.co.in/blog/instagram-ban-attacks/23205/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-08-19", "source": "www.kaspersky.co.in"}, "text": "If you run a popular blog and promote your business through Instagram, an account ban simply isn’t in the plan. For responsible users, the idea of being banned for, say, displaying suicidal content or trying to impersonate someone else might seem like a bad dream or a cruel joke, but it’s quite real for victims of the new wave of so-called ban attacks. Here’s how these attacks work, how to defend against them, and what to do if your account has been hit. How cybercriminals block Instagram profiles It’s all quite simple: Detractors or competitors can pay a fee (the amount depends on the seller or even the number of followers) to have your profile blocked. Such attacks began last fall , but of late they’ve become particularly high-profile. Recently, online magazine Motherboard connected with a cybercriminal group and learned how they exploit Instagram’s policy to make money through ban-as-a-service offerings . The group’s favored tactic is the fake impersonation complaint, which involves verified accounts, identifiable by the blue check next to the username. The attackers use verified accounts to create a full copy of the victim’s profile, right down to the avatar and description. Then they file a complaint against the original, accusing the owner of impersonation. If the victim’s account is not verified, the support service bans the victim. The second blocking method is to inundate tech support with messages alleging that the victim’s profile contains images of suicide or self-mutilation. In many cases, Instagram takes the easier path, blocking accounts on the basis of such complaints without first checking their actual content. Unlike phishing and other similar schemes that still require action from the victim — clicking a dangerous link, for example — a ban attack works with no victim participation whatsoever. The target, who might never even dream of violating the terms of use, simply finds their account blocked. According to the Motherboard reporters, the service is inexpensive, running about $5 to $60, so the cybercriminals have no shortage of customers. However, not all users who abuse Instagram’s moderation practices are in it to make money. Malicious scripts are freely available, and any online hooligan can use them to settle a personal score or silence a disagreeable blogger. Instagram unblocking for a fee In fact, blocking Instagram accounts opens up another money-generating avenue: restoring them. Unblocking carries a far higher fee than blocking — reportedly up to $3,500–$4,000. Whether the same people are behind the banning and the unblocking services, or whether it’s an accidental symbiosis, remains unclear for now. Some users do receive an offer to reinstate their account just a few minutes after the blocking, however, and those offers often come from followers of the accounts from which the original complaints came. What to do if your Instagram profile gets blocked If you’re already the victim of a ban attack, contact Instagram support immediately with an explanation of what happened. Bans are appealable only through the app . To do so, you will need to enter your username and password, then follow the instructions. If anyone comes knocking with an offer to restore your account for money, don’t pay! First, you have no guarantee that anything will come of it. Second, doing so supports confirmed miscreants — perhaps even the ones who got your account banned in the first place. Third, the official recovery procedure through Instagram support is free. How to protect your Instagram profile Unfortunately, users tend to learn about a ban attack only after the fact. Instagram told Motherboard that it plans to sniff out cybercriminal accounts on the platform, and asks users to report any suspicious activity, but that approach is time-consuming. In the meantime, we suggest you take some measures to protect yourself. Verify your account The ban-attack business centers on accusations of impersonation, so the best way to protect yourself is to convince Instagram that you are you before anything happens. In other words, you should verify your account now. The social network won’t check every user, but you may have some points in your favor. For example, if you or your business has been mentioned in multiple news sources , that helps. To get the coveted blue check mark, you’ll want to complete your profile and delete any old accounts to avoid arousing suspicion. Naturally, the account must also be public and not violate Instagram’s terms of use. Once you’ve ensured your account is ready, send a verification request . You can do it directly through the app: Go to your profile settings; Select Account ; Select Request Verification ; Enter your full name and attach required documentation; Follow the subsequent instructions. Make your account private What if you’re not famous enough to pass blue-check verification? You can take the radical step of closing your account to the public. If you make your account private, then your posts, photos, and videos will be available only to subscribers, which means that an attacker won’t be able to copy them and accuse you of impersonation. Whether in the app or a browser, it is not difficult to make your account private. See our post on setting up Instagram security and privacy for detailed instructions. Be sure to take the trouble to clean up your list of followers as well, and check future follower requests before accepting them. Bots and other barely there accounts can hide attackers, and you’re under no obligation to let them in. Change your profile pic For business profiles that you cannot close but that aren’t well-known enough for verification — or that you feel you must keep open for any other reason — there’s another way to reduce the risk of ban attacks: Change your avatar. Fake impersonation complaints work best on profiles with a real photo of the owner. Some underground ban-attack services even refuse to target accounts with other avatars. That means putting up something that isn’t your portrait complicates attempts to do harm; every bit helps. Maintain a backup and update contact information Instagram admins do what they can to combat wrongful complaints, but they’re working against cybercriminals who continually improve their money-making schemes. In a perfect world you wouldn’t have to, but here and now, you should prepare an escape route. First, make sure you have access to the e-mail address and phone number linked to your profile. If your account is wrongfully blocked, you can use them for recovery. Second, save your content regularly. That way, if worse comes to worst, you can use it to migrate to a new account."}}
{"https://www.kaspersky.co.in/blog/spam-with-vishing-phone-numbers/23140/": {"metadata": {"dateAccessed": "2021-11-21", "dateCreated": "2021-08-06", "source": "www.kaspersky.co.in"}, "text": "With the colossal amount of telephone scamming these days, you’d be hard-pressed to find a phone owner anywhere on the planet who hasn’t been a scammer’s target at least once . But like all forms of cold calling, phone scams are resource-intensive and highly inefficient. Therefore, some scammers try to optimize the process by getting potential victims to call them. One tool they use is good old-fashioned spam. “If you didn’t make this purchase, please call us” We recently detected several waves of spam e-mails, seemingly from reputable companies, notifying recipients of substantial purchases. The item in question is usually a high-end device such as the latest Apple Watch or a gaming laptop purchased from Amazon or paid for through PayPal. Fake PayPal/Amazon purchase confirmations with vishing phone numbers Other, more exotic variants crop up from time to time. For example, we detected an e-mail about the purchase of $1,999 worth of “Cryptocurrency (Bitcoin)”: Fake PayPal notification, including the scammers’ phone number, of a “Cryptocurrency (Bitcoin)” purchase Other, similar notifications mention the purchase of security software licenses — we’ve seen some referring to Norton and even Kaspersky (although our product lineup has never included a “Kaspersky Total Protection.”) Fake notifications about the purchase of Norton and “Kaspersky Total Protection” licenses with vishing phone numbers The scam relies on recipients being so alarmed by the not-insubstantial loss that they will act rashly, hoping to get their money back. Of course, their money hasn’t gone anywhere — at least, not yet. This particular strain of spam e-mails contain no links, but they do include a phone number that the victim is asked to call if they want to change or cancel the order. Sometimes the number sits unobtrusively somewhere at the bottom of the text. Other times it is highlighted in red and repeated several times in the message. What happens if you call? Most likely the scammers will try to wangle your login credentials for some financial service or bank card details. Alternatively, they might try to trick you into transferring money or even installing a Trojan on your computer, which has been known to happen . The only limits are the scammers’ imagination and vishing skills. How to guard against such e-mails The particulars may change, but all scams have certain elements in common: the use of some sort of trick to get someone to do something. Vishing is no different. Follow these guidelines for safety: Do not call back; Log in to your account with the service in question — type the address into your browser; don’t click on any links in the message — and check your orders or recent activity page; Check your balance and the list of recent transactions on all of your cards, if you have reason for concern; Install a reliable antivirus utility with protection against financial attacks, phishing, and online fraud."}}
{"https://www.kaspersky.co.in/blog/online-scam-red-flags/23771/": {"metadata": {"dateAccessed": "2022-01-06", "dateCreated": "2021-12-22", "source": "www.kaspersky.co.in"}, "text": "No one — gamer , cryptocurrency investor , or online shopper — is safe from scammers. But no matter who the victim is or how sophisticated the scheme may be, there is always a way to sniff out fraud before it’s too late. Today we’re looking at five common signs of online scams to help you avoid danger. 1. Stick or carrot Scammers often play on greed or fear. In the first case, they promise a potential victim the moon and the stars — for example, a large government payout or free cryptocurrency . The second involves intimidation, such as a threat to send a video of the victim watching porn to all of their contacts or to ruin the reputation of their company’s website . In both cases, cybercriminals are trying to short-circuit their victim’s ability to respond rationally. If, after reading such an e-mail, you feel inclined to do exactly what the sender asks (follow a link, send money, call a number, etc.), that’s actually a warning sign. Take a deep breath and read the message again. Most likely, you’ll see it for what it is — a trick. 2. Ticking clock If emotionally charged situations can cause people to lose the power of critical thinking, then being in a hurry only heightens the problem. Scammers exploit that as well, for example by setting tight deadlines. If a message says you have only a couple of days, hours, or even minutes to claim a prize or buy sought-after equipment before it sells out, again, it’s probably a scam. 3. Amateurish design Obvious errors in the message are another red flag. Some may be intentional misspellings or substitution of letters with similar-looking numbers or optical counterparts from other alphabets so as to fool spam filters . In some cases, the sender might simply be illiterate, which is not uncommon among scammers, as opposed to employees of respectable organizations. Whatever the reason for the typos, promises of “0ne мilIion d0llars” are a sure sign of danger. 4. Searching the database When a potential victim goes to a fraudulent website from an e-mail or chat message, the scammers usually try to draw them in through a series of simple tasks. They might involve taking a short survey or selecting a number of boxes supposedly containing prizes, for example. Quite often, the victim is shown an animation supposedly indicating a database search (for their prizewinning status, for example) or asked to fill out a form. Sometimes they might be invited to read (fake) reviews or comments from “past winners.” More recently, we’ve seen chats with a bot posing as a lawyer, consultant, or support employee. Regardless of the details, the overall purpose is simple and clear: Getting the person to invest a bit of time and effort keeps them on the page, and the more invested they feel, the less likely they are to close the page when it asks for payment, which it certainly will. Feel like a website promising a big payday is playing for time? Probably not a good sign. 5. Small fee Another favorite trick after hooking a victim is to request a small fee , a transfer for card verification purposes or payment for registration in some database. Without it, the scammers insist, it will not be possible to receive the promised reward. The asked-for amount is usually quite small and insignificant against the prospect of untold riches, and may even come with an assurance of payback at a later date. This fee is the first thing that gets stolen, of course. There will be no prize, only the likelihood of losing even more after sharing credit card details with the scammers. To be continued Cybercriminals are constantly inventing new ways to monetize your trust and weaknesses. Simply by looking for these five red flags, you can avoid falling prey to most scams. We will, of course, continue to keep you posted on how to protect yourself, your data, and your money from intruders."}}
{"https://www.kaspersky.co.in/blog/log4shell-critical-vulnerability-in-apache-log4j/23739/": {"metadata": {"dateAccessed": "2022-01-06", "dateCreated": "2021-12-11", "source": "www.kaspersky.co.in"}, "text": "Various information security news outlets reported on the discovery of critical vulnerability CVE-2021-44228 in the Apache Log4j library (CVSS severity level 10 out of 10). Millions of Java applications use this library to log error messages. To make matters worse, attackers are already actively exploiting this vulnerability. For this reason, the Apache Foundation recommends all developers to update the library to version 2.15.0, and if this is not possible, use one of the methods described on the Apache Log4j Security Vulnerabilities page . Why CVE-2021-44228 is so dangerous CVE-2021-44228, also named Log4Shell or LogJam, is a Remote Code Execution (RCE) class vulnerability. If attackers manage to exploit it on one of the servers, they gain the ability to execute arbitrary code and potentially take full control of the system. What makes CVE-2021-44228 especially dangerous is the ease of exploitation: even an inexperienced hacker can successfully execute an attack using this vulnerability. According to the researchers, attackers only need to force the application to write just one string to the log, and after that they are able to upload their own code into the application due to the message lookup substitution function. Working Proofs of Concept (PoC) for the attacks via CVE-2021-44228 are already available on the Internet. Therefore, it’s not surprising that cybersecurity companies are already registering massive network scans for vulnerable applications as well as attacks on honeypots. This vulnerability was discovered by Chen Zhaojun of Alibaba Cloud Security Team. What is Apache Log4J and why is this library is so popular? Apache Log4j is part of the Apache Logging Project. By and large, usage of this library is one of the easiest ways to log errors, and that is why most Java developers use it. Many large software companies and online services use the Log4j library, including Amazon, Apple iCloud, Cisco, Cloudflare, ElasticSearch, Red Hat, Steam, Tesla, Twitter, and many more. Because of the library being so popular, some information security researchers expect a significant increase in the attacks on vulnerable servers over the coming days. #Log4Shell pic.twitter.com/1bKDwRQBqt — Florian Roth ⚡️ (@cyb3rops) December 10, 2021 Which versions of the Log4j library is vulnerable and how can you protect your servers from attack? Almost all versions of Log4j are vulnerable, starting from 2.0-beta9 to 2.14.1. The simplest and most effective protection method is to install the most recent version of the library, 2.15.0 . You can download it on the project page . If for some reason updating the library is not possible, Apache Foundation recommends using one of the mitigation methods. In case of Log4J versions from 2.10 to 2.14.1, they advise setting the log4j2.formatMsgNoLookups system property, or setting the LOG4J_FORMAT_MSG_NO_LOOKUPS environment variable to true . To protect earlier releases of Log4j (from 2.0-beta9 to 2.10.0), the library developers recommend removing the JndiLookup class from the classpath: zip -q -d log4j-core – *. Jar org / apache / logging / log4j / core / lookup / JndiLookup .class . In addition, we recommend to install security solutions on your servers — in many cases this will allow you to detect the launch of malicious code and stop the attack’s development."}}
{"https://www.kaspersky.co.in/blog/spring4shell-critical-vulnerability-in-spring-java-framework/24004/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-04-01", "source": "www.kaspersky.co.in"}, "text": "Researchers have discovered a critical vulnerability CVE-2022-22965 , in Spring, an open source framework for the Java platform. Unfortunately, details about the vulnerability were leaked to the public before the official announcement was published and the relevant patches were released. The vulnerability immediately attracted attention of information security specialists, as it potentially poses a serious threat to many web applications. In resemblance to the overhyped Log4Shell , the new vulnerability was named Spring4Shell. The creators of the VMware Spring framework have already released patches to fix vulnerable applications, so we recommend that all companies using Spring Framework versions 5.3 and 5.2 immediately upgrade to versions 5.3.18 or 5.2.20. What is Spring4Shell and why this vulnerability is so dangerous? The vulnerability belongs to the RCE class, that is, it allows an attacker to remotely execute malicious code. At the moment, according to the CVSS v3.0 calculator , its severity is 9.8 out of 10. The vulnerability affects Spring MVC and Spring WebFlux applications running under Java Development Kit version 9 or later. Researchers reported the discovered vulnerability to VMware on Tuesday night, but already on Wednesday proof of concept for the vulnerability was published on GitHub. The PoC was quickly removed, but not until it was noticed by security experts (some of whom confirmed the danger of the vulnerability). And it’s very unlikely that such a potent exploit has gone unnoticed by cybercriminals. The Spring framework is quite popular among Java developers, which means that potentially many applications could be vulnerable. According to a post by Bleeping Computer , Java applications vulnerable to Spring4Shell could become a cause of compromise for a huge number of servers. Moreover, according to the same post, the vulnerability is already being actively exploited in the wild. Conditions for exploiting a Spring4Shell vulnerability The only Spring4Shell exploitation method known at the time of publication requires a specific confluence of circumstances. For the exploit to be successful, the following components should be utilized on the attacked side: Java Development Kit version 9 or later; Apache Tomcat as a servlet container; WAR (Web Application Resource) file format instead of default JAR; Dependencies on spring-webmvc or spring-webflux; Spring framework versions 5.3.0 to 5.3.17, 5.2.0 to 5.2.19, or older. However, it’s quite possible that there are more yet unknown options of exploitations and the very same vulnerability can be exploited in some other way. How to protect yourself from Spring4Shell The main advice for anyone who uses the Spring framework is to upgrade to secure versions 5.3.18 or 5.2.20. The Apache Software Foundation has also released patched versions of Apache Tomcat 10.0.20, 9.0.62, and 8.5.78, in which the attack vector is closed on the Tomcat side. The Spring developers have also released patched versions of the Spring Boot 2.5.12 and 2.6.6 extensions that depend on the patched version of Spring Framework 5.3.18. If for some reason you cannot update the above software, then you should use one of the workarounds published on the official Spring website."}}
{"https://www.kaspersky.co.in/blog/chrome-ten-high-severity-vulnerabilities/24000/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-03-31", "source": "www.kaspersky.co.in"}, "text": "Google has fixed 28 vulnerabilities by releasing update 100.0.4896.60 for its Chrome browser. At least 9 of them have a high severity rating — adding to CVE-2022-1096, another high severity vulnerability which Google patched with a separate update just a few days ago. So in total, the Chrome developers have released patches for 10 high severity vulnerabilities in less than a week. In other words, if you have not rebooted your computer for quite some time or did not restart your browser recently, then it’s time to update. CVE-2022-1096 vulnerability So far Google has not published details about any of the vulnerabilities — as per the company’s security policy, access to a detailed description of the bugs remains restricted until the majority of active users update their browser. But it is already clear that it is the CVE-2022-1096 vulnerability (the one that Google closed with a separate patch on Friday, March 25, just four days before the major update) that may cause real problems. CVE-2022-1096 belongs to the Type Confusion class, that means it is connected to some error in data types handling in the V8 engine. The vulnerability is pretty dangerous, judging by the fact that Google addressed this bug separately with an emergency patch. What’s more, according to the patch release notes, Google was aware that an exploit for this vulnerability already existed on March 25. The next day, Microsoft fixed the same vulnerability in its Chromium-based Edge browser. Summing up the available information, it is reasonable to assume that an exploit for the vulnerability not only exists, but is actively being used by attackers. Another 28 new vulnerabilities Of the 28 vulnerabilities that the latest update addresses, most (20) were discovered by independent researchers, and the remaining eight by Google’s internal experts. Of the nine vulnerabilities with a high severity level, four (CVE-2022-1125, CVE-2022-1127, CVE-2022-1131, CVE-2022-1133) belong to the use-after-free class; three more (CVE-2022-1128, CVE-2022-1129, CVE-2022-1132) are related to inappropriate implementations in various components, another one (CVE-2022-1130) has to do with an insufficient validation of untrusted input in WebOTP and the remaining one (CVE-2022-1134), like the aforementioned CVE-2022-1096, is a Type Confusion problem in V8 engine. How to stay safe? First, you need to update your browser to the latest version — at the time of this writing, it is 100.0.4896.60. If your version of Chrome is older, that means your browser has not been updated automatically and we recommend updating it manually using our step-by-step instructions . If you use Microsoft Edge, then don’t forget to update it too — this is done in the same way as with Google Chrome. We also recommend that you to follow the news and timely update the most critical programs , including security solutions, browsers, office suites and the operating system itself. In addition, we recommend using reliable security solutions that can automatically detect and prevent attempts to exploit vulnerabilities, so you can protect yourself from attacks even before official patches are released."}}
{"https://www.kaspersky.co.in/blog/cities-skylines-malicious-mods/23993/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-03-28", "source": "www.kaspersky.co.in"}, "text": "On February 13, 2022, EuroGamer published a post reporting the spread of malicious code among users of the Cities: Skylines game. Two days later, the article was updated: nobody was adversely affected, but one of the game mod creators tried to sneak a backdoor into the official store. We looked into this interesting case of a potentially serious attack on gamers. About Cities: Skylines in brief We apologize in advance to fans of the game, but for everyone else, we think it is necessary to provide a brief description — it’s important for the story. Cities: Skylines is a city simulator, and it looks something like this: Screenshot from Cities: Skylines. Source Cities: Skylines is a competitor and in some ways a successor to the famous SimCity series from the 1990s and 2000s, whose history (so far) ended with a failed release in 2013. Cities: Skylines was released in 2015 — quite a long time ago by standards of the ever-changing online world, but fans are unlikely to be scared by this. Instead of releasing a new series, the creators of Cities: Skylines preferred an approach with gradual modification of the original game, releasing official expansion packs about every six months. The 13th release came out just recently. Each of these expansions adds new elements to the virtual world. It may be buildings (you can now build an airport of your own design), natural phenomena, development scenarios (“green” city), and so on. Unofficial modifications expand the game even more. In fact, any player who seriously enjoys Cities: Skylines , will eventually start experimenting with mods. The game was originally designed to make it easy for users to develop and share modifications. Anybody can upload them to the public Steam Workshop directory . With our without mods and addons, Cities: Skylines allows you to build your own city. Divide the land between housing, industry, and commerce. Plan roads and fight traffic jams. The game is so good and so realistic that people even used it to plan the transportation system of a real city! An example of a good mod for Cities: Skylines is Traffic Manager: President Edition . It adds fine-tuning to the game’s basic road construction features: you can fine-tune traffic lights, set lane direction and speed limits, prohibit parking, and so on. Basically, the mod enables you to do things that are essential for traffic improvement, both in real life and in the game. To summarize, you can play Cities: Skylines without extensions, but few fans do it, because a properly chosen set of mods both seriously improves game play and makes it more convenient. To make a long story short, if you want the full Cities: Skylines experience, use mods. Vengeance mods Now let’s go directly to events. On February 10, 2022, the creators of the aforementioned Traffic Manager: President Edition mod published a warning about malicious extensions for the game: The creators of Traffic Manager: President Edition accuse the author of other mods of distributing malware. Source The malicious functionality was relatively harmless: the extension randomly changed the speed limits on roads in the game. And not for all users, but only for those who were “lucky” enough to be in the mod creator’s list. This list includes the developers of Traffic Manager, the creators of the game, and other people that the list creator had real or imaginary complaints about. But that’s not all. In the same post, the creator of the mod known as Chaos or Holy Water intentionally broke compatibility with other mods. As Cities: Skylines has a huge number of modifications, it needs a mechanism that prevents mod-related bugs in the game. The game creators settled for very simple compatibility check: they expect the mod developer to check everything themselves, and add incompatible extensions to a special list. Chaos/Holy Water took advantage of this feature, and started adding other popular extensions to the incompatibility list of their own mods. When users asked the creator why the mod was incompatible with other extensions, and what to do, they referred to the poor quality of code from other developers, and offered their own version of another extension, slightly modifying the original. That is how Chaos tried to popularize their modifications and increase the number of their own add-ons for each user. If the developer was criticized, Chaos/Holy Water retaliated by adding the Steam platform’s IDs of critics to their personal “enemies list,” which introduced arbitrary bugs in the game’s performance. There was some interesting internal drama among active fan players, but nothing serious enough to call it a real malicious attack. But wait — that’s not all! Hundred percent backdoor On February 14, 2022, the developers of Cities: Skylines published their description of the incident. It reports that the author’s extensions have been removed from the Steam Workshop site. The creators of the game insist that there was no malicious code in them. Clarifying, “No keyloggers, viruses, cryptocurrency mining software, or similar” was found. But further down in the text, there is a brief mention of the “Update from GitHub” extension by the same author. And what did this mod do? — it switched the add-on update mechanism from standard (via Steam Workshop) to an alternative one, updating mods directly from the creator’s repository on GitHub. And this is a real backdoor: users who installed this modification along with a couple of other modifications by the same creator could’ve ended up downloading and running arbitrary code at any time. In a situation like this you can only rely on the conscience of the extension creator (although given the “enemies list,” this is clearly a bad idea). Even if the backdoor creator does not plan to hack users of their mods, access to their GitHub account can be stolen or they can sell their account themselves (as often happens, for example, with browser extensions). Finally, if a mod is already installed, user will most likely need to remove it manually, but not everyone may get round to that. Fortunately, according to Cities: Skylines developers, only 50 people have been affected this time. How to protect yourself from dangerous game mods There are plenty of ways to get a user to download malware under the guise of an “official” program or game. But with custom extensions, things are more complicated: by definition, they are created in a “home-made” manner, and the developer of the game cannot control all the modifications. Therefore, as you expand the capabilities of your favorite game, be vigilant. Try to install mods from official sources, if possible. And if the mod creator advises you “in case of problems, disable your anti-virus,” think twice before doing so. The incident with the mods for Cities: Skylines ended, thankfully, without too much drama. The malicious developer was banned, and it seems they had no intention of causing serious damage to players. But they created a rather complex mechanism of penetration users’ computers that exploited peculiarities of the community. And most importantly, they tried to bring users out from the control of the official platform for distributing mods. In a worst-case scenario such a backdoor could be used to deliver malicious code that, for example, would steal passwords from the game service or mine cryptocurrency on player’s computer. Tracking the activity of such “shapeshifter programs” is standard functionality of any reliable security solution. On top of that our Kaspersky Security Cloud also features a special gaming mode that provides protection with a minimal impact to computer’s performance. So when experimenting with your favorite game, don’t forget about taking precautions."}}
{"https://www.kaspersky.co.in/blog/mobile-malware-2021/23989/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-03-25", "source": "www.kaspersky.co.in"}, "text": "We continuously monitor the mobile threat landscape to keep you informed of the most important trends. Not long back, we published a report about the threats facing smartphone and tablet owners in 2021. First the good news: a major takeaway is that last year we saw a significant decrease in mobile threat activity compared to 2020. However, with that said — it’s too early to relax. For one thing, the number of attacks on smartphones and tablets fell only relative to the record high of 2020, and remained at around the same level as in 2019. For another, cybercriminals are becoming increasingly inventive. Adware attacks One of the trends in 2021 was the introduction of malicious code in third-party ads modules, which developers of various useful apps often plug in to monetize their work. For example, last spring cybercriminals used a malicious advertisement SDK to infect APKPure, a popular alternative Android app store. Fortunately, its developers took security seriously, and released a clean version a day after we got in touch with them. A similar story happened with the popular WhatsApp mod FMWhatsApp: one of the versions of the app harbored the Triada Trojan inside an advertisement SDK. This Trojan is infamous for being very difficult to remove from an infected device. Moreover, Triada rarely comes alone and tends to download a bunch of other malicious apps onto the victim’s device. Malware on Google Play We’ve already written more than once that malware can sneak into official app stores . To pass all checks and get to through to users, cybercriminals employ all sorts of tricks, such as loading malicious code into an approved program in the guise of an update. In 2021, loaders for various Trojans were found in apps on Google Play, which included the Joker and Facestealer malware. Joker stealthily takes out paid subscriptions for the user, while Facestealer, as the name suggests, specializes in stealing Facebook credentials. In most cases, to spread their creations via Google Play, cybercriminals add tiny injections of malicious code to an otherwise harmless apps that have been already approved by the store. For example, the authors of the Joker Trojan took advantage of the popularity of the Korean TV series Squid Game to hide the malware in an app that offered themed wallpapers. When Joker was discovered, there were more than 200 apps dedicated to the series on Google Play, and many of them borrowed features from each other. Unsurprisingly, when scanning such programs, the store moderators let a malicious “upgrade” sneak past. Small injections of malicious code are hard to detect during moderation, which cybercriminals constantly try to exploit. One of the apps in Google Play that contained Joker Trojan Bankers — creative theft For several years now, banking Trojans have been hunting, not just for bank accounts but also for accounts in online stores and other digital services. In 2021, their area of interest widened even further: our experts discovered the Gamethief malware, which steals login data for the mobile version of the game PlayerUnknown’s Battlegrounds (PUBG). This is the first mobile Trojan that specializes in stealing gaming accounts — just a few years ago, this type of malware was exclusive to desktop computers. Cybercriminals also improved the functionality of their creations. For example, the Fakecalls banking Trojan is capable of dropping the call if the user tries to contact their bank, and replacing it with a pre-recorded response of a fake bank representative. That way, the malware lulls the victim into thinking that a bank employee answered the call. How to protect your smartphone from malware Cybercriminals are resourceful and take every opportunity to prey on mobile device users. So, regardless of their activity level, it pays to be alert. Download apps only from official sources. True, this is not a 100% security guarantee, but there are far less malicious programs in official stores, and even when malware slips through moderation it usually gets removed from the store relatively quickly. Whenever possible, use apps from trusted developers with a good reputation to minimize the chances of encountering malware. Ignore apps that promise payouts you’ve never heard of or overly generous prizes. It’s almost bound to be a scam. Don’t give apps permissions they don’t need to work. Most malware will not be able to deploy fully without potentially dangerous permissions , for example, access to Accessibility, access to text messages and installation of unknown apps . Use a reliable mobile antivirus that will detect and block malware that tries to get inside your phone."}}
{"https://www.kaspersky.co.in/blog/okta-hack-consequences/23978/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-03-22", "source": "www.kaspersky.co.in"}, "text": "Hackers belonging to the LAPSUS$ cybercrime group have published screenshots, allegedly taken from inside Okta’s information systems. If the claims are true, they have access not only to the company’s website, but also to a number of other internal systems, including quite critical ones. LAPSUS$ claims that they did not steal any data from the company itself, and that their targets were mainly Okta’s customers. Judging by the dates on the screenshots, the attackers had access to the systems as early as January 2022. What is Okta and why could the breach be so dangerous? Okta develops and maintains identity and access management systems. In particular, they provide a single sign-on solution. A huge number of large companies employ Okta’s solutions. Kaspersky Lab experts believe that the hacker’s access to Okta’s systems can explain a number of the rather high-profile data leaks from large companies, for which hackers from LAPSUS$ have already claimed responsibility. How cybercriminals gain access to Okta’s systems? At the moment there is no conclusive evidence that the hackers really gained access. According to an Okta’s official statement , its specialists are currently conducting an investigation and the company promises to share details as soon as the investigation is completed. It is possible that the published screenshots are related to the January incident, when an unknown actor tried to compromise the account of a technical support engineer working for a third-party subcontractor. Updated on March 23, 2022: LAPSUS$ has published their reply to Okta’s official statement in which they accuse the company in attempts to downplay the impact of the breach. Who are the LAPSUS$ group and what do we know about them? LAPSUS$ gained fame in 2020 when they compromised the Brazilian Ministry of Health’s systems. Presumably, this is a Latin American hacker group that steals information from large companies for ransom. If the victims refuse to pay, the hackers publish the stolen information on the Internet. Unlike many other ransomware groups, LAPSUS$ does not encrypt the data of hacked organizations, but simply threatens to leak the data in case of non-payment of the ransom. Notable victims of LAPSUS$ include Nvidia, Samsung and Ubisoft. In addition, they recently released 37 GB of code believed to be related to internal Microsoft projects. How to stay safe? At the moment it is impossible to say with absolute certainty that the incident really happened. The publication of screenshots in itself is a rather strange move that may be aimed at self-promotion of the hackers, an attack on Okta’s reputation, or an attempt to hide the real method by which LAPSUS$ gained access to one of Okta’s clients. That said, to play it safe our experts recommend Okta’s clients to employ the following protective measures: Enforce especially stringent monitoring of network activity and in particular of any activity related to authentication in internal systems; Provide staff with an additional cybersecurity hygiene training and prepare them to be alert and report on any suspicious activity; Perform a security audit of your organization’s IT infrastructure to reveal gaps and vulnerable systems; Restrict access to remote management tools from external IP addresses; Ensure that remote control interfaces can only be accessed from a limited number of endpoints; Follow the principle of offering staff limited privileges and grant high-privileged accounts only to those who need this to fulfil their job; Use ICS network traffic monitoring, analysis and detection solutions for better protection from attacks potentially threatening technological process and main enterprise assets. Companies that do not have the internal resources to monitor suspicious activity in their IT infrastructure can employ the external experts ."}}
{"https://www.kaspersky.co.in/blog/metamask-wallets-scam/23972/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-03-22", "source": "www.kaspersky.co.in"}, "text": "Cryptocurrency scams have long been around. In the hope of getting hold of cryptocurrency in others’ accounts, cybercriminals tempt victims with free transfers , bitcoin giveaways , other people’s credentials and scarce mining equipment . Today we look at another fraudulent scheme, this time targeting owners of MetaMask cryptowallets. What is MetaMask? MetaMask is a wallet for the Ethereum blockchain that supports all types of tokens based on it (both regular and non-fungible ones, aka NFTs). The wallet works as an extension for Google Chrome, Firefox, Microsoft Edge and Brave desktop browsers, and there are also apps for iOS and Android. MetaMask can be used to make purchases and create and monetize content on a decentralized network. As with similar wallets, access is secured by a user password created at registration, and an app-generated private key consisting of 64 alphanumerical characters, plus a seed phrase — a series of 12 (less often 24) words. And whereas nearly all cryptowallet owners understand that the password and private key must not be shared with anyone, some, especially cryptocurrency newbies, underestimate the need to keep the seed phrase secret. Keep in mind however that the seed phrase is essentially a verbal representation of the private key, allowing you to restore access to the account. In other words, if someone gets hold of your seed phrase, they will be able to log in to your account and get their hands on your cryptocurrency. Hence the interest on the part of scammers. E-mail threatening to block your account The scam starts with a mass e-mail that exploits one of the favorite psychological tricks of cybercriminals: intimidation. Victims are threatened that if they do not urgently verify their MetaMask account, it will be suspended. To make the message appear more convincing, the cybercriminals add the company’s name and logo, and indicate its support service as the sender. Suspicion is raised only by taking a closer look at the address the e-mail came from. The scammers ask the victim to verify their account The first sign it’s a fake is the typo in the company name in the e-mail address (metamasks instead of metamask). Another red flag is the domain, (the part of the address after the @ symbol). Respectable companies usually use their name as the domain, for example, account-security-noreply@microsoft.com. In this case, however, the domain has no relation at all to MetaMask. Lastly, .de indicates that the address is registered in Germany, which is also strange, since MetaMask is an American company. To verify the account, the scammers prompt their victim to follow a link in the e-mail. This, too, does not inspire confidence: the incorrect domain with extra words and the names of foreign brands clearly suggest something is wrong with the message. Enter the seed If the victim fails to spot these tell-tale signs and still follows the link, they are taken to a fake login page that resembles the official MetaMask website. The victim is asked to enter their wallet seed phrase The scammers prompt the victim to enter their seed phrase into the form, supposedly to unlock the wallet. If the user is taken in and enters the secret phrase, they are redirected to the real MetaMask site, however, their wallet is now in cybercriminal hands. How to protect your wallet Attackers are constantly coming up with new and increasingly sophisticated ways of defrauding cryptoinvestors. However, most scams have common signs that give them away. And to guard against intruders, it’s usually enough to follow these simple security rules: Be wary of e-mails and messages asking for payment or threatening to block an account, or, on the contrary, offering a get-rich-quick scheme. Pay attention to the sender’s address. If the company’s name is spelled incorrectly, or the domain is just a set of random characters, it’s almost certainly a scam. Treat data and credentials used to access your account and money with extreme care. Learn how the cryptowallet security system works, what information the support service may require from you, and what you should never share with anyone. Use a reliable solution with protection against online fraud and phishing to help keep your money safe from all sorts of scam."}}
{"https://www.kaspersky.co.in/blog/geopolitics-opportunistic-malware-phishing/23964/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-03-15", "source": "www.kaspersky.co.in"}, "text": "On this blog, you will often see posts that discuss how cybercriminals will take every advantage that is at their disposal to make a quick buck or gain a foothold into a corporate infrastructure. In the past, we’ve seen targeting focused on the coronavirus , World Cups, Olympics , elections and basically any other major event. And the reason is simple — these items are passionate topics that people resonate with. Passion, at times, will undermine the usual cautiousness that people have in terms of questioning what they see or click on or share with their friends, family, co-workers and just about anybody on social media. Fast forward to today and we are seeing the eyes of the world turned toward the geopolitical conflict in Ukraine. The increased focus on this conflict has seen a growth in people looking at how to get involved – including cybercriminals looking to make a quick buck. If you’re on any social network, you have probably seen people jumping on hashtags or flooding feeds with information on the current events. In some areas, it will seem like friends you’ve known for years have turned into bots blindly sharing. However, there are those that want to do more and join the cause. In particular, there are some folks who look to joining hacktivism groups even if they don’t particularly have the technical skills to carry out hacks. More technically savvy hacktivists have made it easy for their less-techy brethren with links to easily join up and have scripts run for them. While we understand that people want to get involved and support these efforts, we have to point out that depending on where you live, or what you are doing, these activities are illegal. If you are someone that wants to join into these efforts, please make sure that you understand what you are doing from both the ethical and legal angles, as well as those in your heart. What’s more, you should keep in mind security concerns. Unfortunately, this trend has been taken up by crooks as well: our colleagues over at Talos recently conducted research on how malefactors were creating similar packages that were, in fact, malware. Aside from that, some activists are also calling for their supporters to bombard commercial organizations with demands to provide some sort of assistance, or, conversely, to abandon some types of activities. Among these calls are also quite dangerous ones — for example, to replace security software with less effective products. These calls to action in hacktivist groups are also ripe for impersonation for criminals that are opportunistic. These targeted campaigns may also lead to spear phishing attacks . Tips to stay safe Think for yourself. We can’t tell you what to do, but we have to remind you that any decision you make has to be based on solid facts, not on fake news . Always do your own research and try to figure out the full consequences of your actions as best as you can. Check e-mail senders. One of the first things to do when it comes to avoiding falling victim to a malicious e-mail is to look at who the sender is. While the name may seem familiar, make sure that the e-mail is from a trusted source or legitimate company/person reaching out to you. Confirm links. Similar to looking at the sender, take a look and make sure that the links are from legitimate sites and tied to the sender when clicking through. As mentioned earlier, acting with emotions can cloud judgement, so be sure to keep your security vigilance up when clicking e-mail links. Don’t install suspicious packages. Growing up, we all heard not to take candy from strangers. Similarly, you shouldn’t download things from an e-mail or site that you are not sure if it is trustworthy. And if you’re going to download it anyway, at the very least scan it with a reliable antivirus."}}
{"https://www.kaspersky.co.in/blog/hermeticransom-hermeticwiper-attacks-2022/23946/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-03-01", "source": "www.kaspersky.co.in"}, "text": "Our researchers analyzed the HermeticRansom malware also known as Elections GoRansom. By and large, this is a fairly simple cryptor. What is interesting in this case is the purpose for which attackers are using it. HermeticRansom goals HermeticRansom attacked computers at the same time as another malware known as HermeticWiper, and based on publicly available information from security community, it was used in recent cyberattacks in Ukraine. According to our experts, the relative simplicity and questionable malware workflow implementation suggests that HermeticRansom was used as a smokescreen for HermeticWiper attacks. What HermeticRansom is capable of Once infecting the victim’s computer, the malware first identifies hard drives and collects a list of directories and files located everywhere except for the Windows and Program Files folders. It then encrypts certain categories of files and renames them adding а .encrypted tag and the email address of the ransomware operators. The malware also creates a read_me.html file in the Desktop folder containing a ransom note with the attackers’ contacts. The note looks like this: Ransom note left by HermeticRansom malware HermeticRansom encrypts files with following extensions: .inf, .acl, .avi, .bat, .bmp, .cab, .cfg, .chm, .cmd, .com, .crt, .css, .dat, .dip, .dll, .doc, .dot, .exe, .gif, .htm, .ico, .iso, .jpg, .mp3, .msi and odt. HermeticRansom peculiarities HermeticRansom is written in Golang. It does not use any obfuscation mechanisms, and the encryption method itself is rather cumbersome and inefficient. Judging by these and some other signs, our experts think that this malware was created in a hurry. You can find a more detailed technical analysis of the malware along with indicators of compromise on our Securelist blog. How to stay safe Kaspersky Lab security solutions successfully detect HermeticRansom malware and similar threats. We have a range of tools to protect both home computers and corporate infrastructure, including: Kaspersky Internet Security : our multi-platform security solution for home users; Kaspersky Endpoint Security Cloud : our solution for business protection; Kaspersky Anti-Ransomware Tool : our free corporate solution that can work as an additional layer of protection in parallel with products from other vendors."}}
{"https://www.kaspersky.co.in/blog/how-to-protect-from-stalking-with-airtag/23910/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-02-17", "source": "www.kaspersky.co.in"}, "text": "Apple’s AirTags have only been on the market since last spring, but they have already earned a bad reputation for being a way to facilitate criminal activity and track people without their permission. In this article we look closely at how AirTags work and why they can be dangerous. We also tell you how to protect yourself from being tracked with AirTags and from other types of cyberstalking. How AirTags work Apple unveiled AirTags in April 2021 as devices that help search for easy-to-lose objects. Inside an AirTag there is a board with a wireless module, along with a replaceable battery and a speaker which is actually rather large, and that’s really the bulk of the device. Here’s how AirTags work in the simplest scenario: you stick the little fob on your keys, and if one day you’re running late for work and your keys are lost somewhere in your apartment, you activate search mode on your iPhone. Using ultra-wideband (UWB) technology, the phone points you toward the AirTag, giving you helpful prompts like “hot” or “cold.” In a more complicated scenario, suppose you’ve attached the AirTag to your backpack and one day you rush off the subway so fast you accidentally leave it behind. Since you and your iPhone are already far away from your backpack when you realize you lost it, UWB won’t help you. Now anyone who has a relatively modern Apple device — iPhone 7 and newer — can get involved. Using Bluetooth, they detect the AirTag nearby and transmit approximate or specific coordinates to your Apple account. Now you can use Apple’s Find My service to see where your backpack has ended up — such as in the lost-and-found office or with a new owner. What’s key is that all of this happens automatically; you don’t even need to install anything. Everything the AirTag search system needs to work is already built into the iOS of hundreds of millions of users. But considering that Bluetooth has a maximum distance range of just a few dozen meters, this works only in large cities, where there are a lot of people with iPhones. If your backpack ends up in a small town where all the residents use Android smartphones (or even the latest push-button phones that barely connect to the Internet ), it will be challenging to pin down the location of the AirTag. In this case a third detection mechanism kicks in: if a few hours go by and the AirTag hasn’t had a connection with any iPhone, the built-in speaker starts playing a sound. If the person who finds the item figures out how to connect their smartphone with NFC to the AirTag, the AirTag tells them the phone number of the item’s owner. AirTags and shady business In theory, AirTags are a useful and, at $29 for one or $99 for a pack of four, a relatively inexpensive accessory for everyday tracking of easy-to-lose objects. The technology can help you find your hidden keys or a bag you’ve left behind. One example of a useful application that has been widely discussed over the last year is sticking an AirTag on a suitcase before getting on a plane. On a number of occasions, travelers have been able to locate their lost baggage faster than the airline employees could. But in practice, right after the device went on sale, reports started cropping up about how people used it in ways that were not completely legal, and there were even reports of overt criminal activity. Here are the major examples. An activist from Germany uncovered the location of a top-secret state agency after mailing it an envelope containing an AirTag. A lot of people use such a tactic — which is more or less legal depending on the laws of a country — to track actual mail delivery routes, for example. But it’s also possible to use an AirTag like the German activist did: if someone uses a PO Box to receive mail so they can keep their real address private, a piece of mail that has an AirTag inside it will reveal the actual place of residence. On a more serious note, in December 2021 the Canadian police investigated several incidents in which criminals used AirTags to steal cars. They stuck an AirTag on a car in a public parking lot, used it to figure out where the owner lived, and then at night stole the car while it was parked in a suburb, a little further from potential witnesses. Finally, there are many testimonials involving the use of AirTags to stalk women . In this case, the perpetrators stick an AirTag on a woman’s car or slip it into her bag, and then they ascertain where she lives and see the routes she travels regularly. AirTags contain protection against this kind of stalking: if the tag is constantly moving around while being far away from the iPhone it’s tied to, the built-in speaker starts beeping. However, it didn’t take long for tinkerers to figure out that there’s a workaround: modified AirTags with the beeper disabled have recently started showing up on the market. But this isn’t even the most frightful scenario. In theory one can hack the AirTag and modify its behavior in the software. Clear steps in this direction have already been made: For instance, last May a researcher successfully gained access to the device’s protected firmware. This will be most dangerous for Apple and users if someone manages to exploit the network of hundreds of millions of iPhones to track people illegally without the knowledge of the manufacturer, the owners of the smartphones that are taking part in a search operation, and the victims themselves. How dangerous AirTags are The most frightful scenario has not yet come to pass, and it is unlikely to — after all, Apple cares about the security of its own infrastructure. You also need to keep in mind that there are other devices similar to AirTags. Various legal and illegal tracking devices have existed for over a decade. Moreover, even consumer tags with similar functionality to AirTags have been on the market for a long time. Tile released its tags in 2013, and they also offer ways to search for lost objects over a large distance by applying the same principle as AirTags. Of course, this company probably won’t be able to achieve “coverage” from hundreds of millions of iPhones. In addition, devices like these cost money — sometimes a lot of money — and they are relatively easy to detect. In the case of AirTags, they need to be connected to an Apple account, which is hard to create anonymously without providing a real name and usually a credit card number. If the police report a case of illegal tracking, Apple turns over this data — admittedly, you need to convince the police to request such data, and according to testimonials by victims in different countries, this doesn’t always happen. Ultimately, it’s the same story we always see: AirTags are a handy piece of technology that criminals can also use for malicious purposes. Apple didn’t invent cyberstalking, but it did come up with a convenient technology that enables people to engage in illegal stalking. That means that it’s the company’s responsibility to make it harder for people to use the device for objectionable purposes. Once again, the closed ecosystem of Apple’s software and devices has come under criticism. If you have an iPhone and someone has snuck an AirTag into your bag, your phone will notify you. But what if you don’t have an iPhone? For the time being, Apple has developed a band-aid solution by releasing an app for Android smartphones that you need to install to detect tracking. The upshot is that Apple created a problem for everyone but offered a simple solution only to its own customers. Everyone else needs to adjust somehow. This month Apple tried to respond to the avalanche of criticism by issuing a long statement . It acknowledged that before releasing AirTag it hadn’t envisioned all the ways of using it — whether legal or illegal. It pledged to tell AirTag buyers more explicitly that AirTags are not to be used for tracking people. It also plans to raise the volume of the beep that helps you find an AirTag someone has planted on your belongings. This is laudable, but it doesn’t solve all the problems. We hope that over time Apple will be able to clearly separate legal and illegal ways of using AirTags. Stalkerware In conclusion, we need to mention that using software for surveillance is much more dangerous and commonplace in real life than AirTags. Apple’s AirTags cost a fair amount of money, a person doing the tracking needs to pair an AirTag with their real account, and the manufacturer is actually trying to make it harder to hide the tags. In contrast, developers of spyware and stalkerware apps are doing their best to make them as undetectable as possible. In addition to tracking location, tracking apps give the spy a heap of other options. In particular, they open access to the victim’s documents, photos and messages, which can be even more dangerous than geolocation. So if you’re worried about being tracked, the first thing you need to do is protect your smartphone — it’s the most obvious target . Then you can look around for unknown AirTags. If you use an iPhone, it will notify you pretty quickly that there’s a tag. If you have an Android and you want to protect yourself from being tracked with an AirTag, install the Apple Tracker Detect app."}}
{"https://www.kaspersky.co.in/blog/webkit-vulnerability-cve-2022-22620/23891/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-02-11", "source": "www.kaspersky.co.in"}, "text": "Apple has released an urgent update for iOS and iPadOS that fixes the CVE-2022-22620 vulnerability. They recommend updating devices as soon as possible, as the company have reason to believe that the vulnerability is already being actively exploited by unknown actors. Why vulnerability CVE-2022-22620 is dangerous As usual, Apple experts do not disclose the details of the vulnerability until the investigation is completed, and the majority of users have the patches installed. At the moment, they only say that the vulnerability belongs to the Use-After-Free (UAF) class, therefore it is related to incorrect use of dynamic memory in applications. Its exploitation allows the attacker to create malicious web content, the processing of which can lead to arbitrary code execution on the victim’s device. Simply put, the most likely attack scenario is an infection of an iPhone or iPad device after visiting a malicious web page. Which devices and apps are vulnerable to CVE-2022-22620 exploitation Judging by the description of the bug, the vulnerability was found in the WebKit engine used in many applications for macOS, iOS and Linux. In particular, all browsers for iOS and iPadOS are based on this open source engine — that is, not only iPhone’s default Safari, but also Google Chrome, Mozilla Firefox and any others. So even if you do not use Safari, this vulnerability still affects you directly. Apple released updates for iPhones 6s and newer; all models of iPad Pro, iPad Air version 2 and newer, iPad starting with the 5th generation, iPad mini starting with 4th generation, and iPod touch media player starting with the 7th generation. How to stay safe The patches that Apple released on February 10 changes memory management mechanisms and thus prevents exploitation of CVE-2022-22620. So in order to protect your device, it should be enough to install iOS 15.3.1 and iPadOS 15.3.1 updates. Your device needs to be connected to a Wi-Fi network to install the patch. If your device does not yet show a notification that the update is ready for installation, you can force your system into updating a little bit quicker: go to the system settings yourself (Settings → General → Software update) and check the availability of software updates. In order to get alerts about the latest cyberthreats directly related to your devices and apps, we recommend using the Kaspersky Security Cloud , available for Windows, macOS, Android and iOS operating systems. When a new vulnerability in the software you use, or a data leak on the website you visit is discovered, you will get a notification with advice on how to protect yourself."}}
{"https://www.kaspersky.co.in/blog/how-to-protect-from-pegasus-spyware/23861/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-02-02", "source": "www.kaspersky.co.in"}, "text": "Possibly the biggest story of 2021 — an investigation by the Guardian and 16 other media organizations, published in July — suggested that over 30,000 human rights activists, journalists and lawyers across the world may have been targeted using Pegasus. Pegasus is a so-called “legal surveillance software” developed by the Israeli company NSO. The report, called the Pegasus Project , alleged that the malware was deployed widely through a variety of exploits, including several iOS zero-click zero-days. Based on forensic analysis of numerous mobile devices, Amnesty International’s Security Lab found that the software was repeatedly used in an abusive manner for surveillance. The list of targeted individuals includes 14 world leaders and many other activists, human rights advocates, dissidents and opposition figures. Later in July, representatives from the Israeli government visited the offices of NSO as part of an investigation into the claims. In October, India’s Supreme Court commissioned a technical committee to investigate the use of Pegasus to spy on its citizens. Apple announced, in November, that it was taking legal action against NSO Group for developing software that targets its users with “malicious malware and spyware.” Last but not least, in December, Reuters published that US State Department phones were hacked with the NSO Pegasus malware, as alerted by Apple. Over the past few months I have received a lot of questions from concerned users worldwide on how to protect their mobile devices from Pegasus and other similar tools and malware. We are trying to address this in the current article, with the observation that no list of defence techniques can ever be exhaustive. Additionally, as attackers change their modus operandi, protection techniques should also be adapted. How to stay safe from Pegasus and other advanced mobile spyware First of all, we should start by saying that Pegasus is a toolkit sold to nation states at relatively high prices . The cost of a full deployment may easily reach millions of USD. Similarly, other APT mobile malware may be deployed through zero-click 0-day exploits. These are extremely expensive — as an example, Zerodium, an exploit brokerage firm pays up to $2.5 million for an Android zero-click infection chain with persistence: From the start, this draws an important conclusion — nation state sponsored cyberespionage is a vastly resourceful endeavor. When a threat actor can afford to spend millions, potentially tens of millions or even hundreds of millions of USD on their offensive programs, it is very unlikely that a target will be able to avoid getting infected. To put this in simpler words, if you are targeted by such an actor, it’s not a question of “whether you can get infected,” it’s actually just a matter of time and resources before you get infected . Now, for the good news — exploit development and offensive cyberwarfare are often more of an art rather than an exact science. Exploits need to be tuned for specific OS versions and hardware and can be easily thwarted by new OS releases, new mitigation techniques or even small things such as random events. With that in mind, infection and targeting is also a question of cost and making things more difficult for the attackers. Although we may not always be able to prevent the successful exploitation and infection of the mobile device, we can try to make it as hard as possible for the attackers. How do we do this in practice? Here’s a simple checklist. How to protect from advanced spyware on iOS Reboot daily. According to research from Amnesty International and Citizen Lab, the Pegasus infection chain often relies on zero-click 0-days with no persistence, so regular reboot helps clean the device. If the device is rebooted daily, the attackers will have to re-infect it over and over again. In time, this increases the chances of detection; a crash might happen or artifacts could be logged that give away the stealthy nature of the infection. Actually, this is not just theory, it’s practice — we analyzed one case in which a mobile device was targeted through a zero-click exploit (likely FORCEDENTRY). The device owner rebooted their device regularly and did so in the next 24 hours following the attack. The attackers tried to target them a few more times but eventually gave up after getting kicked a few times through reboots. NoReboot: A fake restart to gain a foothold in the system Disable iMessage. iMessage is built into iOS and is enabled by default, making it an attractive exploitation vector. Because it’s enabled by default, it is a top delivery mechanism for zero-click chains and for many years, iMessage exploits were in high demand, with top payouts at exploit brokerage companies. “During the last few months, we have observed an increase in the number of iOS exploits, mostly Safari and iMessage chains, being developed and sold by researchers from all around the world. The zero-day market is so flooded by iOS exploits that we’ve recently started refusing some (of) them ,” Zerodium’s founder Chaouki Bekrar wrote back in 2019 to WIRED . We realize life without iMessage may be very difficult for some (more on that later), but if Pegasus and other high-end APT mobile malware is in your threat model, this is a tradeoff worth taking. Disable Facetime. Same advice as above. Keep the mobile device up to date; install the latest iOS patches as soon as they are out. Not everyone can afford zero-click 0-day’s, actually many of the iOS exploit kits we are seeing are targeting already patched vulnerabilities. Nevertheless, many people run older phones and postpone updates for various reasons. If you want to be ahead of (at least some) nation state hackers, update as soon as possible and teach yourself not to need Emojis to install the patches . Don’t ever click on links received in messages. This is simple advice yet effective. Not all Pegasus customers can afford to buy zero-click 0-day chains at a cost of millions so they rely on 1-click exploits. These arrive in the form of a message, sometimes by SMS, but can also be via other messengers or even e-mail. If you receive an interesting SMS (or by any other messenger) with a link, open it on a desktop computer, preferably using TOR Browser, or better yet using a secure non-persistent OS such as Tails. SMS with a malicious link used to target a political activist. Source: Citizen Lab Browse the Internet with an alternate browser such as Firefox Focus instead of Safari or Chrome. Despite the fact that all browsers on iOS pretty much use the same engine, Webkit, some exploits do not work well (see LightRighter / TwoSailJunk APT case ) on some alternate browsers: LightRiver exploit kit check for “Safari” in the user agent string User agent strings on iOS from Safari, Chrome and Firefox Focus browsers: Safari: Mozilla/5.0 (iPhone; CPU iPhone OS 15_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/15.1 Mobile/15E148 Safari /604.1 Chrome: Mozilla/5.0 (iPhone; CPU iPhone OS 15_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) CriOS/96.0.4664.53 Mobile/15E148 Safari /604.1 Firefox Focus: Mozilla/5.0 (iPhone; CPU iPhone OS 15_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) FxiOS/39 Mobile/15E148 Version/15.0 Always use a VPN that masks your traffic. Some exploits are delivered through GSM operator MitM attacks, when browsing HTTP sites or by DNS hijack. Using a VPN to mask the traffic makes it difficult for your GSM operator to target you directly over the Internet. It also complicates the targeting process if the attackers have control over your data stream, such as while in roaming. Please note that not all VPNs are the same and not any VPN is fine to use. Without favoring any specific VPN provider, here’s a few things to consider when you shop for a VPN subscription with anonymity being a top priority: Purchase means just that — no “free” VPNs. Look for services that you can accept payment with cryptocurrencies. Look for services that do not require you to provide any registration info. Try to avoid VPN apps — instead, use open-source tools such as OpenVPN, WireGuard and VPN profiles. Avoid new VPN services and look for established services that have been around for some time. Install a security application that checks and warns if the device is jailbroken. Frustrated from getting kicked over and over, the attackers will eventually deploy a persistence mechanism and jailbreak your device in the process. This is where the chance of catching them increases tenfold and we can take advantage of the fact that the device is jailbroken. Make iTunes backups once per month. this allows diagnosing and finding infections later, through the use of the wonderful MVT package from Amnesty International (more on that later). Trigger sysdiags often and save them to external backups. Forensics artifacts can help you determine at a later time if you have been targeted. Triggering a sysdiag depends on the phone model — for instance, on some iPhone’s, this is done by pressing Volume Up + Volume Down + Power at the same time. You may need to play with this a couple of times, until the phone buzzes. Once the sysdiag is created, it will appear in diagnostics: How to protect from advanced spyware on Android A similar list for Android users (for details and reasoning check the list for iOS above): Reboot daily. Persistence on the latest Android versions is difficult, many APTs and exploit sellers avoid persistence whatsoever! Keep phone up to date; install latest patches. Don’t ever click on links received in text messages. Browse the internet with an alternate browser such as Firefox Focus instead of the default Chrome. Always use a VPN that masks your traffic. Some exploits are delivered through GSM operator MitM attacks, when browsing HTTP sites or by DNS hijack. Install a security suite that scans for malware and checks and warns if the device is rooted. At a more sophisticated level — both for iOS and Android — always check your network traffic using live IoCs. A good setup might include a Wireguard always-on VPN to a server under your control, that uses pihole to filter out bad stuff and logs all the traffic for further inspection. How to get by without iMessage I was talking to my friend Ryan Naraine recently, and he said — “iMessage and FaceTime — these are the reasons why people use iPhones!” and for sure, he’s right. I’ve myself been an iPhone user since 2008 and think iMessage and FaceTime were two of the greatest things Apple added to this ecosystem. When I realized that these are also some of the most exploited features that let nation states spy on your phone, I tried to escape the iMessage Hotel California . The hardest thing? Getting the family to stop using it too. Surprising as it may sound, this was one of the most difficult things in this whole security saga. At first, I tried to switch everyone to Telegram . This didn’t go too well. Then, Signal got better and better, implemented Video calls and group calling. In time, more and more friends started moving to Signal . And this worked well with my family too. I’m not saying you should do the same. Perhaps you can keep iMessage enabled and live happily and malware free — truth be told, Apple greatly improved the security sandbox around iMessage with BlastDoor in iOS 14. Nevertheless, the FORCEDENTRY exploit used by NSO to deliver Pegasus bypassed BlastDoor and of course, no security feature is ever 100% hack-proof. So, what is the best of both worlds, you may ask? Some people, including myself, have several phones — one where iMessage is disabled, and a “honeypot” iPhone where iMessage is enabled. Both are nicely associated with the same Apple ID and phone number. If someone decides to target me this way, there’s a good chance they will end up in the honeypot phone. How to detect Pegasus and other advanced mobile malware Detecting infection traces from Pegasus and other advanced mobile malware is very tricky, and complicated by the security features of modern operating systems such as iOS and Android. Based on our observations, this is further complicated by the deployment of non-persistent malware, which leaves almost no traces after reboot. Since many forensics frameworks require a device jailbreak, which in turn requires a reboot, this results in the malware being removed from memory during the reboot. Currently, several methods can be used for detection of Pegasus and other mobile malware. MVT (Mobile Verification Toolkit) from Amnesty International is free, open source and allows technologists and investigators to inspect mobile phones for signs of infection. MVT is further boosted by a list of IoCs (indicators of compromise) collected from high profile cases and made available by Amnesty International. What to do if you got infected with Pegasus So you followed all these recommendations carefully and still got infected. Sadly, this is the reality we live in nowadays. I feel for you, really. You may not be a bad guy at all — on the contrary, I’m sure you’re one of the good guys. Perhaps you spoke against powerful people, or participated in some protests against a questionable decision from certain political figures, or simply used encryption software or been in the wrong place at the wrong time. Look on the bright side — you know you’ve been infected, because artifacts and knowledge allowed you to determine that. Think of the following things: Who targeted you and why? Try to figure out what it was that brought you into the attention of the big guys. Is this something that you can avoid in the future through more stealthy behavior? Can you speak about it? The thing that eventually brought down many surveillance companies was bad publicity. Reporters and journalists writing about abuses and exposing the lies, wrongdoing and all the evil. If you’ve been targeted try to find a journalist and tell them your story. Change your device — if you were on iOS, try moving to Android for a while. If you were on Android, move to iOS. This might confuse attackers for some time; for instance, some threat actors are known to have purchased exploitation systems that only work on a certain brand of phone and OS. Get a secondary device, preferably running GrapheneOS, for secure comms. Use a prepaid card in it, or, only connect by Wi-Fi and TOR while in airplane mode. Avoid messengers where you need to provide your contacts with your phone number. Once an attacker has your phone number they can easily target you across many different messengers via this — iMessage, WhatsApp, Signal, Telegram, they are all tied to your phone number. An interesting new choice here is Session, which automatically routes your messages through an Onion-style network and doesn’t rely on phone numbers. Try to get in touch with a security researcher in your area and constantly discuss best practices. Share artifacts, suspicious messages or logs whenever you think something is odd. Security is never a single snapshot solution that is 100% proof; think of it like a stream that flows and you need to adjust your sailing depending on the speed, currents and obstacles. At the end of this, I’d like to leave you with a thought. If you get targeted by nation states, that means you are important . Remember: it’s nice to be important, but it’s more important to be nice. Alone, we are weak, together, we are strong. The world may be broken, but I believe we are living at a time when we can still change things. According to a report from the nonprofit group Committee to Protect Journalists , 293 journalists were imprisoned in 2021, the highest number CPJ has ever reported since it started tracking it, in 1992. It’s up to us to shape how the world will look like for us in 10 years, for our children and our children’s children. You, the people have the power — the power to create machines. The power to create happiness! You, the people, have the power to make this life free and beautiful, to make this life a wonderful adventure. Then — in the name of democracy — let us use that power — let us all unite. Let us fight for a new world — a decent world that will give men a chance to work — that will give youth a future and old age a security. By the promise of these things, brutes have risen to power. But they lie! They do not fulfil that promise. They never will! Dictators free themselves but they enslave the people! Now let us fight to fulfil that promise! Let us fight to free the world — to do away with national barriers — to do away with greed, with hate and intolerance. Let us fight for a world of reason, a world where science and progress will lead to all men’s happiness. Soldiers! in the name of democracy, let us all unite! Final speech from The Great Dictator This post originally ran as a series of op-eds in Dark Reading ( part 1 , part 2 )."}}
{"https://www.kaspersky.co.in/blog/dark-souls-dangerous-vulnerability/23849/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-01-24", "source": "www.kaspersky.co.in"}, "text": "The gaming community is discussing a recent vulnerability in the Dark Souls III videogame. This RCE vulnerability allows attackers to remotely execute arbitrary code on a victim’s computer. Apparently, the vulnerability also affects earlier games in the Dark Soul series: because of this the developers have taken the unusual step of temporarily deactivating PvP servers across Dark Souls Remastered, Dark Souls II, and Dark Souls III. According to the developers , they also plan to turn off servers for Dark Souls: Prepare To Die as well. Players fear that the same vulnerability could also affect the upcoming Elden Ring game, which is thought to use the same infrastructure. The bug is relevant only for PC users, so Xbox and PlayStation are unaffected. Why Dark Souls vulnerability is so dangerous This vulnerability allows an attacker to execute almost any program on the victim’s computer, so they’re able to steal confidential data or execute any program they wish (including installing malware). You can find a demonstration of the exploit in the Twitch stream of the player named The_Grim_Sleeper in which an unknown person launched a PowerShell script on the streamer’s computer that used the Windows Narrator engine to read out critical notes about the gameplay. What is the chance that Dark Souls vulnerability will be exploited ITW? The details of the exploit for this vulnerability are not available to the general public, at least not yet. Despite the ethically dubious way of drawing attention to the problem, the person behind the attack apparently was not trying to cause any real harm. Judging by the discussion in the Dark Souls community, the creator of the exploit has been trying to inform the game’s developers about this serious vulnerability for some time, but they had ignored his messages. That’s why he decided to hack a popular streamer right during the streaming session. However, this information is not 100% reliable, in reality everything may not be so straight-forward. For example, the creator of the exploit has already shared information about the vulnerability with the developers of the Blue Sentinel plugin, a mod for Dark Souls designed to counteract cheats. And one can only guess who else could get this information. Also, once demonstrated, other hackers may try to replicate the exploit and use it to cause real harm to players. There are various possible scenarios here: attackers can use it to steal passwords from game accounts or crypto wallets, install good old ransomware, hidden miners, and much more. How to stay safe from Dark Souls vulnerability? Apparently, FromSoftware is currently trying to solve the problem. Let’s hope they can fix the vulnerability quickly. However, in the meantime we recommend using high-quality security solutions for each device . Thanks to a special gaming mode, our antiviruses protect against all kinds of threats, including the exploitation of vulnerabilities, while consuming a minimum of PC resources and without interfering with the gameplay."}}
{"https://www.kaspersky.co.in/blog/microsoft-patches-about-a-hundred-vulnerabilities/23840/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-01-13", "source": "www.kaspersky.co.in"}, "text": "Microsoft started the year with a massive vulnerability fix, releasing not only its regular first-Tuesday update, which this time covers a total of 96 vulnerabilities , but also issuing a bunch of fixes for the Microsoft Edge browser (mainly related to the Chromium engine). That makes more than 120 vulnerabilities patched since the beginning of the year. This is a clear reason to update the operating system and some Microsoft applications as soon as possible. Most severe vulnerabilities Nine of the vulnerabilities that were closed this Tuesday have a critical rating on the CVSS 3.1 scale. Of those, two are related to privilege escalation : CVE-2022-21833 in Virtual Machine IDE Drive and CVE-2022-21857 in Active Directory Domain Services. Exploitation of the other seven can give an attacker the remote code execution ability: CVE-2022-21917 in HEVC Video Extensions; CVE-2022-21912 and CVE-2022-21898 in DirectX Graphics Kernel; CVE-2022-21846 in Microsoft Exchange Server; CVE-2022-21840 in Microsoft Office; CVE-2021-22947 in Open Source Curl; CVE-2022-21907 in HTTP Protocol Stack. The last one seems to be the most unpleasant vulnerability. A bug in the HTTP protocol stack theoretically allows attackers not only to make the affected computer execute arbitrary code, but also to spread the attack over the local network (according to Microsoft terminology, the vulnerability is classified as wormable — that is, it can be used to create a worm ). This vulnerability is relevant for Windows 10, Windows 11, Windows Server 2022, and Windows Server 2019. However, according to Microsoft, it’s dangerous for users of Windows Server 2019 and Windows 10 version 1809 only if they enable HTTP Trailer Support using the EnableTrailerSupport key in the registry. Experts also expressed concern about the presence of another serious vulnerability in Microsoft Exchange Server — CVE-2022-21846 (which, by the way, is not the only Exchange bug on the list, just the most dangerous). Their concern is totally understandable — no one wants a recurrence of last year’s wave of exploited Exchange vulnerabilities. Vulnerabilities with PoCs Some of the fixed vulnerabilities were already known to the security community. Furthermore, someone has already published proofs of concept for them: CVE-2022-21836 — Windows certificate spoofing vulnerability; CVE-2022-21839 — Windows event tracing discretionary access control list denial of service vulnerability; CVE-2022-21919 — Windows user profile service elevation of privilege vulnerability. We have not yet observed real attacks using these vulnerabilities. However, the proofs of concept are already in public, so exploitation can begin at any time. How to stay safe First, you need to update your operating system (and other programs from Microsoft) as soon as possible. In general, it is usually wise not to delay installing patches for critical software. Second, any computer or server connected to the Internet must be equipped with a reliable security solution capable not only of preventing the exploitation of known vulnerabilities, but also of detecting attacks with yet-unknown exploits."}}
{"https://www.kaspersky.co.in/blog/what-is-noreboot-attack-and-how-to-protect-your-smartphone/23823/": {"metadata": {"dateAccessed": "2022-04-03", "dateCreated": "2022-01-10", "source": "www.kaspersky.co.in"}, "text": "To be absolutely sure your phone isn’t tracking you or listening in on any conversations, you might turn it off. It seems logical; that way, even if the phone is infected with serious spyware, it can’t do anything. In addition, turning off or restarting a smartphone is one of the most reliable ways to fight such infections; in many cases, spyware “lives” only until the next reboot because it cannot gain a permanent foothold in the operating system. At the same time, the vulnerabilities that allow malware to work even after a reboot are rare and expensive to exploit. However, this tactic might not work forever. Researchers have come up with a technique to bypass it using a method they have named NoReboot. In essence, this attack is a fake restart. What is NoReboot, and how does the attack work? We want to note right off the bat that NoReboot is not a feature of any real spyware in use by attackers; rather, it’s a so-called proof of concept that researchers demonstrated under laboratory conditions. At this point it is hard to say whether the method will actually gain traction. For the demonstration, the researchers used an iPhone they “infected” beforehand. Unfortunately, they haven’t shared the technical details. Here’s what happens in the demonstration: The spy malware, which transfers the image from the camera, runs on the iPhone; The user tries to shut off the phone the usual way, using the power and volume buttons; The malware takes control and shows a perfect fake instead of the standard iOS shutdown screen; After the user drags the power-off slider, which also looks perfectly normal, the smartphone’s screen goes dark and the phone no longer responds to any of the user’s actions; When the user presses the power button again, the malware displays a perfect replica of the iOS boot animation. During the entire process, the phone is continually transferring the image from the phone’s front camera to another device without the user’s knowledge. As is often the case, seeing is believing, and we recommend checking out the researchers’ video: How to protect yourself against NoReboot Again, at least for now NoReboot is only a demonstration of the feasibility of an attack. The attack is alarming, to be sure, but don’t forget that malware needs to get onto a smartphone before it can do any damage. Here are some tips to help you prevent that from happening: Keep in mind that it’s much harder for attackers to infect a smartphone remotely than if they have physical access to it. Be careful not to let someone else get hold of your smartphone — especially for a long period of time — and install a reliable device lock. People most often install malware on their smartphones on their own, voluntarily. Be careful about what you download and avoid installing unnecessary apps — that is, those you can easily live without — as a general rule. Don’t root or jailbreak your smartphone (at least if you haven’t been using *nix systems for many years). Superuser rights make malware’s work exponentially easier . If you have an Android device, we recommend installing an antivirus solution — to block Trojans from penetrating the system. Let your smartphone die a natural death from time to time — that is, wait for the charge to run out completely. The phone will then most certainly restart without any fakes, and there’s an excellent chance that spies will disappear from the system. You can speed up the process by using a resource-hungry app, such as a game or benchmark-test utility."}}
