{
    "data": [
        {
            "https://www.recordedfuture.com/dark-web-third-party-risk-management/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-05-13",
                    "source": "www.recordedfuture.com"
                },
                "text": "Why Monitoring the Dark Web is Essential for Third-Party Risk Management May 13, 2021 •\n                Trevor Lyness The dark web is often portrayed as vast, mysterious, and out of reach for companies without specialized expertise. In reality, the dark web is one of the most over-hyped and misunderstood terms in the cybersecurity industry today. However, if you cut through the noise, you’ll find that the dark web is an enormously valuable source of information for third-party risk management professionals. What is the Dark Web? The dark web is a subset of the Internet. It’s accessible via special software such as Tor that allows users and website operators to remain anonymous or untraceable. Websites on the dark web operate in their own unique environment, separated from surface sites such as Amazon, eBay, or Youtube. Cybercriminals use the dark web to coordinate and execute cyber attacks, as well as to sell stolen data and even exploits into companies. However, not all parts of the dark web are equal. Many portions are accessible to anyone willing to download Tor. The information you find in these relatively easy-to-access parts of the dark web are often of limited value. Other parts of the dark web are invite-only, requiring special access that requires years of effort developing personas accepted among the cybercriminal community. This closed part of the dark web is where one more often can find information of high value. These closed channels, also known as the criminal underground, can extend beyond the proper dark web and into private criminal forums hosted on Telegram, Discord, and other places. Why Does the Dark Web Matter for Third-Party Risk Management? Third-party risk management teams are tasked with assessing risk across the entire full vendor lifecycle, from vendor selection to relationship termination. When it comes to assessing cybersecurity risk, one of the most important questions to understand is “has my vendor recently experienced a cyber attack or breach?” Unfortunately, current methods to assess this information – questionnaires, onsite audits, and  penetration testing – can’t fully answer this question. The dark web provides a unique view into that you cannot get elsewhere, helping identify several high-risk factors that a vendor has, or is about to breached: Ransomware extortion. Ransomware operators use extortion sites to threaten their victims into paying ransoms, under threat of publicly releasing stolen data. While the practice is deplorable, these dark web sites provide an early warning signal that one of your third-parties has been struck by ransomware. In some cases you can even use the sites to verify if any of your data was leaked via your third-party. Stolen data . Sensitive data including IP, PII, and HIPAA information frequently find their way to the dark web, likely indicating a breach of a third-party. Leaked credentials. Company email addresses and passwords are often for sale on the dark web. Leaked credentials indicate a potential attack coming soon. Company access for sale. Some threat actors use the dark web to sell direct access to a company through a vulnerability. By identifying the sale of these vulnerabilities, you can proactively stop future breaches of your third parties. Cyber chatter. Threat actors are known to discuss their recent attacks and upcoming plans on underground channels. Keeping a close eye on mentions of your third parties can help you stay in front of breaches and upcoming cyber attacks. Continuously Monitor the Dark Web with Third-Party Intelligence The dark web is too widespread and complex for any single individual to successfully monitor. Third-party intelligence from Recorded Future does that work for you, by automatically collecting and analyzing posts from the dark to deliver high-confidence indicators of risk including ransomware extortion, leaked credentials, and high-volumes of attention on high-tier forums. Third-party risk professionals use third-party intelligence to stay on top of their vendors, allowing them to proactively identify and mitigate risk as it surfaces. Figure 1: A company intelligence card, highlighting that the company Aperture Science had recent attention on the Netwalker ransomware extortion site. Learn More For more, tune into our webinar How to Use Dark Web Data to Shine a Light on Your Third-Party Vendors on Tuesday, May 18 at 11:00 AM ET."
            }
        },
        {
            "https://www.recordedfuture.com/accelerate-threat-hunting-threat-intelligence/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-04-15",
                    "source": "www.recordedfuture.com"
                },
                "text": "Simplify and Accelerate Threat Hunting with High-Speed, High-Confidence Threat Intelligence April 15, 2021 •\n                Neha Mehra As your attack surface continues to grow — expanding into the cloud and employees working from their homes — there are even more opportunities for threat actors to breach your organization. Relying on disparate threat feeds and static reports is manual and inefficient, often leading to incomplete threat research and missed threats. To detect and address today’s rapidly evolving threats, security teams need contextualized, high-confidence intelligence. The latest release for Recorded Future’s Threat Intelligence pairs high-speed, large-scale collection and automated link analysis to produce high-confidence indicator linkages. These validated linkages are powered by midpoint data sources like network traffic analysis , malware sandbox analysis, infrastructure analysis, enabling threat hunters to save time on investigation and radically simplify behavior profiling techniques to inform their security strategies and defenses. Purpose-Built Intelligence for Threat Hunters Recorded Future’s Threat Intelligence is powered by a proprietary analysis engine, the Intelligence Graph , which uses machine-learning and natural language processing to produce real-time, validated intelligence and the most complete picture of your threat landscape. Enhancements to the Threat Intelligence solution arms threat hunters with an unmatched combination of speed, scale, and context so you can: Get a thorough end-to-end view of your threat landscape The Intelligence Graph collects, aggregates, analyzes, and connects data in any language from a vast number of attacker, midpoint, and victim data sources to produce real-time, validated intelligence. Make faster, more informed decisions to reduce cyber risk and improve your risk posture Get access to over 5B Intelligence Cards™, which distill everything that’s known about a threat into a single view with dynamic risk scores and rules, to give you the context you need to inform your defenses, expedite threat hunting efforts, and solidify your security strategy. Accelerate advanced investigations, threat research, and threat hunting Get instant access to Recorded Future’s cyber repository of high-confidence intelligence and advanced querying capabilities to fuel deep, tailored investigations. Automatically insert threat hunting packages, malware detection rules, and more, into your existing network, endpoint, and malware security solutions to detect more threats and harden your security controls. Shine a light into the dark web to expand your visibility Recorded Future provides access to the largest real-time, automated collection of dark web information to support advanced dark web investigations and provide greater visibility on data leaks, credential harvesting, malware-as-a service offerings, and more. This includes hacker, criminal, invitation-only sites, and extremist forums. Our world class team of human threat intelligence analysts identify, access, and maintain persistence with closed, insider-access forums to support ongoing real-time collection. High-confidence insights, updated in real time, and backed by transparent scoring give threat hunters the information they need to disrupt adversaries and prevent damage to their organization. Request a demo of Recorded Future’s Threat Intelligence solution to see how Recorded Future’s high-confidence intelligence can be used to proactively detect, monitor, and defend against adversaries and their threats."
            }
        },
        {
            "https://www.recordedfuture.com/intelligence-security-outcomes-secops-tools/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-04-14",
                    "source": "www.recordedfuture.com"
                },
                "text": "How Contextualized Intelligence Maximizes Security Outcomes in SecOps Tools April 14, 2021 •\n                Ellen Wilson As the attack surface grows,  it’s difficult for security teams to maintain a comprehensive, real-time view of the threats at an operational level. With too little time and not enough information, analysts struggle to determine which alerts represent a critical incident and which may just be a redundancy or a false positive — all while true positives may be slipping through the cracks. To effectively respond to the multitude of alerts generated each day, security operations teams need a way to prioritize which alerts to focus on so they can maximize their efforts and mitigate risks. The latest releases for Recorded Future SecOps Intelligence create clarity in decision making by adding rich context within an organization’s existing SecOps tools to optimize threat detection and response workflows, ultimately reducing risk for the organization. Real-Time Context Drives Clarity in Decision-Making When internal alerts come from non contextual threat feeds and disparate systems, they lack the vital information needed for confident, quick threat remediation. Analysts spend valuable cycles manually researching IOCs, only to find incomplete pieces of what they need. With high-confidence, actionable intelligence tailored to SecOps use cases, analysts can spend more time proactively improving the security posture of their organization. Recorded Future provides automated, verified intelligence that connects the dots between indicators at scale, providing SecOps analysts with a more complete view of risk to their organization. With recent updates to our malware sandbox analysis and its Network Traffic Analysis capabilities, Recorded Future SecOps Intelligence module now offers clients even more actionable insights into suspicious and potentially malicious behavior, saving analysts investigation time and enabling comprehensive threat detection, hunting, and blocking workflows in SIEM and SOAR solutions. Intelligence Tailor-Made for SecOps Tools and Workflows Recorded Future connects the dots between the broadest range of sources to provide the critical context security operations analysts need to quickly discount false positives and identify the most significant threats. Recorded Future’s real-time, machine-readable intelligence makes it easy to access Recorded Future’s automated SecOps intelligence in your unique security tech stack. Our technology partner ecosystem, which includes over 90 integrations with leading security and technology providers, now includes integrations for the following SecOps tools: Splunk Mission Control: As an inaugural technology partner for Splunk Mission Control , the Recorded Future’s new plug-in allows users to detect critical threats and access full context, by correlating external threat intelligence against internal telemetry data in Splunk Mission Control. A correlation dashboard then provides Splunk users with visibility into technical indicators — and empowers them to make prioritization decisions based on a real-time Recorded Future risk score that is backed by transparent evidence. Splunk analysts can also get hands-on experience of real-time security intelligence to improve threat visibility and accelerate incident response through a free trial of the Recorded Future integration for Splunk Enterprise and ES . Start yours today to see Recorded Future intelligence in action in your own Splunk environment. Rapid7 InsightIDR: The explosive growth of indicators makes finding the needle in the haystack extremely resource-intensive for already overwhelmed security teams. With Recorded Future intelligence, security teams using Rapid7 InsightIDR can easily discover and validate findings. Utilizing the Recorded Future browser extension over Rapid7 InsightIDR allows users to enrich newly identified threats with evidence-based, real-time risk scores and risk rules — all without having to leave Rapid7 InsightIDR. This empowers users to confidently prioritize the most important findings in their environment, simplify workflows, and maximize the ROI of existing cybersecurity solutions. High-confidence insights, updated in real time, and backed by transparent scoring give security operations teams the information they need to disrupt adversaries and prevent damage to their organization. Request a demo of Recorded Future’s SecOps Intelligence module to see how you can equip your organization with the right intelligence, at the right time, in the right format, and empower them to identify and prevent threats faster within your SecOps tools and workflows."
            }
        },
        {
            "https://www.recordedfuture.com/enterprise-security-threat-visibility/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-04-13",
                    "source": "www.recordedfuture.com"
                },
                "text": "Powering Enterprise Security with End-to-End Threat Visibility April 13, 2021 •\n                Ellen Wilson As your attack surface grows — expanding into the cloud and employees’ homes — there are even more opportunities for threat actors to breach your organization. Relying on disparate threat feeds and static reports is manual and inefficient, often leading to incomplete threat research and missed threats. If you want to uncover and disrupt threats before they impact your business, you need to understand what poses a real risk as quickly as possible. Contextualized security intelligence is a crucial component of a truly proactive security strategy. Forrester even emphasizes the necessity of actionable threat intelligence to “drive compelling cyber risk management processes” in their newest report, How to Integrate Threat Intelligence Into Your Security Program . In order to minimize risk and maximize security outcomes, organizations must consider integrating real-time security intelligence at both operational and strategic levels of their security program. And now, with the new capabilities for its Threat Intelligence and SecOps Intelligence solutions, Recorded Future clients are armed with real-time, high-confidence intelligence for faster identification and triage of security concerns within existing security tech stacks and workflows. Threat Intelligence Accelerates Advanced Investigations Developed for threat hunters and security analysts, Recorded Future’s Threat Intelligence module arms security teams with vital information they need to inform their organization’s security strategy and proactively detect, monitor, and defend against adversaries. Today, Recorded Future announced several enhancements to its Threat Intelligence module, simplifying and accelerating advanced behavioral profiling techniques with access to even more validated, high-confidence intelligence. Recorded Future’s Threat Intelligence module is powered by a proprietary analysis engine, the Security Intelligence Graph , which collects, aggregates, analyzes, and connects data in any language from a vast number attacker, midpoint, and victim data sources to produce validated intelligence and provide the most complete picture of your organization’s threat landscape. Our unique combination of intelligence from network traffic analysis, malware sandbox analysis, and infrastructure analysis dramatically reduces advanced threat research and reporting workflows. Automatically insert threat hunting packages , malware detection rules, and more, into your existing network, endpoint, and malware security solutions to detect more threats and harden your security controls. SecOps Intelligence Simplifies Threat Detection and Triage Today, Recorded Future announced several major enhancements to the SecOps Intelligence module , making it easier than ever before to access an end-to-end view of your threat landscape with automated, actionable security intelligence — all directly integrated into your unique security tech stack and workflows for faster threat detection and response. Recorded Future connects the dots between the broadest range of sources to provide the critical context security operations analysts need to quickly discount false positives and identify the most significant threats. Real-time, machine-readable intelligence and an ever-expanding technology partner ecosystem, with over 90 integrations currently, simplifies access to high-confidence indicator insights for more confident threat identification and remediation: Splunk Mission Control: Recorded Future delivers security intelligence to arm security and IT teams that use Splunk Mission Control with the real-time information and supporting evidence they need to detect threats earlier and prioritize their findings with confidence. Splunk analysts can also get hands-on experience of real-time security intelligence to improve threat visibility and accelerate incident response through a free trial of the Recorded Future integration for Splunk Enterprise and ES . Start yours today to see Recorded Future intelligence in action in your own Splunk environment. Rapid7 InsightIDR: The explosive growth of indicators makes finding the needle in the haystack extremely resource-intensive for already overwhelmed security teams. With Recorded Future intelligence, security teams using Rapid7 InsightIDR can easily discover and validate findings. The Recorded Future browser extension also enables analysts to enrich newly identified threats with evidence-based, real-time risk scores and risk rules — all without having to leave Rapid7 InsightIDR. To learn more about how your organization can integrate an end-to-end view of threats at operational and strategic levels of your security program, download the Forrester report, How to Integrate Threat Intelligence Into Your Security Program ."
            }
        },
        {
            "https://www.recordedfuture.com/reducing-risk-modern-supply-chain/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-03-23",
                    "source": "www.recordedfuture.com"
                },
                "text": "Reducing Risk For the Modern Supply Chain With Third-Party Intelligence March 23, 2021 •\n                Trevor Lyness Third-party breaches are at an all-time high, and the proliferation of threat actors, ransomware groups, and targeted attacks on your third parties means that companies have serious cause for concern. The cybersecurity community was rocked by the news of SolarWinds , and news keeps flying as we see widespread attacks on technology such as Accellion FTA and Microsoft Exchange . Traditional methods to manage third-party risk can’t keep up. Governance, risk, and compliance (GRC) teams, as well as their security counterparts, continue to struggle to accurately assess risk given the continually shifting circumstances surrounding who they do business with. And for many, maintaining on-going visibility into their vendors’ constantly changing risk profile is a difficult or impossible task. There’s A Better Way To Manage Third-Party Risk — With Intelligence GRC and security teams need a proactive approach to identify, manage, and mitigate third-party risk, and intelligence is here to help. Intelligence acts as a source of truth on key risk indicators, eliminating the guesswork associated with assessing vendor risk. It reduces the time you spend on vendor risk assessments by 50%, and greatly enhances the quality of those assessments. Most importantly, intelligence gives you the confidence and context you need to take control of third-party risk. There’s no need for panicked responses to breaking news on third-party breaches. Intelligence enables you to stay in front of a constantly changing risk landscape. Gain Unparalleled Visibility into Your Third-Parties’ Risk in Real-Time Recorded Future’s Third-Party Intelligence Module uses the power of the world’s largest commercial collection platform to provide the most complete picture of cyber risk. By automatically collecting, aggregating, and analyzing information from over one million distinct sources, Recorded Future is able to provide real-time visibility into the risks of your third parties. Leveraging our proprietary data sourcing and unique background as an intelligence provider, we provide unprecedented insight into a wide range of security risks to allow you to instantly assess risk including: Security incidents — Cyber attacks and security breach disclosures are essential risk indicators to monitor third parties for. Our threat research team Insikt Group often adds their own analysis to major security incidents, giving you fast insight into what happened, why it matters, and what you can do about it Malicious network activity — Infrastructure abuse such as communication with C2 servers, hosted TOR notes, and malware detections all indicate that a company is highly vulnerable to attack. Dark web and ransomware extortion site attention — Cybercriminals often use the dark web and other underground channels to discuss cyber attacks involving your third parties. Ransomware extortion sites, for example, are a high-risk indicator that your third party was likely struck by ransomware. However, not all dark web sites are equal. Recorded Future is the only third-party intelligence provider granting access to invite-only, high-tier dark web forums. Leaked credentials — Exposed data from business accounts used by employees on dark web and paste sites leave third-parties exposed to credential stuffing attacks and account impersonation. Our massive collection of leaked credentials and data dumps is constantly growing. Intelligence Tailor-Made for Risk Management Teams For a long time, threat intelligence has held a reputation as being complex and inaccessible to those without a background in it. In fact, ten years ago, the notion of a GRC team actively consuming threat intelligence would have been laughable. Recorded Future’s Third-Party Intelligence module is specifically created for the GRC team, providing key risk indicators that help to assess, monitor, and mitigate risk. Transparent remediation details are provided with all findings, giving GRC teams the leverage they need to work with their third-parties to mitigate risk. In addition, intelligence is aligned to the NIST cybersecurity framework , making it simple to incorporate intelligence directly within existing business practices. If your organization uses NIST as the basis of vendor risk assessments, you can easily map intelligence directly to your questionnaire, allowing you to quickly validate submissions. Break Down Barriers Between Risk and Security Teams GRC teams and security teams both want to protect the business. However, they often use different terminology, frameworks, and technologies to do their jobs, creating misalignment and miscommunication when the teams need to work together. Modular intelligence offerings from Recorded Future work as your middleman, providing a common language and platform to understand, communicate, and action risk across teams. See Third-Party Intelligence In Action Tune into our upcoming webinar, “ Deconstructing Supply Chain Attacks for Better Risk Management ,” on Wednesday, March 31 at 10:00 AM ET to learn how third-party intelligence can help protect your organization."
            }
        },
        {
            "https://www.recordedfuture.com/ibm-security-secops-intelligence/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-03-11",
                    "source": "www.recordedfuture.com"
                },
                "text": "IBM Security and Recorded Future: Better Together March 11, 2021 •\n                Ellen Wilson Today, IBM Security and Recorded Future are joining forces in a live webinar, Better Together: IBM Security + Recorded Future , to support security operations teams in developing an end-to-end threat management and security operations strategy. Now more than ever, speed to detect, investigate and remediate threats is key to reduce dwell time and impact of security cyberattacks. Register now to see how a tightly integrated end-to-end process of threat management can improve your team’s ability to make decisions quickly and mitigate risk. End-to-End Integrated Threat Management Solution As the attack surface grows, the abundance of security threats puts added stress on already overworked security professionals struggling to pinpoint, triage, and respond to real threats targeting their organization. With too little time and not enough information, trying to determine if an alert represents a critical incident or a false positive wastes valuable time while true positives may be slipping through the cracks. With IBM Security solutions, you can unite your defenses across the four pillars of threat management – visibility, detection, investigation and response. IBM Security provides real-time monitoring and correlation of the vast amount of security events and network traffic in your organization for faster identification and remediation of incidents. Augmenting these events and alerts with real-time intelligence from Recorded Future delivers more context to improve analyst efficiency and confidence. Using our joint solutions , analysts can reduce time spent understanding “why” an IOC is bad, and more time mitigating risk in their environment. Supercharging IBM Security QRadar with SecOps Intelligence To effectively respond to the multitude of alerts generated each day, security operations teams need a way to prioritize which alerts to focus on first so they can optimize their effort for maximum risk reduction. Security intelligence from Recorded Future creates clarity by adding rich context within IBM Security QRadar . Relevant insights, updated in real time, give security operations analysts the insights they need — when and where they need them — to make faster, more confident security decisions. Recorded Future automates the collection, analysis, and production of security intelligence at scale to drive accelerated responses across vast amounts of data. Using a sophisticated combination of our patented algorithm process and world-class human analysis, Recorded Future fuses the broadest range of open source, dark web, technical sources, and original research. This results in relevant insights integrated with IBM Security QRadar to empower security operations analysts with the insights they need to improve threat detection and response times. For the Okinawa Institute of Science and Technology (OIST) , the Recorded Future and IBM Security QRadar joint solution resulted in a 25% reduction of false positive QRadar offenses. Keita Nagase, OIST chief information security officer, also shared, “By integrating intelligence into our existing IBM Security QRadar system and workflows, and automating analysis, we believe we have improved the accuracy and operational efficiency of security monitoring by a factor of three or four.” Accelerating Intelligence-Driven Investigations in IBM Security SOAR Orchestration and automation are key drivers for digital transformation, enabling organizations to optimize existing processes, lower costs, fill personnel gaps, and gain a competitive edge. Recognizing these clear benefits, security operations teams are embracing SOAR technology to collect and analyze threat data from multiple sources and automate repeatable incident response tasks. But for SOAR solutions to work effectively, they require a series of defined playbooks designed to automate repeatable security workflows — and these playbooks are only as smart and effective as the data used to construct them. IBM Security SOAR helps security teams respond to cyber threats with confidence, automate with intelligence, and collaborate with consistency. It captures and codifies established incident response processes into dynamic playbooks to guide and empower security analysts with knowledge to resolve incidents. Augmenting investigations with external intelligence from Recorded Future allows analysts to resolve incidents faster, validate risk assigned to artifacts, and reduce overall risk to the organization. Recorded Future delivers more context than threat feeds, updates in real time so intelligence stays relevant, and integrates out-of-the-box with IBM Security SOAR . With access to the right intelligence from the broadest set of sources, you can trust that IBM Security SOAR has all the information it needs to automatically make real-time decisions that strengthen your organization’s security. Register now to see the IBM Security and Recorded Future solutions in action, or request a personalized demo ."
            }
        },
        {
            "https://www.recordedfuture.com/intelligence-for-aws-alerts/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-03-10",
                    "source": "www.recordedfuture.com"
                },
                "text": "Using Intelligence to Prioritize AWS Guard Duty Alerts March 10, 2021 •\n                Meghan McGowan Security operations teams are inundated with alerts and threats making it difficult for them to identify what is important. Intelligence integrated into third-party products can help prioritize, but one size doesn’t fit all when it comes to intelligence, and bad data can actually lead to more noise.  At Recorded Future we improve security by making it easier to find and address the alerts that matter using  external context around potential threats. One of our core guiding principles at Recorded Future is that security intelligence is for everyone. No matter what security role you have or business area you work in within your organization, intelligence makes a big difference. This is why we introduced Recorded Future Express — our browser extension that delivers real-time risk scores and context on indicators of compromise and vulnerabilities at zero cost. Recorded Future Express works with AWS Guard Duty to dramatically accelerate investigation time. Intelligence is delivered directly on top of AWS GuardDuty, making it fast and easy to ensure that your AWS environment is protected. Use Recorded Future Express with AWS GuardDuty to speed up threat detection, investigation, and response to threats. Keeping your AWS Environments safe with Recorded Future Express When you see a finding in your AWS GuardDuty platform that you are interested in, simply click on it and then activate that Recorded Future Express browser extension. Express automatically reads the page and reports back with a simple 0-99 risk score, helping you to quickly determine whether you should be concerned. Recorded Future also provides context, showing you exactly why an indicator is risky. You can use this to quickly determine if an alert merits escalation. Sign up for Recorded Future Express at no cost today !"
            }
        },
        {
            "https://www.recordedfuture.com/different-kind-of-brand-protection/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-03-04",
                    "source": "www.recordedfuture.com"
                },
                "text": "Security Intelligence Handbook Chapter 10: A Different Kind of Brand Protection March 4, 2021 •\n                The Recorded Future Team Editor’s Note : We’re sharing excerpts from the third edition of our popular book, “ The Security Intelligence Handbook: How to Disrupt Adversaries and Reduce Risk with Security Intelligence .” Here, we’re looking at chapter 10, “Brand Intelligence.” To read the entire section, download your free copy of the handbook. It only takes one financially motivated criminal, dissatisfied customer, or disgruntled employee to tarnish your company’s hard-earned brand reputation . Fake or malicious online content, data leaks, and more can negatively influence customers and create financial risk for your organization — without ever touching your network or systems. Security analysts could spend virtually all of their time scoring the internet for company mentions and analyzing data points and still not be able to keep up with constantly morphing brand threats. To proactively protect your brand , you need to see everywhere your organization’s name, associated products, executive names, and keywords exist across the internet — at any given moment. That’s where brand intelligence comes in – harnessing automation, analytics, andhuman expertise to not only map, monitor, and score events related to brand risk, but also making it easy to take down malicious content, such as typosquat domains and  disinformation on social media. Discover what’s putting your brand at risk in “ The Security Intelligence Handbook, Third Edition: How to Disrupt Adversaries and Reduce Risk With Security Intelligence .” In this excerpt, which has been edited and condensed, see how a large HR solutions provider defeated typosquatting with a proactive approach to digital brand protection: Brand protection involves safeguarding an organization’s image, reputation, and customers from attacks that primarily never touch its network or systems. These threats include: Fake websites and social media accounts used to impersonate the organization or its employees for fraud and phishing attacks Malicious content and false information about the organization and its products posted on websites and social media platforms Counterfeit products and software offered in digital marketplaces and app stores Data leaks and leaked credentials from employees and executives Most of these threats are posed by financially motivated criminals, but they may also involve hacktivists, dissatisfied customers, competitors, and careless or disgruntled employees who reveal information online. Protect Your Brand and Your Customers To truly protect your brand, you need to be concerned about threats that leverage it to harm or influence your customers. Customers who are lured into a scam or fraud from an imitation of your website may hold your organization responsible. Those who buy a low-quality, counterfeit version of your product from an online marketplace may lose trust in your brand. Those who think one of your executives has published offensive content on the web may boycott your products — even if it wasn’t your executive who posted it. Pleading “it wasn’t our fault” won’t restore their trust or your reputation in any of these scenarios. A Different Kind of Detection Most of the activities we have been discussing in this handbook involve creating intelligence about attackers and their tools. Brand intelligence includes some of that, as well, but the emphasis is instead on detecting your organization’s name and brand everywhere they occur across the internet. You need to be rigorous about listing and searching for mentions of all your brand and product names, and keywords that are associated with them. These include the names of: Your parent organization Subsidiaries and business units Products Executives Managers and employees who engage with the public in web forums and via social media It also includes trademarks, service marks, and advertising slogans that appear on your organization’s authorized websites, since these are frequently used on phony websites. Uncovering Evidence of Brand Impersonation and Abuse Knowing what to look for empowers you to find evidence of brand impersonation and abuse in places many organizations never search. For example, a brand intelligence solution enables you to: Search domain registries to find domain names that include your organization or product name, or variations of them Crawl the web to find typosquatting domains Monitor social media to alert you to hashtags that include your organization or product name, or variations of them Scan social media to detect accounts that claim to belong to your organization, your executives, or your employees Check app stores to uncover unauthorized mobile apps using your branding Comb web forums for threat actors planning to impersonate your brand Use case: Typosquatting and fraudulent domains Typosquatting involves manipulating the characters in an organization’s domain name into nearly identical domains. For instance, threat actors targeting example.com might create a typosquat URL of exanple.com. Attackers often register thousands of domains differing by a single character from their target organizations’ URLs. They do this for reasons ranging from suspicious to fully malicious. Rogue websites using these modified domain names are built to look like legitimate websites. The rogue domains and websites are often used in spear-phishing campaigns against employees or customers, watering-hole attacks, and drive-by download attacks. Being alerted to newly registered phishing and typosquatting domains in real time is the best way to narrow the window of opportunity for threat actors to impersonate your brand and defraud unsuspecting users. Once the malicious infrastructure is identified, you’re able to employ a takedown service to nullify the threat. Uncovering Evidence of Breaches on the Web By monitoring the web — including private forums on the dark web — brand intelligence solutions enable you to uncover evidence of data breaches within your organization and partner ecosystem. You may find: Your customers’ names and data Financial account data and Social Security numbers Leaked or stolen credentials from your employees Paste and bin sites containing your proprietary software code Forums mentioning your organization and announcing intentions to attack it Forums selling tools and discussing techniques to attack organizations like yours Timely discovery of these indicators enables you to: Secure the sources of the data Find and fix vulnerabilities and misconfigurations in your infrastructure Mitigate future risks by improving security controls Identify ways to improve employee training and coding practices Enable your SecOps and incident response teams to recognize attacks faster It’s often possible to narrow down the source of a leak by looking at exactly what information and artifacts are found on the web, where they are found, and what else is found in the same place. For example, if you find product designs or software code on a dark web site and recognize that they were shared with only a few suppliers, you would know to investigate the security controls of those suppliers as part of your third-party risk management program. If your organization’s name was mentioned on a hacker’s forum whose members are known to attack certain applications, you could increase protection of the targeted applications by patching the systems they run on, monitoring them more closely, and adding security controls. Use case: Compromised data Threat actors make money from many types of compromised personal information and corporate intellectual property. Examples of compromised data for sale on the dark web include medical records, cloned and compromised gift cards, and stolen credentials to “pay for” services like Netflix and Uber, and items charged via PayPal, as illustrated in Figure 10-1. A high percentage of hacking-related breaches leverage stolen or weak passwords. Threat actors regularly upload massive caches of usernames and passwords to paste sites and the dark web, or make them available for sale on underground marketplaces. These data dumps may include corporate email addresses and passwords, as well as login details for other sites. Monitoring external sources for this type of intelligence will dramatically increase your visibility — not just into leaked credentials, but also into potential breaches of corporate data and proprietary code. Critical Qualities for Security Intelligence Solutions Of course, mitigating digital risk to your brand is not simply a matter of stumbling across one typosquatting domain or some isolated piece of stolen data. Somebody, or something, has to do the broader work of collecting masses of data, sifting through thousands of data points, analyzing relationships among the data points, deciding priorities, and ultimately taking action. The best approach is to use a brand intelligence solution that: Collects and scans data from the broadest range and variety of sources : Automation at the data-collection stage saves analysts precious time. The best solutions gather data not only from open web sources, but also from the dark web and technical sources. Maps, monitors, and scores brand risk : Through automation, advanced data science, and analytical techniques like natural language processing, effective brand intelligence tools enable analysts to link business attributes with related digital assets and detect, score, and prioritize events related to brand risk. Coordinates remediation : Robust brand intelligence solutions generate alerts and reports that provide information on how to remediate problems. They also integrate with tools that perform remediation immediately and with service providers that take down instances of domain abuse. Get ‘The Security Intelligence Handbook’ This chapter is one of many in our new book that demonstrates how to disrupt adversaries and measurably reduce risk with security intelligence at the center of your security program. Additional chapters explore different use cases, including the benefits of security intelligence for SecOps , vulnerability management , security leadership , and more. Download your copy of “The Security Intelligence Handbook” now ."
            }
        },
        {
            "https://www.recordedfuture.com/free-security-intelligence-splunk/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-02-23",
                    "source": "www.recordedfuture.com"
                },
                "text": "Announcing Security Intelligence for Splunk — For Free February 23, 2021 •\n                Ellen Wilson Today, we’re thrilled to announce the launch of a free 30-day trial of our integration for Splunk Enterprise and ES . This free trial offers Splunk users full access to our high-confidence, actionable, real-time SecOps intelligence within their own Splunk environment, empowering them to make faster, more confident security decisions. This announcement is directly related to one of our core guiding principles at Recorded Future, security intelligence is for everyone. Security intelligence provides clear, actionable context that all security roles can use, to work smarter and amplify their impact. Shortening the “Time to No”: Real-Time Context for Splunk For years, security operations teams have relied on SIEM technologies like Splunk to collect, correlate, and analyze security event logs from a variety of sources across their network environments. SIEM tools were built to help teams quickly detect and respond to threats, while streamlining compliance reporting and post-incident investigation. Yet as the attack surface grows, the abundance of security alerts puts added stress on already overworked security professionals. If you’re like most analysts, you’re plagued by alert fatigue and you struggle to pinpoint, triage, and respond to real threats targeting your organization using only information from your internal environment. You’re dealing with too little time and not enough information while your SIEM continues to generate thousands of security alerts each day, making it difficult to determine which alert represents a critical incident and which may just be a redundancy or a false positive. Valuable time is wasted getting to “no” for irrelevant alerts, while true positives may be slipping through the cracks. To effectively respond to the multitude of alerts generated each day, security operations teams need a way to prioritize which alerts to focus on first so they can optimize their effort for maximum risk reduction. Security intelligence from Recorded Future creates clarity by adding rich context within Splunk Enterprise and ES . Relevant insights, updated in real time, give security operations analysts the insights they need — when they need them — to make faster, more confident security decisions. Recorded Future automates the collection, analysis, and production of security intelligence at scale to drive accelerated responses across vast amounts of data. Using a sophisticated combination of our patented algorithm process and world-class human analysis, Recorded Future fuses the broadest range of open source, dark web, technical sources, and original research. This results in relevant, real-time insights, integrated with Splunk to empower security operations analysts with the insights they need to accomplish the following use cases: Alert Triage : Recorded Future enriches Splunk alerts with a risk score that updates in real time and is backed by transparent evidence. This provides the context analysts need to quickly discount false positives, identify the most significant threats, and take immediate action. Threat Detection : Quickly identify potential threats by automatically correlating internal data with Recorded Future intelligence and risk scores. This enables you to detect threats earlier and respond faster by adding valuable context in Splunk to internal network observables from firewall, email security, and endpoint solutions. Relevant insights, updated in real time, and integrated out-of-the-box into Splunk give security operations teams the right information at the right time to disrupt adversaries and prevent damage to their organization. See the power of Recorded Future for yourself by starting your free 30-day trial today! Not a user of Splunk? Check out Express, our free browser extension to access to our intelligence ."
            }
        },
        {
            "https://www.recordedfuture.com/managing-your-third-party-risk/": {
                "metadata": {
                    "dateAccessed": "2021-07-27",
                    "dateCreated": "2021-02-16",
                    "source": "www.recordedfuture.com"
                },
                "text": "Security Intelligence Handbook Chapter 9: Manage Third-Party Risk in Real Time February 16, 2021 •\n                The Recorded Future Team Editor’s Note : We’re sharing excerpts from the third edition of our popular book, “ The Security Intelligence Handbook: How to Disrupt Adversaries and Reduce Risk with Security Intelligence .” Here, we’re looking at chapter nine, “Third-Party Intelligence.” To read the entire section, download your free copy of the handbook. The SolarWinds breach continues to make headlines, underscoring the importance of third-party risk management programs . Yet supply chain attacks are not new, and most organizations are exposed to significant risks through their relationships with third parties. A recent Ponemon Institute study found more than half of organizations have had a breach that originated from a third party. As both digital and physical supply chains grow in size and complexity, every third-party relationship introduces an element of risk to your organization. That’s why you need a way to objectively understand, monitor, and measure your exposure to third-party risk in real time across your supply chain. Static risk assessment methods often fall short. Spreadsheets, questionnaires, and email are labor-intensive, prone to error or bias, and only capture risk at a point in time. Not to mention that companies often learn that their third party suffered a breach days or weeks after they’ve been reported. Organizations need real-time intelligence on their third parties to take rapid and informed risk-based action. Precision third-party intelligence provides automated visibility at scale to identify risk exposures hidden across the third-party ecosystem so that security and risk teams are able to prioritize and proactively manage third-party risk. Explore the impact of increasing third-party risk in “ The Security Intelligence Handbook, Third Edition: How to Disrupt Adversaries and Reduce Risk With Security Intelligence .” In this excerpt, which has been edited and condensed, you’ll learn how to reduce your overall risk of data breaches and reputational damage brought about through vulnerable third parties: Third-Party Risk Looms Large Because businesses and their supply chains are so tightly integrated, it’s critical to consider the security of your partners, vendors, and other third parties when assessing the risk profile of your own organization. A recent survey by the Ponemon Institute, “Digital Transformation & Cyber Risk: What You Need to Know to Stay Safe,” found that 55 percent of organizations have had a breach that originated from a third party, and 53 percent say their tools for managing third-party risk are only somewhat effective or are not effective. These and related statistics are shown in Figure 9-1. The writing is on the wall: Third-party attacks will continue to increase and get worse and will further complicate cyber risk management. Traditional third-party risk assessment methods rely on static outputs, like self-assessments, financial audits, monthly reports about new vulnerabilities discovered in the systems an organization uses, and occasional reports on the status of security control compliance. All of these become outdated quickly, and they don’t provide the comprehensive intelligence you need to make informed decisions about managing third-party risks to your organization. In contrast, real-time security intelligence, specifically thirdparty intelligence, enables you to accurately assess risk posed by third parties and keep assessments current as conditions change and new threats emerge. Traditional Risk Assessments Fall Short Many of the most common third-party risk management practices employed today lag behind security requirements. Static assessments of risk — like financial audits and security certificate verifications — are still important, but they often lack context and timeliness. Organizations following traditional approaches to managing third-party risk often use these three steps: They attempt to understand their organization’s business relationship with a third party and how it exposes their organization to threats. Based on that understanding, they identify frameworks to evaluate the third party’s financial health, corporate controls, and IT security and hygiene, as well as how these factors relate to their own organization’s approach to security. Using those frameworks, they assess the third party to determine whether it is compliant with security standards like SOC 2 or FISMA. Sometimes they conduct a financial audit of the third party. While these steps are essential for evaluating third-party risk, they don’t tell the whole story. The outputs are static and cannot reflect quickly changing conditions and emerging threats. The analysis is often too simplistic to produce actionable recommendations. Sometimes, the final report is opaque, making it impossible to dig deeper into the methodology behind the analysis. All of these factors create blind spots that leave decision-makers unsure whether crucial pieces of information might have been overlooked. When assessing third-party risk, do not rely entirely on self reporting questionnaires or a vendor’s inwardly focused view of their own security defenses. Round these out with an external, unbiased perspective on the vendor’s threat landscape. Three Things to Look for in Security Intelligence To accurately evaluate third-party risk in real time, you need a solution that offers immediate context on the current threat landscape. Security intelligence — delivered in the form of third-party intelligence — provides critical context that enables you to determine which shortcomings in your supply-chain partners’ defenses represent meaningful risks to your organization. Those include not only the risks present at the time of assessment, but also current risks and a historical view — which provide even more context to detect, prevent, and resolve risks. To effectively evaluate third-party risk, a third-party intelligence solution needs to offer: Automation and analytics to quickly and comprehensively sort massive amounts of data Real-time alerts on threats and changes to risks Ongoing visibility into your partners’ ever-changing threat environments Automation and analytics To manage risk for your organization, you need access to massive amounts of threat data from a wide variety of sources across the open web, the dark web, as well as technical and news sources and discussion forums. The same applies to assessing risks introduced by the third parties in your supply chain. However, given the scale of cybersecurity-related content from these sources, totaling billions of facts, you need a third-party intelligence solution that uses automation and algorithms to collect and analyze these details. It must be able to: Analyze, classify, connect, fuse, and index data points using natural language processing and multiple analytical models Generate objective, data-driven risk scores using a straightforward formula Provide clear, accessible evidence for the risk scores it assigns Real-time updates to risk scores Static assessments quickly become outdated. Weekly or monthly intelligence reports produced by human analysts provide essential overviews, but often arrive too late to enable effective action. Risk scoring is much more effective when it updates in real time and draws on a large pool of sources. These capabilities make risk scores much more reliable for making immediate assessments and reaching security decisions. For example, a trading partner might generally be regarded as low risk based on standard reporting. However, let’s say the partner suffers a data breach that may or may not affect your organization. If you rely solely on static risk assessments, you likely won’t know the breach happened in the first place — or you’ll find out too late. You may have to wait too long to acquire the intelligence needed to accurately evaluate the risk. What was the cause of the breach? Was it an exploited vulnerability in a system used by the partner? A social engineering attack? Static assessments alone do not provide the evidence required to justify asking that third party to put additional security controls in place. If you want to boost the effectiveness of your third-party risk program, start by thinking critically about five key questions: Who are my most critical vendors? What am I legally accountable for? What is my current vendor risk assessment process? Who else in my organization needs this information? How does the global threat landscape affect my partners? Transparent risk assessments What’s the point of a risk assessment if you can’t use it to get your third parties to take action? Information without context leaves us like Cassandra in Greek mythology. In a bid for her love, the god Apollo gave her the gift of prophecy, but still she scorned his romantic advances. In his anger, Apollo let her keep her foresight, but he cursed her so that nobody would ever believe her warnings about the future. Many risk assessments today suffer the same fate as Cassandra’s prophecies. When we rely on vague scoring methods or opaque sourcing, our advice is hard to accept, even if it’s accurate. Too often, organizations fail to act on intelligence because leaders don’t understand it or don’t know the source. A security intelligence solution must show the risk rules that are triggered by an alert — and be transparent about its sources (Figure 9-2). This enables security professionals to see for themselves why something like an alert on a particular IP address might represent a real risk. The extra detail also eliminates the suspicion that information might have been overlooked. This context allows for faster due diligence and reference checking, including when evaluating static assessments. Responding to High Third-Party Risk Scores What do you do when faced with high risk scores for a third party? Not every data breach justifies terminating business with that partner. Just about every organization contends with cyberattacks and unexpected downtime, and partners are no exception. The more important issue is how they (and you) deal with incidents and take steps to reduce future risks. A change in risk scores may present an opportunity to talk with your business partners about their approach to security. On your end, it’s important to look more closely at whether the risk rules that were triggered will impact your organization’s network. For example, a partner’s risk score might increase because typosquatting websites closely resembling legitimate websites operated by the partner were discovered. Putting those sites on the deny list in your own network is one way to thwart phishing campaigns while you investigate what steps that partner plans to take to protect its brand identity. For smart security decisions that involve your third parties, you need up-to-the-minute context and evidence provided by third-party intelligence. Get ‘The Security Intelligence Handbook’ This chapter is one of many in our new book that demonstrates how to disrupt adversaries and measurably reduce risk with security intelligence at the center of your security program. Additional chapters explore different use cases, including the benefits of security intelligence for SecOps , vulnerability management , brand protection , and more. Download your copy of “The Security Intelligence Handbook” now ."
            }
        },
        {
            "https://www.recordedfuture.com/best-practices-robust-identity-management/": {
                "metadata": {
                    "dateAccessed": "2021-11-21",
                    "dateCreated": "2021-11-17",
                    "source": "www.recordedfuture.com"
                },
                "text": "Best Practices for Robust Identity Management November 17, 2021 •\nHarry O'Brien Strong identity authentication is more important than ever before as organizations face an expanding threat landscape and unprecedented level of attacks. This is further compounded with the rapid growth in remote work and digital interactions across multiple channels, as it introduces new challenges for security and IT teams responsible for securing their employees’ and customers’ identities. In short, verifying user identities and controlling access to sensitive data is critical, but difficult to achieve. A recent Forrester report, Best Practices: Identity Management and Governance , outlines these challenges, along with many others, that security and identity management teams are facing today. The report found that many organizations are overprovisioning their employees’ access to systems, with research finding that breached employees had 86% more access than required. And, according to Forrester, “despite attempts to address identity sprawl, many organizations struggle to maintain a consistent, rules-based approach to centrally orchestrate the vast array of user accounts and digital access points under their stewardship,” leaving these organizations vulnerable to identity fraud and exposed to financial, legal, and reputational consequences. It’s clear that organizations today require an automated, high-confidence method of managing access and ensuring the authenticity of all users on their network, but this is easier said than done as teams struggle to proactively mitigate the risks that dynamic users and access points create. With this in mind, Forrester outlined 10 key functional areas within identity management that organizations must prioritize, providing best practices within those specific areas. With an intelligence-driven approach to these functional areas, organizations can rest assured that they have a real-time, high-fidelity view of their identity security posture. Automate Password Resets Forrester reports that, “A North American healthcare organization spends $160 to $170 per employee per year on password-related issues… Automation can reduce these costs.” By automatically collecting information on compromised credentials from a vast range of open source, dark web, and technical sources, the Recorded Future Identity Intelligence module offers real-time, machine-readable intelligence that can be directly integrated with existing identity management workflows within any tool, including SOAR solutions like Swimlane . This approach enables organizations to scale their identity management processes, saving time and money for the business, while offering an unmatched source of truth for identity authenticity. Tune Identity Analytics To Avoid False Positives Forrester also recommends that security and identity teams “leverage analytics tools to deliver intelligence across a range of identity use cases.” Additionally, Forrester insisted that these intelligence solutions will only benefit teams if they are able to “parse the signal from the noise” and “ingest, normalize, interpret, and present the data for accurate, actionable results.” Recorded Future’s Identity Intelligence module provides unmatched access to stolen credential information, related to both employee and customer identities, providing organizations with high-confidence, relevant alerts. Organizations can then confidently take action and block access to corporate systems before the compromised identities of employees are exploited, and can ensure customer credentials are secure when accessing any portals or information. This ultimately empowers organizations to be more proactive in preventing identity fraud and dramatically reduces the amount of time it takes to prioritize and respond to real risks to the business. Forrester makes it clear that as the attack surface grows daily, organizations need to advance their security and identity practices and deepen their understanding of their threat landscape. With Identity Intelligence from Recorded Future, organizations are able to quickly detect threats and initiate downstream response workflows, disrupting adversaries before damage is done. To learn more practical steps you can implement now to inform better decisions with risk-based context, request a demo of the Identity Intelligence module and read the full Forrester report ."
            }
        },
        {
            "https://www.recordedfuture.com/recorded-future-partners-swimlane-identity-fraud-protection/": {
                "metadata": {
                    "dateAccessed": "2021-11-21",
                    "dateCreated": "2021-11-04",
                    "source": "www.recordedfuture.com"
                },
                "text": "Recorded Future Partners With Swimlane For Intelligence-Driven Identity Fraud Prevention November 4, 2021 •\nEllen Wilson Recorded Future and Swimlane are pleased to announce the release of a new integration to support security teams in intelligence-driven identity fraud prevention. The integration will allow joint clients to leverage Recorded Future Identity Intelligence in Swimlane to accelerate detection of identity compromises and simplify response workflows, in order to maximize existing security investments. The Recorded Future Identity Intelligence module enables security and IT teams to detect identity compromises, for both employees and customers, and respond confidently — without any manual research. Recorded Future automates the collection, analysis, and production of intelligence from a vast range of open source, dark web, and technical sources, and then combines it with world-class research to help drive an accelerated response by security teams. This approach produces real-time intelligence at massive scale, offering an unmatched source of truth for identity authenticity that teams can utilize to prioritize identity threats and initiate downstream response workflows in Swimlane . With the Recorded Future integration for Swimlane , as identity compromises are detected, Swimlane’s low-code automation capabilities make it possible to enrich the exposed accounts, verify if the user is still an employee, if the current password matches the exposed password, and if the exposure was a recycled or novel leak. Depending on the results of this process, Swimlane initiates a specific workflow to remediate the threat and protect the organization: Revoke application access from former employees Employees are leaving the workforce or changing jobs at a record pace. Securely offboarding employees requires IT and security teams to follow procedures to ensure that the departing employees access to corporate systems is revoked. This process is often manual, and therefore error prone. The Recorded Future integration for Swimlane audits active corporate credentials and automatically revokes access in the event that a former employee still has active logins. This results in the remediation of vulnerabilities and time saved for analysts. Mitigate ransomware with company-wide secure passwords Recycling and reusing passwords is a security taboo, but employees inevitably do it anyway. This leaves corporate systems more vulnerable to external threats. With the Recorded Future integration for Swimlane, Swimlane notifies security teams when Recorded Future detects the use of recycled or commonly used passwords, so security teams can proactively ensure that every access point to internal systems are appropriately secured. Since all of this can be done with full automation on a recurring schedule, monitoring and responding to identity exposures no longer has to be a complex and time-consuming process. By eliminating the need to manually aggregate, correlate, and triage information, the Recorded Future Identity Intelligence module integrated into Swimlane empowers analysts to dramatically reduce the amount of time it takes to detect, investigate, and respond to identity fraud and real risks to their business. To learn more about how Recorded Future and Swimlane are partnering, register for the upcoming joint webinar: Automation and Intelligence: Key Ingredients for Modern Security Strategies on December 2 at 11AM ET."
            }
        },
        {
            "https://www.recordedfuture.com/strong-digital-identity-authentication-more-important/": {
                "metadata": {
                    "dateAccessed": "2021-11-21",
                    "dateCreated": "2021-10-27",
                    "source": "www.recordedfuture.com"
                },
                "text": "Why Strong Digital Identity Authentication Is More Important Than Ever October 27, 2021 •\nThe Recorded Future Team 79% of organizations experienced an identity-related breach within the past two years alone . And 85% of cybercriminals accessed critical systems and data using stolen credentials . These numbers are a frightening wake-up call that all organizations are targets –regardless of size, market, or industry– and that bad actors are constantly looking for new ways to exploit and breach your company. Particularly over the past couple of years, the rise of new technologies and new ways of working has significantly expanded the playing field for cybercriminals. Here’s why: Security practices are outdated : While most business now takes place outside the four walls of the office via cloud, SaaS, mobile and IoT, many organizations are still focused on securing the perimeter – an approach that can’t scale to support today’s highly distributed workforce and the cloud-based applications they need to access to be productive. Ecosystems are more dynamic and complex: Every person within your ecosystem – employees, partners and customers – is a target for cybercriminals looking to steal credentials and gain access to critical systems or information. Those players within your ecosystem likely don’t always follow password and security best practices. But, it is your responsibility to monitor and verify their identity authenticity at all times. Security, Operations and IT Teams are overwhelmed : The rapid shift to a mostly remote workforce created a spike in required credentials, with more people needing access to critical business systems, platforms and channels via multiple devices. Today’s security and IT teams are overwhelmed and, admittedly, far less optimistic about their abilities to secure employee identities. Take control with proactive, intelligence-led identity fraud detection Identity protection plays a critical role within an overall security strategy, which is why 80% of organizations have increased their focus on identity security over the past year. While you can’t stop cybercriminals from attempting an attack, you can outsmart, outmaneuver and stop them with the right solutions, processes and policies in place. With an intelligence-driven approach to identity fraud prevention, you can proactively defend your organization against identity compromises in real time and take action before damage to the business is done. What do we mean by intelligence-driven? Like most companies you are likely flooded with data 24×7, but what are you able to do with all that information? The key is having quick access to useful and actionable data that you can trust. That’s where intelligence comes in. Intelligence is the key to unlocking the potential of security programs and protecting our organizations. The right intelligence, in the hands of the right people, at the right time, stops attackers in their tracks. Here’s how it works: Account takeover prevention : Quickly detect compromises and initiate downstream response workflows before an account takeover occurs Employee identity monitoring : Automate monitoring in real time across the broadest set of sources, including the dark web for mentions of employee credentials Third-party identity monitoring : Automate monitoring and verification of customer and supply chain partner identities to detect and block identity fraud activities Recorded Future provides real-time intelligence at massive scale Cases of identity theft more than doubled in 2020, according to the Federal Trade Commission. And malware, which is often used for identity theft, increased 358% in 2020 . Now is the time to act by implementing an identity fraud protection strategy designed to scale with the pace and complexity of our digital world. With Identity Intelligence from Recorded Future , your security and IT teams are no longer bogged down by manual research. Recorded Future automates the collection, analysis, and production of intelligence from a vast range of open source, dark web, and technical sources, and then combines it with world-class research to help drive an accelerated response by your security team. To learn more about intelligence-led identity fraud detection and Identity Intelligence from Recorded Future, read our new eBook: It’s Time to Take a New Approach to Identity Fraud Protection ."
            }
        },
        {
            "https://www.recordedfuture.com/wethenorth-canadian-dark-web/": {
                "metadata": {
                    "dateAccessed": "2021-11-21",
                    "dateCreated": "2021-10-19",
                    "source": "www.recordedfuture.com"
                },
                "text": "WeTheNorth: A New Canadian Dark Web Marketplace October 19, 2021 •\nThe Recorded Future Team This Summer, Insikt Group discovered a new Canada-focused darknet marketplace called WeTheNorth, a salute to the Toronto Raptors basketball team slogan. This localized criminal marketplace features a variety of illegal goods and services for sale, many of which pose a threat to local and global enterprises. Insikt Group judges that with moderate confidence that WeTheNorth market was likely created to replace the now debunked The Canadian Headquarters, which shut down in July 2021.  Insikt Group’s Criminal Underground Team first discovered WeTheNorth in July 2021 in advertisements posted on open source forums such as Reddit. The new market appears similar in appearance to the now-debunked Empire market, Alpha Bay, and Torrez. What makes WeTheNorth unique is the lengths the administrators have gone to create a marketplace that is ostensibly geared toward protecting Canadian buyers and sellers and fostering a relatively safe place to complete transactions. Their mission statement is “to provide a safe environment so that Canadians are able to purchase safely, scam-free and away from the street violence, drugs and other items that are more potent, cleaner and safer to use.” The rules of the marketplace are geared towards reigning in what types of services can be sold, as well as being explicit about what is not allowed: sharing of third-party contact information, sales of weapons, and anything related to terrorism. Additional safeguards include mandatory two-factor authentication (2FA) for all vendors, when signing up users are given a unique token to protect their account, vendor fees are non-refundable to prevent scamming, and there are rules in place to prevent padding accounts with fake reviews. Like many darknet markets that operate in service of customers,  WeTheNorth offers 24/7 customer service in both English and French, and it’s open to anyone who uses the site. Vendors or buyers having trouble with the site can reach out and ask for assistance at any time, report technical issues, vendor problems, and scams. The types of transactions that occur on WeTheNorth are largely illegal and undermine any appearance of legitimacy. The most popular sales are drugs such as marijuana, cocaine, and party drugs, but WeTheNorth marketplace also allows the sale of digital products such as stolen credit cards, login credentials, accesses, software and hardware exploits, fraud tutorials, and more. Insikt Group researchers discovered issues with the policing and categorization of listings on WeTheNorth market. Many items are cross-posted and do not align with the category they are listed under. The administrator of the site, whose contact information is also associated with other darknet markets,  has not cracked down on cross-category posting and multiple listings, which could be an indicator that their attention is still focused elsewhere,  leaving WeTheNorth open to low-level drug sellers that wish to bypass market rules. WeTheNorth is a new Canadian dark web marketplace that appears to be hosting a semi-safe space for locals to sell illegal goods and services. There are strict rules in place and they have banned certain categories to help the site be more legitimate and not attract a certain clientele. Dark web markets like WeTheNorth serve as valuable sources of cyber threat intelligence for both private and public sector alike. Insikt Group has observed an increase in localized dark web markets and predicts with moderate confidence that criminal underground websites such as WeTheNorth will continue to increase as international criminals look to localize operations and avoid international law enforcement. As law enforcement cracks down on dark markets and threat actors move quickly to stand up replacement websites, it is imperative for information security teams to monitor these sources for fraud, theft, and targeting of employees, and be able to stop fraudsters and cybercriminals before they use these tools to move through the attack chain.  Recorded Future clients can access more information about WeTheNorth market and other darknet activity through Intelligence Cards in the Recorded Future platform."
            }
        },
        {
            "https://www.recordedfuture.com/using-intelligence-defend-worlds-largest-cities/": {
                "metadata": {
                    "dateAccessed": "2022-01-06",
                    "dateCreated": "2021-12-16",
                    "source": "www.recordedfuture.com"
                },
                "text": "Using Intelligence to Defend Two of the World’s Largest Cities December 16, 2021 •\nMatt Ellis How do you protect the two most populous cities in the United States? New York City and Los Angeles have a combined population of over 12 million people and cover vast swaths of land. The differences between the two cities are well documented—cultural, weather, geography, etc.—but when it comes to securing the cities against threats the two cities are more alike than different. During Predict 21: The Intelligence Summit , hosted by Recorded Future, a discussion was held with Geoff Brown, Chief Information Security Officer for the City of New York, and Timothy Lee, Chief Information Security Officer for the City of Los Angeles. The session was moderated by Niloofar Razi Howe, an executive, investor, and entrepreneur who served as Chief Strategy Officer and Senior Vice President of Strategy and Operations at RSA. To start the discussion both Brown and Lee kicked off with a description of the breadth of the threats they face, as well as the impact they have. “The vision for New York City is to be cyber resilient,” said Brown, articulating how the famous characteristic of the city carries through in their mission to protect its residents.  “We like to speak of our mission in two folds. One, we defend those services that New Yorkers rely on because those services are delivered through technology each and every day. And then two, we build and bring cybersecurity to New Yorkers themselves.” Lee also revealed that Los Angeles has its own set of guiding principles for their security program and said it boils down to a simple motto: “We aggregate all security events into the central platform and then provide two things based on the very simple concept of the motto: know yourself and know your enemy.” Razi Howe steered the discussion in the direction of the concept of knowing your enemy. “Who is the enemy, how broad is the threat landscape that you each face and how do you bring together the various categories of harm—not just cyber, but the physical, the logical, the geopolitical in a way that improves the security of the city and fulfills the mission?” she asked. “We have law enforcement entities, health services, response entities, sanitation entities, water utilities. The most interesting thing to your question about your adversaries is on behalf of a municipality. We have every enterprise,” Brown said. “We’re in charge of defending each and every one of those. So as you contemplate your adversaries, the municipality you live in probably is an attractive target to every single one of them. So we have to understand each type and then apply that intelligence into our defenses.” Lee agreed and offered the City of Los Angeles’ perspective. “For L.A., the threat landscape is very similar to New York and very broad. One of the things that is essential for today’s security operation is cyber threat intelligence. We rely heavily on that to identify who the attackers are and what and their methods.” Intelligence was a key topic for the discussion. Namely, what is intelligence? How do you gather it, disseminate its importance, and then use it to achieve your mission? “Intelligence in many ways is all the different ways that you collect information, you analyze that information, how you produce it, insight it offers and then more. How do you take action, right? When you think about the municipalities, the cybersecurity mission is, of course, perhaps most interested in those pieces of information that are germane to enriching defenses, reacting to vulnerabilities that are released from a technical perspective in the landscape, and then also trying to understand the geopolitical context that could incite an adversary of various disposition to hold your environment that you’re protecting at risk,” Brown said. Of course when you’re at the helm of protecting millions of people and the resources they rely on, how you build trusted relationships is a key concern. Collecting information, distributing it, and acting on it are all incredibly important questions when it comes to protecting constituents. Lee outlined how he views the City of Los Angeles’ responsibility to build trust. “Number one is you have to deliver what you promise. Second is: the quality of the service or quality of information that you provide has to be relevant to your audience. So we always try to collect the data from our constituents, but the key thing is you also need to provide the quality information back to them and relevant to them. So that it is actionable for them and benefits them.” “ As you’re thinking about your intelligence mission and when it comes down to it, there is a lot of information out there. And the distilling of that information into something that is useful for decision support or useful to take defensive measures around is an important process,” said Brown. “If you are working on that process, to Tim’s point, you might be a trusted partner because what you’re providing people can make decisions around. People can enrich their defenses. But it’s easy to get lost in the noise. You know, we talk in our industry a lot about signal versus noise. So creating the right tooling, having the right processes to understand your own environment, maybe producing your own information or intelligence, collecting everything that’s happening externally and then distilling it to signal before sharing, I think is incredibly important in order to garner trust.” To round out the discussion Razi Howe asked the panelists how they view the maturity of their intelligence programs. “How mature are we on this journey of having a true public private partnership. “Not just consuming threat intelligence, but, as you said, contributing back to the partnership and back to the ecosystem, where are we on this journey?” “To me, I think that we are at the beginning level still sharing raw data and threat information. But there’s a lot of room to grow. The good news is we are more aware of cooperative cyber defense—a must because our adversaries are coordinating so and you’ll see recent attacks are coordinated. We need to collaborate and coordinate, and make a push to keep growing and improve our maturity on threat intelligence sharing,” said Lee. Brown agreed and sees great potential for the intelligence community. “I think I would put it quite simply: we have the right ambitions as a community. We have the right ambitions. You look at that model that Tim has and they’re actually cooperating and they’re sharing information with New York City. We have similar capabilities. But where we’re aiming, we hope, is to get more collaborative in how we’re doing our defensive operations. And as we pursue maybe those correct ambitions now, we’re starting to see that the entities that we need to sort of stand shoulder to shoulder with and then collaborate with are also being stood up. That’s an encouraging future.” To watch the full session, as well as all of the other great sessions at Predict 21, click here ."
            }
        },
        {
            "https://www.recordedfuture.com/one-thing-security-teams-need-2022/": {
                "metadata": {
                    "dateAccessed": "2022-01-06",
                    "dateCreated": "2021-12-15",
                    "source": "www.recordedfuture.com"
                },
                "text": "This is the 1 Thing Every Security Team Needs Before 2022 December 15, 2021 •\nJohn Wetzel It’s the end of the year. You have some leftover budget. And every security vendor is trying to sell you on spending with them. Here’s my unapologetically biased take: You should spend it on intelligence data . At Recorded Future, we believe intelligence—threat-oriented data—empowers defenders. And more than anything else, you need threat data ahead of next year. Here’s three big reasons why. No one says, “I wish I hadn’t bought intelligence.” Intelligence about threats—from rogue nations to ransomware actors—informs every aspect of your security program. From immediate knowledge of exploited vulnerabilities to confidence and validation around your supply chain, intelligence informs a broad set of security priorities. Intelligence can provide immediate value to your enterprise, both as a flashlight—to illuminate threat actors on dark web and beyond—and as a mirror—reflecting malicious credentials, domains, and owned assets. Appliances take time to implement—threat intelligence value can be immediate. Data is—almost—immediately useful. New clients continually tell us of wins they’ve had with our intelligence, like discovered leaked credentials, newly registered look-alike domains, and real-time alerts on exploited vulnerabilities. Most security appliances and tools take months to implement. That’s not to say you don’t need them, but they need proper implementation and integration. Data has immediate value, but can be distributed and aid automation with time. Intelligence informs your 2022 security decisions. Threat actors get a vote. Many security teams found themselves pivoting rapidly over the past couple of years, first from pandemic-related quarantines and stay-at-home orders then from the flood of ransomware actors. What will you need next year? Want to implement SOAR? You need intelligence to drive the automation decisions. Zero Trust? Intelligence to help prioritize threats. Intelligence can inform your buying decisions, helping your teams work more efficiently while also moving fast. Our clients use our modular Intelligence Solutions to tackle a variety of problems."
            }
        },
        {
            "https://www.recordedfuture.com/six-ways-intelligence-stops-ransomware/": {
                "metadata": {
                    "dateAccessed": "2022-01-06",
                    "dateCreated": "2021-12-09",
                    "source": "www.recordedfuture.com"
                },
                "text": "6 Ways Intelligence Stops Ransomware December 9, 2021 •\nJohn Wetzel 1. Intelligence finds your leaked credentials before threat actors use them. Criminals are lazy. Rather than trying to breach your network, it is way easier to find your employees’ leaked credentials—whether hacked from past breaches or discovered in insecure databases. Threat actors compile these credentials into databases that help them in two ways. First, criminals can use credential databases for targeting by searching these databases by company name. Organizations with more credentials may indicate there is a higher likelihood that a password has been re-used by an employee for a personal purpose. Password reuse gives criminals an easy entry into your networks. Second, criminals have so many credentials from the past few decades of breaches (literally tens of billions) they can leverage data science and machine learning. Criminals have huge databases called rainbow tables they can use to find the plaintext passwords from cryptographic hashes, like SHA1. Identity intelligence can help you find and remediate these leaked credentials before they are weaponized by criminals or ransomware actors. Whether through manual alerts to discover and investigate credentials or automated, API-ready intelligence to drive your security orchestration and automation (SOAR) processes, intelligence keeps your passwords private. 2. Intelligence can help identify exposed servers that ransomware actors use for access. Nothing makes a criminal smile like an open door. Modern enterprises are complex, with hundreds of possible entry points over thousands of endpoints. Intelligence can help you identify your exposed attack surface, whether from accidental exposure of internal domains, cloud storage keys on code repositories, or unmonitored, owned IP address space which has been taken over for nefarious purposes. Intelligence can even help identify if these resources are being advertised as “hacked” on the criminal underground. Criminals often boast or advertise access to certain companies or proprietary information on Tor-enabled forums and marketplaces, a.k.a. the so-called dark web. Proper monitoring for this type of exposure gives you added assurance for your security team. 3. Intelligence tracks botnet access brokers like Trickbot. Botnet teams use tools like Trickbot to gain access to organizations and servers. Once access is established, these botnet teams serve as access brokers, selling their established access on corporate networks to ransomware teams to invade and exploit. Intelligence research teams, like our Insikt Group, track these and hundreds of other actors and tools, providing the most up-to-date information on their latest activities. More than monitoring, the latest intelligence helps teams like our Insikt Group create Yara and Sigma rules you can implement into your production Security Incident Event Monitoring (SIEM) tools, helping you speed detection of malicious tools based on their behaviors—not just their signatures—giving you intelligence that drives action in your organization. 4. Intelligence finds new vulnerability exploits before they get weaponized. Vulnerabilities are a perpetual challenge to all organizations, but not all vulnerabilities are created equal. Intelligence helps you identify and prioritize vulnerabilities based on the threat to your network and technology stack. Exploited vulnerabilities mentioned on dark web criminal forums, or advertised proof-of-concept exploit code for sale, show you early warnings on criminal intent-to-use. Ransomware actors continually improve their malware access and persistence using new exploits. Intelligence tracks real-world weaponization of vulnerability exploits, such as our proprietary harvesting of code samples and our malware sandbox showing which vulnerability exploits are appearing in the wild. Risk scoring to show you which vulnerabilities are being actively exploited helps you patch before a breach. 5. Intelligence hunts ransomware tools on your network to detect them fast. If ransomware actors get into your network, speed is essential to defense. Earlier in this post we talked about how intelligence can help you discover and defend against ongoing attacks by assisting threat hunting efforts. But ongoing attacks are often enabled by external infrastructure command & control servers (C2). Intelligence can provide immediate, up-to-date context on malicious infrastructure, like ransomware C2 IP addresses or IP addresses which appear to be serving malicious content. And at-a-glance context, like our Risk Rules, can save your security operations teams precious moments when defending against ransomware attacks. 6. Intelligence finds and tracks victims so you can have confidence in your supply chain. Unfortunately, ransomware continues to be a plague threatening nearly every organization around the world. Intelligence can help you identify the numerous victims of ransomware attacks, and bolster your security team efforts to ensure a secure supply chain. For example, our Third Party Intelligence can help track companies in your supply chain, from vendors and partners to potential merger and acquisition targets, illuminating possible security flaws or cyber attack events like ransomware attacks for further investigation by your security teams. And our Insikt Group continually tracks, and even interviews, the criminals behind ransomware gangs to provide you and your team the best insights into their intentions and activities. Intelligence is a powerful way to drive prevention efforts against ransomware, while helping strengthen security efforts overall. At Recorded Future, our mission is to enable defenders, and we believe intelligence can be one of the most substantial tools in your arsenal. To learn more about the state of ransomware going into 2022 view our webinar, “What Intelligence Tells Us About Ransomware in 2021 — And What to Expect Next.”"
            }
        },
        {
            "https://www.recordedfuture.com/stop-threats-reduce-costs-impact-intelligence/": {
                "metadata": {
                    "dateAccessed": "2022-01-06",
                    "dateCreated": "2021-12-02",
                    "source": "www.recordedfuture.com"
                },
                "text": "Stop Threats. Save Time. Reduce Costs! The Real-Life Impact of Intelligence December 2, 2021 •\nRueben Rodriguez The days of old where security teams had endless budgets to try and thwart threats—both known and unknown—have now been replaced with mandates to be judicious with budgets, people, and technology investments. All of these factors are often in short supply and require a strategic approach in order to be proactive in preventing threats and at the same time mitigating both risk and costs. At Recorded Future we are committed to helping our customers across every industry and geography be able to do more with the technology and people they have as the intelligence we provide is a force multiplier.  We firmly believe intelligence is the equalizer and is the only way to stay ahead of adversaries looking to do damage to your business, either directly from attacks or indirectly by tarnishing your reputation and trust with your customers. How? Recorded Future has technology and people continuously scanning the digital world to collect, collate, and provide real-time context on threats—in whatever form they may take. We then present this to your teams within existing workflows so they can make critical decisions to prevent attacks and protect what matters most to you. To help illustrate measurable benefits our customers can experience with the real-time intelligence available in the Recorded Future Platform , or directly via integrations, we commissioned a Total Economic Impact™ Study conducted by Forrester Consulting. Forrester Consulting independently interviewed multiple customers from various industries in order to conduct a thorough analysis and create a financial model that helps illustrate the potential benefits users are able to realize. Based upon the study’s findings, interviewed customers who have invested in the Recorded Future Platform have been able to realize benefits which include greater security operations efficiency, greater proactive measures to stay ahead of threats, and better defense of their brand value.  With intelligence, customers are able to streamline their security workflows from both a human perspective (security analysts) and from an automated perspective via SIEM and SOAR integrations while reducing the number of threat feeds they have in place. The Total Economic Impact study brings to light how intelligence from Recorded Future can provide customers with the following benefits: R educe security investigations by 40% Avoid security breaches due to early detection Reduce the number of threat intelligence feeds for your security team Shift investigations to more junior SecOps analysts by 50% or $170k in savings per year Identify and prioritize critical vulnerabilities Prevent brand impacted cost by over $213k per year To help understand the benefits you may experience with intelligence from Recorded Future please be sure to get a full copy of The Total Economic Impact™ of Recorded Future Intelligence Platform .   Learn firsthand from customers how intelligence is truly the security equalizer and is often the difference between becoming a potential victim and proactively preventing damage from threats."
            }
        },
        {
            "https://www.recordedfuture.com/combatting-data-and-credential-exposure-with-intelligence/": {
                "metadata": {
                    "dateAccessed": "2022-04-03",
                    "dateCreated": "2022-03-30",
                    "source": "www.recordedfuture.com"
                },
                "text": "Combatting Data and Credential Exposure With Intelligence March 30, 2022 •\nEllen Wilson Throughout 2021, organizations faced a variety of cyber threats targeting their brands. While threats affecting brands, such as typosquats, domain abuse, and data exposure, do not garner as much attention as ransomware attacks, it is crucial that organizations actively respond to and mitigate these threats. Threats to brands affect organizations in every sector, both public and private, and can be used as staging grounds by attackers for future cyberattacks. According to the 2021 Brand Intelligence Trends report by Insikt Group®, data exposure continued to be a persistent threat to organizations across all industries. Data exposure can be caused by a variety of means, such as misconfigured databases and poor security protecting data held within these repositories. Several organizations felt the repercussions of poor data security in 2021 when millions of their records were exposed and in some instances illegally accessed by threat actors to be sold online to other cybercriminals. In fact, the average total cost of a data breach in the United States, the country with the highest average cost for 11 years in a row, increased to $9.05 million from $8.64 million, and the average total cost globally was $4.24 million USD in 2021. The Impact of Exposed Data and Credentials The information found in data breaches often consists of customer or employee data including PII, which poses a critical risk to organizations everywhere. In fact, according to the 2021 Data Breach Investigations Report , 61% of breaches involve compromised credentials, and every year billions of credentials appear on the dark web, paste sites, and in data dumps shared by cybercriminals. Cybercriminals often purchase leaked credentials from these sources in hopes of gaining a foothold into organizations in order to conduct phishing and spearphishing attacks, brute-force password cracking attacks, exfiltrate information, initiate ransomware, and more. Resetting passwords for leaked credentials isn’t difficult, but maintaining the widespread visibility necessary to discover when leaked credentials appear is far more challenging. Unable to monitor the places where the most common brand attacks take root – dark and closed web sources, as well as social media – organizations are left exposed to financial, legal, and reputational consequences. Security teams miss vital intelligence about the elevated risk to their brand or infrastructure, can’t identify upcoming brand attacks, and are left scrambling to respond once the attacks are underway. The Visibility To Act Faster To truly protect your brand, your security team needs expertise and assistance in order to collect mass amounts of data, sift through thousands of data points, analyze relationships among the data points, decide on priorities, and ultimately take action. Brand Intelligence from Recorded Future gives teams actionable, up-to-the-minute analytical insights to proactively defend against new and emerging threats to your brand, products, employees, executives, and customers. By automatically collecting, aggregating, and analyzing data from an unrivaled range of sources spanning the open, closed, deep and dark web, in real time; security teams are able to proactively detect and take down malicious sites faster and more efficiently. To learn more about the top threats targeting your brand, including how you can combat data and credential exposure with intelligence, watch this on-demand webinar now"
            }
        },
        {
            "https://www.recordedfuture.com/shields-up-securing-your-perimeter/": {
                "metadata": {
                    "dateAccessed": "2022-04-03",
                    "dateCreated": "2022-03-22",
                    "source": "www.recordedfuture.com"
                },
                "text": "Shields Up: Securing Your Perimeter March 22, 2022 •\nSara Jelen Editor’s Note: The following post originated here . Due to further sanctions and political measures from the U.S. and European countries on Russia, governments on both sides of the Atlantic have warned about the cybersecurity implications of Russia’s war on Ukraine and the potential for cyber attacks. Just yesterday, the White House reiterated those warnings , based on evolving intelligence that the Russian government is exploring options for potential cyberattacks. The UK’s National Cyber Security Centre (NCSC) has also warned British organizations about the heightened state of cyber risk and urges them to begin strengthening their digital defenses sooner rather than later. As these government agencies urge private sector partners to harden cyber defenses immediately and to focus on their digital perimeter, the Cybersecurity & Infrastructure Security Agency (CISA) has shared their Shields Up guidance memo for all organizations seeking to adopt a heightened cybersecurity posture and protect their critical assets. The advice includes improving access control, adding layers of user authentication to their networks, patching all systems, and getting effective incident response plans on the ground—all to reduce the likelihood of a severe cyber attack on critical assets. Reduce the likelihood of damaging cyber intrusion CISA’s Shields Up advisement recommends protecting and hardening the most critical assets in an organization, while recognizing the challenges that many organizations face in finding the resources needed to execute these urgent security improvements. Attack Surface Intelligence from Recorded Future can be the best ally for following this guidance. The solution enables security teams to easily discover and locate all critical assets, as well as identify and prioritize risks to them so that organizations can act fast, armed with reliable data. How can an organization make sure it’s following Shields Up guidance, to prevent an organization from falling victim to cyber attacks? Verify remote access points Shields Up spotlights the importance of verifying that all remote access to an organization’s network is secure. The first step is to make sure teams have the necessary understanding and control over what and who can connect to an infrastructure. This way, teams will be able to monitor for threats in order to catch and mitigate potential attacks as quickly as possible. Attack Surface Intelligence allows organizations to discover all remote access points and VPNs used on its network, instantly. By knowing how users are connecting to a network and from where, security teams will be able to limit the number of access points, making them easier to monitor and control. Furthermore, it provides them with additional information on each remote access point, informing them if there are any unused ports, protocols and services, and allowing them to restrict them from being accessible. Prioritize remediation of vulnerabilities and misconfigurations As per the guidance offered by CISA’s Shields Up memo, one of the main practices toward improving your security posture and reducing the likelihood of an attack is to ensure that all devices, software and internet-facing assets are patched for any vulnerabilities or misconfigurations. Malicious actors can easily scan external infrastructure to find unmanaged and vulnerable internet-facing assets. Organizations should also be prioritizing patches that address the known vulnerabilities listed by CISA here . Attack Surface Intelligence scans an organization’s assets against an ever-growing list of risk rules—helping teams to quickly identify which areas of an attack surface might be at risk and need to be patched first. Ranging from assets with potential risks that only need to be monitored for the time being to CVEs requiring triage as quickly as possible, teams will be continuously informed of all vulnerabilities and risks to their assets, mitigating the potential for an attack. Security teams can stay advised of any risks to their assets as well, such as hostnames pointing to local networks, staging and development subdomains that might be exposing sensitive information to the public, and even hostnames with self-signed certificates that when exposed can give attackers insight to internal servers. Disable all non-essential ports When threat actors begin reconnaissance on an organization, one of the first steps involves massive or localized port scanning. Shields Up also recognizes this, advising all organizations to catalog and disable non-essential ports. By keeping an inventory of all your external-facing assets, open ports, and services on each port, organizations can gain control in reducing its attack surface and maintaining security posture in the wake of current threats. The attack surface scanning from the Recorded Future Attack Surface Intelligence module provides a look into each open port, and every hostname, service and IP using those ports. It can also advise regarding particularly dangerous open ports—ones that are used by databases that can allow adversaries to exfiltrate data if left unprotected, without ACLs in place. Protect cloud assets CISA notes that misconfigurations and unsecure cloud services and applications are often the primary attack vector for adversaries. Threat actors use phishing and other techniques to exploit poor cloud security hygiene practices in organizations’ cloud services configuration. With so many new cloud assets being spun in, it can be challenging for your organization to maintain visibility over internet-facing perimeter while keeping a complete asset list that includes all cloud assets . Attack Surface Intelligence provides complete and persistent visibility into a cloud environment, ensuring that there are no unmanaged or misconfigured cloud assets that need to be decommissioned. With a chronological timeline of evolving infrastructure, security teams will know how many assets were created each day with information that connects each asset to known service platforms—which is crucial for spotting any newly spun up cloud instances. Heighten and maintain cyber hygiene The final step in CISA’s Shields Up advisory is to follow their cyber hygiene best practices to help reduce exposure to threats. One of their key points involves evaluating external network presence by conducting continuous vulnerability scanning. With Attack Surface Intelligence , an organization will be informed of any new or unknown assets quickly, allowing for timely investigation to uncover any malicious intent. And the resulting list of all newly identified assets will contribute to further targeted vulnerability scanning. Summary The implications for organizations during the war in Ukraine, whether economic, cyber, or both, will be felt well beyond the immediate region. Operations will be affected and supply chains can be attacked and interrupted. At this pivotal moment, organizations’ cybersecurity postures are truly being put to the test. The right moment to put shields up and protect infrastructure is now, and Recorded Future can aid organizations in navigating CISA’s Shields Up cybersecurity recommendations to ensure you are prepared to respond to and mitigate potential threats. To learn more, visit https://www.recordedfuture.com/solutions/attack-surface-intelligence/ Editor’s Note: The following post originated here ."
            }
        },
        {
            "https://www.recordedfuture.com/open-source-intelligence-definition/": {
                "metadata": {
                    "dateAccessed": "2022-04-03",
                    "dateCreated": "2022-02-19",
                    "source": "www.recordedfuture.com"
                },
                "text": "What Is Open Source Intelligence and How Is it Used? February 19, 2022 •\nThe Recorded Future Team Key Takeaways Open source intelligence is derived from data and information that is available to the general public. It’s not limited to what can be found using Google, although the so-called “surface web” is an important component. As valuable as open source intelligence can be, information overload is a real concern. Most of the tools and techniques used to conduct open source intelligence initiatives are designed to help security professionals (or threat actors) focus their efforts on specific areas of interest. There is a dark side to open source intelligence: anything that can be found by security professionals can also be found (and used) by threat actors. Having a clear strategy and framework in place for open source intelligence gathering is essential — simply looking for anything that could be interesting or useful will inevitably lead to burnout. Of all the threat intelligence subtypes , open source intelligence (OSINT) is perhaps the most widely used, which makes sense. After all, it’s mostly free, and who can say no to that? Unfortunately, much like the other major subtypes — human intelligence, signals intelligence, and geospatial intelligence, to name a few — open source intelligence is widely misunderstood and misused. In this blog, we’re going to cover the fundamentals of open source intelligence, including how it’s used, and the tools and techniques that can be used to gather and analyze it. What Is Open Source Intelligence? Before we look at common sources and applications of open source intelligence, it’s important to understand what it actually is. According to U.S. public law, open source intelligence: Is produced from publicly available information Is collected, analyzed, and disseminated in a timely manner to an appropriate audience Addresses a specific intelligence requirement The important phrase to focus on here is “publicly available.” The term “open source” refers specifically to information that is available for public consumption. If any specialist skills, tools, or techniques are required to access a piece of information, it can’t reasonably be considered open source. Crucially, open source information is not limited to what you can find using the major search engines. Web pages and other resources that can be found using Google certainly constitute massive sources of open source information, but they are far from the only sources. For starters, a huge proportion of the internet ( over 99 percent, according to former Google CEO Eric Schmidt ) cannot be found using the major search engines. This so-called “deep web” is a mass of websites, databases, files, and more that (for a variety of reasons, including the presence of login pages or paywalls) cannot be indexed by Google, Bing, Yahoo, or any other search engine you care to think of. Despite this, much of the content of the deep web can be considered open source because it’s readily available to the public. In addition, there’s plenty of freely accessible information online that can be found using online tools other than traditional search engines. We’ll look at this more later on, but tools like Recorded Future Attack Surface Intelligence can be used to find IP addresses, networks, open ports, webcams, printers, and pretty much anything else that’s connected to the internet. Information can also be considered open source if it is: Published or broadcast for a public audience (for example, news media content) Available to the public by request (for example, census data) Available to the public by subscription or purchase (for example, industry journals) Could be seen or heard by any casual observer Made available at a meeting open to the public Obtained by visiting any place or attending any event that is open to the public At this point, you’re probably thinking, “Man, that’s a lot of information …” And you’re right. We’re talking about a truly unimaginable quantity of information that is growing at a far higher rate than anybody could ever hope to keep up with. Even if we narrow the field down to a single source of information — let’s say Twitter — we’re forced to cope with hundreds of millions of new data points every day . This, as you’ve probably gathered, is the inherent trade-off of open source intelligence. As an analyst, having such a vast quantity of information available to you is both a blessing and a curse. On one hand, you have access to almost anything you might need — but on the other hand, you have to be able to actually find it in a never-ending torrent of data. How Is Open Source Intelligence Used? Now that we’ve covered the basics of open source intelligence, we can look at how it is commonly used for cybersecurity . There are two common use cases: 1. Ethical Hacking and Penetration Testing Security professionals use open source intelligence to identify potential weaknesses in friendly networks so that they can be remediated before they are exploited by threat actors. Commonly found weaknesses include: Accidental leaks of sensitive information, like through social media Open ports or unsecured internet-connected devices Unpatched software, such as websites running old versions of common CMS products Leaked or exposed assets, such as proprietary code on pastebins 2. Identifying External Threats As we’ve discussed many times in the past, the internet is an excellent source of insights into an organization’s most pressing threats. From identifying which new vulnerabilities are being actively exploited to intercepting threat actor “chatter” about an upcoming attack, open source intelligence enables security professionals to prioritize their time and resources to address the most significant current threats. In most cases, this type of work requires an analyst to identify and correlate multiple data points to validate a threat before action is taken. For example, while a single threatening tweet may not be cause for concern, that same tweet would be viewed in a different light if it were tied to a threat group known to be active in a specific industry. One of the most important things to understand about open source intelligence is that it is often used in combination with other intelligence subtypes. Intelligence from closed sources such as internal telemetry, closed dark web communities , and external intelligence-sharing communities is regularly used to filter and verify open source intelligence. There are a variety of tools available to help analysts perform these functions, which we’ll look at a bit later on. The Dark Side of Open Source Intelligence At this point, it’s time to address the second major issue with open source intelligence: if something is readily available to intelligence analysts, it’s also readily available to threat actors. Threat actors use open source intelligence tools and techniques to identify potential targets and exploit weaknesses in target networks. Once a vulnerability is identified, it is often an extremely quick and simple process to exploit it and achieve a variety of malicious objectives. This process is the main reason why so many small and medium-sized enterprises get hacked each year. It isn’t because threat groups specifically take an interest in them, but rather because vulnerabilities in their network or website architecture are found using simple open source intelligence techniques. In short, they are easy targets. And open source intelligence doesn’t only enable technical attacks on IT systems and networks. Threat actors also seek out information about individuals and organizations that can be used to inform sophisticated social engineering campaigns using phishing (email), vishing (phone or voicemail), and SMiShing (SMS). Often, seemingly innocuous information shared through social networks and blogs can be used to develop highly convincing social engineering campaigns, which in turn are used to trick well-meaning users into compromising their organization’s network or assets. This is why using open source intelligence for security purposes is so important — It gives you an opportunity to find and fix weaknesses in your organization’s network and remove sensitive information before a threat actor uses the same tools and techniques to exploit them. Open Source Intelligence Techniques Now that we’ve covered the uses of open source intelligence (both good and bad) it’s time to look at some of the techniques that can be used to gather and process open source information. First, you must have a clear strategy and framework in place for acquiring and using open source intelligence. It’s not recommended to approach open source intelligence from the perspective of finding anything and everything that might be interesting or useful — as we’ve already discussed, the sheer volume of information available through open sources will simply overwhelm you. Instead, you must know exactly what you’re trying to achieve — for example, to identify and remediate weaknesses in your network — and focus your energies specifically on accomplishing those goals. Second, you must identify a set of tools and techniques for collecting and processing open source information. Once again, the volume of information available is much too great for manual processes to be even slightly effective. Broadly speaking, collection of open source intelligence falls into two categories: passive collection and active collection. Passive collection often involves the use of threat intelligence platforms (TIPs) to combine a variety of threat feeds into a single, easily accessible location. While this is a major step up from manual intelligence harvesting, the risk of information overload is still significant. Advanced intelligence platforms like Recorded Future solve this problem by using artificial intelligence, analytics , and natural language processing to automate the process of prioritizing and dismissing alerts based on an organization’s specific needs. In a similar manner, organized threat groups often use botnets to collect valuable information using techniques like traffic sniffing and keylogging. On the other hand, active collection is the use of a variety of techniques to search for specific insights or information. For security professionals, this type of collection work is usually done for one of two reasons: A passively collected alert has highlighted a potential threat and further insight is required. The focus of an intelligence gathering exercise is very specific, such as a penetration testing exercise. Open Source Intelligence Tools To close things out, we’ll take a look at some of the most commonly used tools for collecting and processing open source intelligence. While there are many free and useful tools available to security professionals and threat actors alike, some of the most commonly used (and abused) open source intelligence tools are search engines like Google — just not as most of us know them. As we’ve already explained, one of the biggest issues facing security professionals is the regularity with which normal, well-meaning users accidentally leave sensitive assets and information exposed to the internet. There are a series of advanced search functions called “Google dork” queries that can be used to identify the information and assets they expose. Google dork queries are based on the search operators used by IT professionals and hackers on a daily basis to conduct their work. Common examples include “filetype:”, which narrows search results to a specific file type, and “site:”, which only returns results from a specified website or domain. The Public Intelligence website offers a more thorough rundown of Google dork queries , in which they give the following example search: “sensitive but unclassified” filetype:pdf site:publicintelligence.net If you type this search term into a search engine, it returns only PDF documents from the Public Intelligence website that contain the words “sensitive but unclassified” somewhere in the document text. As you can imagine, with hundreds of commands at their disposal, security professionals and threat actors can use similar techniques to search for almost anything. Moving beyond search engines, there are literally hundreds of tools that can be used to identify network weaknesses or exposed assets. For example, you can use Wappalyzer to identify which technologies are used on a website, and combine the results with Sploitus or the National Vulnerability Database to determine whether any relevant vulnerabilities exist. Taking things a step further, you could use a more advanced threat intelligence solution like Recorded Future to determine whether a vulnerability is being actively exploited, or is included in any active exploit kits. Of course, the examples given here are just a tiny fraction of what is possible using open source intelligence tools. There are a huge number of free and premium tools that can be used to find and analyze open source information, with common functionality including: Metadata search Code search People and identity investigation Phone number research Email search and verification Linking social media accounts Image analysis Geospatial research and mapping Wireless network detection and packet analysis Start With the End in Mind Whatever your goals, open source intelligence can be tremendously valuable for all security disciplines . Ultimately, though, finding the right combination of tools and techniques for your specific needs will take time, as well as a degree of trial and error. The tools and techniques you need to identify insecure assets are not the same as those that would help you follow up on a threat alert or connect data points across a variety of sources. The most important factor in the success of any open source intelligence initiative is the presence of a clear strategy — once you know what you’re trying to accomplish and you’ve set objectives accordingly, identifying the most useful tools and techniques will be much more achievable. To learn more about how Recorded Future can help organizations better understand and prevent threats, request a personalized demo today."
            }
        },
        {
            "https://www.recordedfuture.com/architecting-dream-security-automation/": {
                "metadata": {
                    "dateAccessed": "2022-04-03",
                    "dateCreated": "2022-02-17",
                    "source": "www.recordedfuture.com"
                },
                "text": "Architecting Your Dream Security Automation? Here’s What You Need To Know February 17, 2022 •\nSam Langrock Few topics spark conversation like security automation. Automation is the entire premise around programming; routines and repetitive patterns are tasked to computers while humans work only on higher priorities. For security practitioners, this is essential because even a small network can have thousands of endpoints that need protecting while the security staff is miniscule. Yet the challenge facing organizations in 2022 is how to automate, not just the collation and data collection tasks where machines excel, but to automate the repetitive human decisions made daily to defend an enterprise. Join us for a three part blog series on automation and for a webinar on February 22nd titled, “Fight Ransomware Robots With Automation Intelligence”. In 2017, vendor research firm Gartner coined the term “SOAR: security orchestration, automation, and response” to describe the emergence of tools custom built to solve the problem of automated response. Many of these early tools were straightforward and offered limited functionality to service specific workflows. As these tools matured, several added case management functionality to supplement the programmatic security workflows. These workflows, typically called playbooks , were designed to allow security teams to translate their manual security analysis and response runbooks into a programmatic flow the SOAR application could apply. Clear, documented security processes were vital. What quickly emerged was that these solutions, while valuable, were far from turnkey. First, SOAR applications did not come with any playbooks out-of-the-box in an attempt to stay neutral to the wide variety of technologies implemented across different enterprises. As a result, clients often struggled to gain quick value out of a fairly complex security appliance. Second, security teams often relied on external sources of information to validate maliciousness and convict detected suspicious events. Security events are not automatically malicious, but more akin to “indictments” with further evidence required to “convict” the incident as malicious. Security analysts used a variety of external threat intelligence: from threat feeds—publicly available technical indicators ingested into a SIEM—to bespoke databases curated by the security team to queries on public search engines for open source articles and blog posts mentioning any IP address, domain name, or file hash value in your investigation. While SOAR applications were capable of ingesting threat intelligence data, the fidelity and speed of threat intelligence became critical—and too often lacking. Without actionable, real-time data on active and emerging threats, it’s impossible to effectively and proactively reduce risk. Join us for a webinar on February 22nd titled, “Fight Ransomware Robots With Automation Intelligence” to learn more about how automation can assist your organization."
            }
        }
    ]
}